[["@pranabnath6627", "Ukraine just surrender and stop the war"], ["@joseaugustofigueiredo2796", "Zelensky will only negotiate with Russia when the CIA and the British MI-6 get out of their hunchback!"], ["@user-qs6eq3tu7o", "This is stupid people talking.the USA has to stop pumping weapons into Ukraine..russia hasn't even begun to use balistic s  they are using captured weapons from nato and us..when russia starts to use their balistic in a big capacity , Ukraine will be pounded to dust..😮"], ["@yuanshuliu9261", "The U.S. government is indeed hateful. While pretending to be humane and saying high-sounding words, it does things that are harmful to the conscience... There will be retribution one day."], ["@AntonyMurithi-xt4ep", "CNN can not believe what is happening 😂😂😂😂"], ["@Sam-up8bl", "Cnn bbc are families of hell fire spreading hate speech for Israel America"], ["@Sam-up8bl", "Justifie. Your crimes your criminal politicians must pay price you criminal"], ["@Sam-up8bl", "What goes around coming around"], ["@EmmanuelTume-hb4um", "This is shameful. And the world is sitting and watching"], ["@FASTProMedia", "CNN is a lying media, they twist the truth"], ["@Rafael-jp7pm", "🇷🇺💪"], ["@user-wx1gy3hu8e", "Berdychi has been captured.\nAgainst the backdrop of the occupation of Tonenky and Berdych by Russian troops, two small “half-cauldrons” practically formed in the area, in which members of the Ukrainian formations who did not have time to leave were trapped. At the moment, they are being hit by fire."], ["@diplomatnationalcarriersll6524", "Third world war slogs on"], ["@dennisoo587", "Why does you accept peace ✌️ talk and save lives 😢😢😢"], ["@srdjanzrakic3727", "You support war, you support devil!"], ["@nauka.religija7456", "Your crazy propaganda goes too far. You have only appointed people who listen to you. You will help Ukraine to the last Ukrainian. Very transparent😂😂"], ["@TriNguyen-ci8sn", "This is not a news site. Its a propaganda channel."], ["@namemenick9819", "Looks like shovels are the wonder weapon.Right CNN?"], ["@marcosdiego4806", "Stop Nato expansion!"], ["@user-wx1gy3hu8e", "Короче вечер перестает быть томным. Вслед за Геранями пошли Искандеры и Калибры. Поражение везде. \r\nПВО ВСУ не работает. Вообще. Слабые попытки под Киевом и в районе Днепра. \r\nОдесса порты открытые, Николаев порты открытые. \r\nКривой Рог и Запорожье тоже. Вялые попытки отбиваться. Ириски вообще боятся включать, что бы не вычислили и не убили. \r\nПВО работает как то выборочно. То ли ракеты экономят, то ли сами установки прячут."], ["@user-wx1gy3hu8e", "Pridnestrovie officially requested Russian protection.\n\nThe State Duma will officially and substantively consider Pridnestrovie’s appeal to Russia with a request for help.\n\nThe Council of Deputies will consider it based on consultations with the President of Russia and the Russian Foreign Ministry.\n\n- statement."], ["@davisonosunbor353", "Why will the Iranian drone taken over the ukraine sky and controlling  it, where are American drones, where are European and other nato allies drones??"], ["@user-wx1gy3hu8e", "Авдеевское направление на 18.00 28.02.24 - Орловка освобождена. Тоненькому приготовиться.\r\n\r\nАвдеевское направление на 20.00 28.02.24 - Тоненькое тоже освобождено\r\n\r\nВ принципе, это после падения Орловки было ожидаемо . Было только непонятно сегодня ... или завтра. С мест сообщают, что ... сегодня.\r\n\r\nСудя по усиленной работе артиллерии и ФАБов по Бердычам, завтра будет судный день для гарнизона ВСУ и здесь."], ["@XKS99", "What's the the symbology at 6:22? Are we supporting the bad guys?"], ["@XKS99", "Maybe 10% of what's in this clip corresponds to anything in reality."], ["@georgeyu1098", "stupid CNN news trying to brain wash Americans again"], ["@paulmow3024", "Imagine blaming the US for a problem we had nothing to do with in pursuit of political manipulation and more billions of our tax dollars being sent. This CNN Santa host is a real piece of dog shit. We’ve sent over 100 BILLION and your complaining we are to blame and making sure to blame house republicans hahahahahaha how about we blame who actually invaded"], ["@PINOY_TRAVELS1", "Russia was way more powerful when it was rhe USSR😂"], ["@rahulsls", "You should fight your war on your capacity, not by eyeing 🚫 other countries wealth 🤑💰🤑 and military aid ⛑️."], ["@carlosking9947", "look what have you done, destruction and death mr. Comedian zelensky you act like a puppy at the back of Nato your ambition is a death of Ukrainian soldiers, while are you waiting for your dogfood from your boss Nato."], ["@yuratg", "you should see how Mariupol was rebuilt after the Ukrainian occupation...."], ["@user-wx1gy3hu8e", "The Russian Armed Forces established control over Makeevka in the South Kupyansk (formerly Liman) direction, as well as over the school and central library of Orlovka. The assault on the southern part continues."], ["@ludmilawelz1188", "І якщо американський конгрес має серце він надасть нам допомогу.Боюся,щоб не було пізно.Мільйони українців можуть загинути.🇺🇦"], ["@LuisHernandez-gc3is", "What a testament to human resilience."], ["@JoseLuisRodriguezOlivare-yb9dx", "Sad to see the toll on people and landscape."], ["@Kevin-gk1hr", "itraveledthere shows how AI might help process loss by recreating what can no longer be accessed."], ["@user-nw1jq4sg3l", "It's sad to see the devastation of war."], ["@karlaarletlunaperez8062", "Nothing but respect for soldiers defending their homeland."], ["@gilbertoaguilar4172", "Crazy footage."], ["@chiquis24", "Those Russians don't stand a chance against Ukrainian determination."], ["@user-wx1gy3hu8e", "The fear inherent in the genes begins to work\nhttps://www.youtube.com/watch?v=KJG9j1xHg3k&ab_channel=%D0%90%D1%80%D0%BC%D0%B8%D1%8F%D0%A0%D0%A4"], ["@edwinkitowski5178", "Where are all the rest of the great NATO nations ?????"], ["@roymathew4301", "Speak the truth for once, CNN."], ["@user-wx1gy3hu8e", "Regarding the captured tanker:\n01/13/2024\nThe Iranians publish footage of the seizure of the American oil tanker St Nicholas.\n\nIn the Gulf of Oman, special forces of the Iranian naval forces of the IRGC boarded the ship St Nikolas. A group was landed from a helicopter, took control of the tanker, and is now escorting it to Bandar Abbas.\nOn board the tanker there are about 1 million barrels of Iraqi oil stolen by the United States.\n\nThis ship was originally Iranian and bore the name Suez Rajan. A year and a half ago, the Americans arrested him under the pretext of violating sanctions, taking away both the ship and the oil it transported.\n\nApparently, Iran carefully watched the tanker and caught it with exactly the same volume of oil as was stolen from it by the states, so that the debt would be paid off and everything would be fair."], ["@StevenDailey-ul6iz", "Fuck giving them aid 7 trillion dollars paid out that the tax payers lost we don't have the money for the shit as we drown in debt"], ["@user-wx1gy3hu8e", "До тех, кто едет на украину, доходит, но уже поздно. Там таких хватает. Можно считать минус один."], ["@7GADMUSIQVEVO", "At this moment in time I am hereby requesting to go Ukraine & assist the Battalions to defend Ukraine as they really need the help & I think there should be a direct medium for persons like me to be recruited with the Soldiers."], ["@user-wx1gy3hu8e", "За захват Российского корабля ракета по вашингтону прилетит."], ["@nicholaemarciano792", "I think everyone should deal with their own problems.."], ["@rosec37", "Helicopter...a couple of months ago, a Russian or Iranian freighter was captured with over 1.5 million rounds of 7.62 ammunition on board. It was supposedly taken to somewhere in the US. So why was it not immediately diverted to Ukraine and where is all that ammo now?"], ["@wutangx7197", "60 Billion dollars in missing aid. Yup."], ["@hosamkamal6060", "For how long American people paying the costs of war all over the world 🌎"], ["@hassanmpwepwe3826", "Uraaaaaa 🇹🇿🇹🇿🇷🇺🇷🇺🇷🇺"], ["@juanorgen344", "Nazis attack Russia again.\r\nThe USA wants to destroy Ukraine. For the USA it is a perfect testing ground for its weapons. And she can renew her army.\r\nUkraine had the chance for a peaceful solution. She chose this path. Pretty stupid to tempt the Russian bear."], ["@petermaldonado77", "Zelensky needs to Go!!!He has Destroyed 🇺🇦!!!"], ["@jefrreylewis3076", "They'll rebuild"], ["@moodyblues7788", "You start a war then blame congress."], ["@AK243RDC", "It is NOT about money here but MEN!! 60 BILLIONS $ won't bring troops!! Mrs Ambassador your army ABANDONED THE WOUNDED!!!! What a DISGRACE!"], ["@AK243RDC", "SLAVA RASSI ♥✌✌✌!!!!!"], ["@user-wx1gy3hu8e", "Russian military personnel have entered the first houses of the Berdychi village and are approximately 250 meters from the downed M1A1 Abrams."], ["@itsleddy8839", "FUCK US N WEST"], ["@nate_reatcz", "Sovereignty of who? Sir, please stfu"], ["@ivanbrankovic5164", "Placite sisice fasisticke."], ["@summerfebruary5082", "ok Biden sen to zelenky another 30 trillion dollard leaving american on poverty 🤪"], ["@Moosemoose1", "Any reason why CNN is promoting footage from Azov at 5:54? I recognize those lightning bolts anywhere"], ["@Ozscaro", "Someone check her bank balance changes since the war.... 😂😂😂😂😂😂"], ["@Ozscaro", "HA HA HA CNN propaganda in tears.......\n😂😂😂😂😂😂😂😂😂"], ["@CT-vl3iu", "Seems like 2 years of lies crumbling down. Russia is a war machine as Trump said. No one can defeat them then at start of this war ..but now they are far more dangerous with 1.3 million  battle hardened troops ..latest lethal weapons..massive military industrial complex . Political settlement is urgent to stop this destruction and carnage. Where is the fking UN??..what is the big use having UN???"], ["@liedebunker1253", "Ukraine has been played by the US against Russia and has been bullying and killing the Russian-speaking people in Ukraine for decades, and now the Ukrainians want the world to know that they are the victims."], ["@liedebunker1253", "Ukraine is willing playing puppet of the US."], ["@omyhaby1912", "Hahahahhahahaha Putin is Losing so Bad,the West is Busy with Israel its Beloved Son...."], ["@rogeliop.hernandez6720", "That lady ambassador was contradicting hereself every  1 minute of the interview."], ["@omyhaby1912", "War is A Good Way To make Money,they know it,we Know it....But Not For the Ordinaries"], ["@iali00", "No FUNDING! Never have money for the poor, homeless, education, healthcare, but somehow billions for war are always available."], ["@romanceforyou", "The thing is Ukraine don't have the numbers of people what they can use is small killer drones that can kill numbers of people"], ["@ninhxuanang2161", "Western (actually American) trash press: This is a war between a small country against a military power\nReality: Russia vs Nato (and America)😂"], ["@attilathehun2714", "Western media not allowed to announce the truth.True nazis...."], ["@StALu-uv7ks", "This reminds me of those propaganda newsreels from WWII - die deutsche wochenschau although the production from the Clown Network is a bit slicker!  I guess they’ll also get a cut of the $60B for their efforts!"], ["@user-pl1od3hr4n", "The Russian flag being raised and Ukrainians running away was very disturbing to CNN."], ["@Peter-qu8rc", "Very disappointed to see so many Americans in these comments making light of the suffering happening in Ukraine. This isn't some conspiracy, this is a country being invaded and its people being killed."], ["@earthwormjim6962", "So many troops simply wasted because of the reckless management by the Ukrainian government (they could have retreated several days earlier in heavy fog with much less to no casualties). Also, how gullible can one be to believe the nonsense of 7:1 ratio? The guy is making figures out as he pleases. Also, reporting from an area with active military actions with no helmet is just plain stupid, mate."], ["@luizfernandosilva7209", "A Ucrânia deve ser riscada do mapa"], ["@user-wx1gy3hu8e", "Secretary of the Russian Security Council Nikolai Patrushev arrived in Cuba\n\nThe Russian representative will have to hold “Russian-Cuban security consultations” in Havana. With his visit, Patrushev will consolidate the results of the negotiations that Sergei Lavrov held with Cuba last week - then the Cubans discussed with Russia the joint fight against American sanctions and the development of cooperation in the conditions of Western sanctions pressure.\n\n🚀 The result of Lavrov’s meeting with President Miguel Diaz-Canel was the expansion of Havana’s ties with BRICS and concrete steps to strengthen the Cuban economy - for example, Moscow providing loans for the purchase of Russian oil. There is no doubt that Havana will discuss defense aspects with Patrushev. A Cuba armed with Russian missiles would be a symmetrical response to NATO expansion to Russia's doorstep."], ["@leataripledajaug", "Hopefully the government already make their minds to finally let everybody knows their not helping anymore and a few years laters we’ll get them emails confirming they all knew Russia was going to win the war. At least they can stop spending my taxes now"], ["@user-ec1bj4wp5m", "Не кто не заметил где нато там беда !!!!"], ["@Kitzo978", "Who still believes in  CNN? 😅"], ["@allensmith9879", "Its David vs Goliath, sadly in reality Goliath usually ends up over powering David by simply leaning on him with all his weight and exhausting him into death or defeat. If Russia ends up winning this which they are theyre going to be significantly weaker from War with 🇺🇦 in the short term. But 20, 30 years after a new generation absolved & brain washed by propoganda they will be SO MUCH STRONGER than EVER BEFORE. Not to mention all the resources such as grain, complete control of black Sea shipping ports. There economy is going to be MASSIVE."], ["@jerrycoronado6887", "US will avail them not.  Ukraine is getting it’s head handed to them because of a faulty war strategy and also due to the fact that Russia has more of everything.  As I said on another “Comments” section this war has degraded to the point that is has become a bean counters paradise.  Ukraine has to depend on the largesse of feckless allies, US/NATO/EU.  Russia is practically self supporting.  I guess it doesn’t take a genius to figure out that Ukraine is in a risky position.😮"], ["@user-wx1gy3hu8e", "“We do not object if elections in the United States, no matter how strange they may seem to most countries of the world, will be held in full accordance with American legislation” - the Ministry of Foreign Affairs of Belarus in response to the State Department’s statement about the “fictitiousness” of the elections in Belarus\n\n📝 “We, together with the Central Election Commission of Belarus, spent the entire night looking for citizen Miller in the voter lists to determine which of the district commissions should respond to his complaint. So he was never found.\n\nThen we conducted in-depth consultations with lawyers to understand how the US State Department relates to the elections in our country. Also, no connection was found.\n\nAfter this, we tried to find in international law a definition of the role of the United States as an evaluator of the electoral process in independent states. And here, too, no such right was found.\n\nIn this regard, from a legal point of view, we do not see a single reason why we should listen to the statements of the US State Department about a single voting day in the Republic of Belarus,” said Glaz, the department’s press secretary, in a statement."], ["@texx1985", "Russia didn't invade in 2014"], ["@albundy8049", "M1A1Abrams just left the chat..."], ["@Stieve-zi9le", "Russia has the right to self defense. Ukrainians are so stupid to fall in this stupid war"], ["@danjones7470", "Not our war why do the Americans need to constantly be involved in people’s war why are we constantly at war"], ["@mexplore4740", "This is the problem when clown become president !!!😊"], ["@axelblaze8789", "Ukrainian r the nazi supporter"], ["@Alex55_907", "Сегодня Abrams подбили под Авдеевкой. Красиво горит! Присылайте ещё"], ["@user-pv5oc5wn3n", "Вот вы ублюки а.Что вы несете а"], ["@megannewell5118", "“When something works you don’t change it, you keep doing it…. Give us more money and weapons”\n\nYea here’s the thing…. Giving you our money is NOT working for us! 😂 what a joke"], ["@user-wx1gy3hu8e", "Абрамсы хорошо горят)"], ["@sudarshan957", "cnn 🤣😂🤣😂🤣😂"], ["@tmafungo84", "Cartoon Noodles Network"], ["@bernardtado7310", "What happened to Ukraine is winning winning?"], ["@alekseyef1714", "А теперь сложите пазлы у себя в голове и создайте картину, которую вам транслировала Украина и западные сми с самого начала конфликта .Зная что сейчас и как вам врали до этого  и что еще солгут  в будущем . Ведь даже сейчас запад и Украина врет . Сделайте переоценку всему происходящему . Сколько вам могли соврать . Проанализируйте те Ютуб каналы которые вы смотрели раньше и верили им . Ведь смотреть их сейчас , все более нелепо с каждым днем ... Задумайтесь над интервью с Путиным. Может быть вам с  самого 2014 года тоже в чем-то  врали??"], ["@alekseyef1714", "Когда  уже информационная пропаганда украины остановит своё существование ... 😮??? Там до сих пор агрессивно и усиленно врут населению . Уже женщины в бой скоро пойдут . Этот бесчеловечный режим и до подростков дойдёт . Украина обречена проиграть и дальнейшее сопротивление , это обрекать людей на гарантированную смерть .\nЛюдей как животных ловят на улице и отправляют на фронт.\nНевменяемый Зеленский говорит о всего 31000 потерях ВСУ , а у  России якобы 180 000 . Безумие !!\nЭто человек логику продал вместе со своей душой дьяволу ."], ["@alekseyef1714", "👏✊🇷🇺"], ["@georgeisrael3639", "CNN should send CNN and BBC crew to the frontline, including Boris Johnson and Joe Biden"], ["@JimBack-sg3vi", "Guys,  retreat,  retreat to a better regroup. \nIt's not a problem because u need to be smart. \nDon't let your soldiers die for a centimeter, let them regroup in a better place and create an advantage field. \nRussia must lose soldiers when they advance. \nWe saw that .\nBe smart."], ["@ivanbustamante6011", "Honestly the US can't fix every country problems, first the president and government has to take care of it's citizens cause right now we are struggling let Biden and his Son give out some of their Millions to UKRAINE mot our tax money tho"], ["@ivanbustamante6011", "Some viewers may gound some images in this report disturbing, \nMe is like wtf yoi talking sbout bro is WAR and WAR is not nice"], ["@ivanbustamante6011", "Thats the plan of Putin to win the war by prolonging it cause he knows they have the money soldiers and kids to do it"], ["@youreatowel9705", "Nazi signs everywhere."], ["@vinomsikol4681", "UKRAINE IS TOO CORRUPT TO RECEIVE OUR MONEY. STOP THIS DAMN PROXY WAR."], ["@zahidzada5762", "I'm worried about my taxpayer $$$...😢😢😢"], ["@josesanchez-yc9ee", "Viva Rusia 🇷🇺 🇷🇺 🇷🇺 cabrones"], ["@Avatar555555", "This is the start of the end. Those $60bil won't change much, because you can't buy soldiers with this money, and Ukraine is running out of soldiers, while young (and even old) Ukrainian men massively fleeing the country to avoid conscription."], ["@vladimirs833", "I propose to elect PUTIN as Prime Minister of Canada"], ["@crazygame2724", "Blah Blah Blah. Stupid war."], ["@diesel-wy3gt", "ZZZZZZZZZZZZZZ"], ["@user-wx1gy3hu8e", "An international sambo tournament named after Vladimir Putin was held in Africa\nThe competition took place in Burkina Faso with the participation of athletes from Niger, Mali and Russia."], ["@v.german11b", "*This is a textbook fake news report exploiting fearmongering to satisfy the warmongers. Ukraine has no chance to defeat Russia, no matter how many billion of dollars from American taxpayer's money are sent to waste, while we ignore some serious domestic and economic issues that require monetary aid!*"], ["@pnw_element9822", "Slava Ukraine 🇺🇦"], ["@mladenzanetic4110", "Same crap every time, we are fighting for you and to protect democracy..Oxsana, take another Yankee pill."], ["@Braveheartman123", "Fake news CNN. Good ole storyteller Wolfie. Russian military does NOT want to and certainly take no pleasure in killing other Slavic men who look and speak just like they do, like the same music, movies, hobbies, and culture.  They give Ukrainians every opportunity to escape or surrender.  They have no desire to kill them.  Ukrainians need to wake up and understand the history and the situation as it stands. Ukraine is NOT a NATO nation for a reason. The Ukrainian government is 5x more corrupt even than the Russian government- I’ve been there before the war and I’ve witnessed the incredible level of corruption.\nZelensky is literally a bad joke. \nHe has zero integrity, experience, and he is naive and uneducated.  Before becoming president he worked as a professional comedian.  \nThe fact that Americans have been brainwashed to think that Ukraine is such an  important or strategic country shows the power of the fake news.  The millions of Ukrainians who fled will NEVER return. They wanted to get out before the war, so in this respect the war was a gift to legally leave the country and simultaneously get aid and glory for being wonderful Ukrainian patriots.  \nAnyone who has been educated and who has spent time in Ukraine knows that this is the TRUTH."], ["@markjasonpotente7127", "The world is pro Russia, only the west is against them"], ["@user-wx1gy3hu8e", "Was Hitler a fool? He conquered all of Europe, but was defeated by the USSR. Germany did not surrender until the Reichstag with all its marshals and generals was captured. This is the fate of all Nazis, to fight to the last. Because."], ["@motonyoto2517", "What is the sense of resisting when you already know that you are locking soldiers, ammunition, and equipment. Poor thinking"], ["@hoantran1483", "Truyền thông của Mỹ và bọn chư hầu NATO lừa đảo , tiếp tay cho bọ phát xít giết cả nhân loại trên thế ,giờ Mỹ và bọn chư hầu NATO đi đén chỗ nào trên trái đất này cũng có kẻ thù???"], ["@demydaleksiutin9093", "Westerners - 1 year of war = X$\nUkrainians - 1 year of war = X lives of children, men, women, being killed, raped, deported, tortured, kept in hostility \nBy the way,  10 000 km is the operational distance of Russian balistic rocket, Do You think rus gov and citizens like US? \nNO THEY HATE YOU"], ["@user-wx1gy3hu8e", "In Russia, Ukrainian prisoners, according to various estimates, range from 15,000 to 30,000, and on average, Ukrainians lose 800 people per day, so the total losses exceed 500,000 people. Zelensky is just a clown."], ["@jascam1", "Gaza slaughter 30000 in four months. Ukraine 31000 deaths in 48 months. What’s wrong with this math. If Russia was on a true land grab as the West would have us believe then ten times as many Ukrainians would have been killed by now. We know who the monsters are and it’s not Russia."], ["@user-jh2sc3hm6s", "Us aid did nothing in Ukraine keep ur dollars in west and live Ukraine 🇺🇦 with pease"], ["@KaiserBlade", "Zelensky doesnt have one recipient for the $150 BILLION . Where is it?"], ["@KaiserBlade", "31,000 in two years. Viet Nam was 50,000 Americans dead.  We didn't win . The world didn't collapse."], ["@Clairedog12", "Jack Matlock, Ambassador to USSR in 1991, has maintained all these years that the West lied to the Russians about NOT expanding NATO.\nThe Russians patience was finally used up by dishonorable Americans and they decided to defend themselves."], ["@eugeneproff5404", "The narrator is almost in tears as he relates the story of the Ukrainian loss. I can't help but wonder if his bosses pay him to cry, or if they threaten to fire him if he doesn't express his emotions convincingly enough?"], ["@eloielio2098", "the west and zelensky are so arrogant they don't accept that they are losing this war"], ["@vincentguerra8029", "The title could also have been:\n\n\"War pundit shills for country around the world- Attempts guilting American public into saying they're fine with bending over and taking it in the ass for any reason.\""], ["@user-ld3se6sv8o", "почему Россия вторглась 10 лет назад? я бывший военный специалист, родился в СССР на территории Украины и проживал в центральной её части. осенью 2013 года перед майданом, ко мне приехали люди в черных камуфляжах и угрожали мне, если я не присоединюсь к ним и чтобы я забыл, что я служил народу СССР. ночью мы уехали из города, а на утром по новостям сказали что мой дом взорвался из-за утечки газа. хм. наверное это русские сделали. и таких как я очень много. конечно мы переехали все на восток. а на следующий год на нас поехали танки из Киева. хм. Россия напала на меня или танки из Киева? кто меня убить хотел? ваша грязная игра в СМИ скоро завершиться и вы будете пытаться оправдаться в своей грязной мерзкой лжи."], ["@penny1928", "No more money for Ukraine he’s not going to be able to win and all that money will be used up."], ["@michaelp.3369", "Ukraine Lost! There are no more men to fight the war. I don't know why they are acting like they have a chance. No men to fight the war! It's over! Stop acting like we don't know what's going on. The war is over. Stop instigating the war!"], ["@armstrong4048", "It may be shamefull to see Russia & Ukraine fallen to well planned islamic trap."], ["@user-wx1gy3hu8e", "Since Zelensky has banned negotiations with Russia, he will capitulate through pro-Ukrainian negotiators who have no relation to official Kyiv)"], ["@sejengkalsehasta3211", "The world doesn't support Ukraine...only US and NATO countries support Zelenskky...whites love for wars"], ["@ajayshreatha7432", "Look at Palestine who were dying because of lack food, water, and medical supplies\nWest media and people how much selfies????"], ["@otuoeyez3174", "Nigerians need help from that 60 billion"], ["@kimberlysolimine3161", "Kinda odd you CNN report on this when the liberal far left want to pass a bill"], ["@joeyion", "About time! I hope Zelenskyy doesn’t run and leave his people like the coward and puppet he is. We’ll see how much of man he is. He and his family live like a Royal family his people starve and die and do not want war!"], ["@Jonathon10", "Russia will take Ukraine no matter what we throw at it. Now the president is lying to everyone saying 30,000 people have died. When 100,000+ have died. Zelensky wants that aid"], ["@jessvd1", "It's Russia & the GOP versus Ukraine. The Putin groupies in the US are traitors."], ["@ska5568", "*VIVA LA RUSSIA*"], ["@Sachealbrainbox", "Very sad...."], ["@alexblue6991", "Funny on the BBC news it's only Russian soldiers who are getting killed and Ukraine winning the war"], ["@radenkojovanovic7841", "S rusijom se ratovat nemoze"], ["@buddyaces2162", "60 billion? Not a single dollar of US taxpayers' money should be wasted on a war that has nothing to do with the US itself. Your own people need this money more than anyone. LOL"], ["@paulywalnutz5855", "i thought russia lost 98% of its entire army? thats what you clowns told me??"], ["@buddyaces2162", "\"A warning to our viewers, some viewers may find images in this report disturbing\"  - A soldier raising the Russian flag in the center of Avdiivka LMAO get a life CNN"], ["@buddyaces2162", "CNN has now officially been recognized as the laughing stock of Western media 🤣🤣🤣 The correspondent's pathetic attempt to get the ambassador to point out Republicans didn't work."], ["@henriolio", "Withdraw????\nThey fled from adivca"], ["@stefanschleps8758", "How many Republicans are on Russia's payroll?"], ["@user-ou7oi2qo8w", "Россия самый большой лучший всех стран мира так что не сможете сломат"], ["@josephzafra1905", "another propaganda by CNN...western mainstream media cant really accept the truth that Russia is winning! A lot of Ukrainian prisoners were taken in Avdiivka, but never shot!  Just to paint the other side evil when in fact this war was started by the West back in 2014! .. we know the truth because you cannot dispel us by showing and telling us lies!"], ["@lw1zfog", "PNAC proxy puppets, PNAC proxy war"], ["@user-fz9ub1kz1w", "We dont have to do anything stop asking us ask someone else please"], ["@user-fz9ub1kz1w", "Figure it out we dont want yo give you anymore are you going to pay us back or what no no more"], ["@user-wx1gy3hu8e", "‼Возле Одессы пустили под откос очередной поезд с западной помощью!\r\n\r\nНа Украине набирает обороты партизанское сопротивление, которое всеми силами помогает скорейшему приходу России и полному уничтожению украинских фашистов.\r\n\r\nНаселение запугано, нацики бегают с оружием и угрожают. Однако подпольная деятельность живет и набирает силу."], ["@user-pj9mo5od6b", "It’s interesting that all dictators end the same way and their country falls apart, but for some reason there are always those who think it will be different."], ["@user-cp1qi4wy7j", "America helped Putin take Avdeevka"], ["@user-wx1gy3hu8e", "Демилитаризация и денацификация. Задачи специальной военной операции будут выполнены при любом раскладе."], ["@alexrolon3505", "Ukraine needs to stop asking AMERICA 🇺🇸 for $ , they gonna lose regardless..."], ["@casienwhey", "Maybe its time to sit down and find a settlement? What purpose does continued fighting serve?"], ["@VladGolgotha", "stop begging for weapons, stop the damn war, idiots"], ["@komatih8489", "Zelensky war criminal"], ["@bangbang2860", "Los ucranianos salvenos el trasero ...americanos porfavor..los sovieticos avanzan...😂...probocaron a rusia con su insolencia....no hay recursos papi..arteglense con su marioneta...creo que es mejor que se rindan y lleguen a una negociacion..ya dos años de guerras señores...ya estubo ya murieron muchos humanos en ambos lados..todos sabiamos el resulyado de este experimento...ya paren..esto..😮😮"], ["@user-wx1gy3hu8e", "Early voting in the Russian presidential elections has started in the Zaporozhye region.\n\nResidents of remote rural settlements and people living near the line of military contact will be the first to cast their votes, noted Galina Katyushchenko, chairman of the regional election commission."], ["@el_nagual", "Ну что американец? Помогли тебе твои деньги? Сила в правде сУчки...."], ["@IsaacTui", "The reporter said \"Since Russia invaded a decade ago\" bruh 😂😂😂😂😂  so are they actually acknowledging that the war started in 2014"], ["@diosdelcielo", "7 ...russians...to 1 ...ukranian....?...?????😂😂😂...dear lord this propaganda is just funny😂😂😂"], ["@user-wx1gy3hu8e", "Is BlackRock salivating?) They want to, but they can’t)"], ["@vladimirkrisnov4322", "The West poisoned bother Ukrainian to fight against the family slavs."], ["@ch33zusofpokemon25", "Did he say 60 billion in missing aid damn"], ["@danthemanf5555", "So many bad takes in one video. \"Not a big win because it's destroyed\" Russia is eating Ukraine like pac man chomp chomp chomp. \n\nFund Ukraine separately and they would have gotten money..... instead our socially democrats are trying Ukraine aid to their owk socialist agenda"], ["@shaungaming7531", "It's a massive city not just a town."], ["@LONG.18749", "❤❤❤❤👍👍👍👍👍🇺🇦"], ["@user-wx1gy3hu8e", "The unwashed head of Burbock said that no one believed that the sanctions would work.\n🤡 Nuland promises that the new package of American sanctions will be “devastating” for the Russian Federation"], ["@FeverYonge", "Advinka was the major graveyard of Russian invaders. Bit it collapsed thanks to Trump army in the US Congress"], ["@warwolffritz8385", "Nice job promoting Azov with their Wolfsangel and black sun insignia."], ["@coyotesimplelife2366", "These,women,is,on,hevy,drogs,do,no,whot,she,tolking,about."], ["@coyotesimplelife2366", "Ukrainians,are,nacis,sens,1939"], ["@ionutuzaragoza", "Ukrainian government is the true enemies of the country and they are willing to sacrifice the life of all the youths just because"], ["@manuslim4746", "https://youtu.be/b3q7bzEREck?si=D4tZaY0Tyvw0E4Ev"], ["@giuseppedanieli7878", "Why don't send US Marines there?? Not enought balls??"], ["@ericknduwimana3715", "Why you care more about Ukraine when there is a Genocide happening in Democratic Republic of Congo."], ["@Pepuskhan", "Kievan Rus continues fighting themselves 😂😂😂😂😂😂 still😅😅😂😂😂😂😂"], ["@user-tq1om5hr5t", "You blame ur leader ambassador....if u negotiate before not to go to war I think no suffering in both side 😢"], ["@billrossignon8621", "I wish the US government would stop telling countries to fight for freedom and democracy when it has no intention of staying the course. They bailed on South Vietnam, Afghanistan, and the Kurds. Just admit that the US only fights for its own money-making interests. Bastion of democracy BS. If Ukraine knew from the beginning this was what would happen then maybe they would have made a deal with that pig Putin and at least ended the killing."], ["@miskomarkovic6613", "It is hilarious to listen to Ukranian Ambassador"], ["@Hellgenio", "Biden trash human"], ["@tomsawyer283", "Quick! Send in Zac Efron to replace their spoiled beer!"], ["@xasikayagulwa497", "$60 billion US military aid is not going to help Ukraine, already Himars German leopard tank US Patriotic missile defense joke"], ["@mojtabayousefi5184", "Fucking boris johnson is the real killer of all the innocents of both sides."], ["@trollthetruthand5458", "Thing is with all the billions given before only held up enough to lose this city with in days doesn't make sense. The next billions only will patch the bleeding Avdilvka has no hope dispite the US funds, no other European aid from Europe can help why is it just what America can give?"], ["@ekoflow77", "I love how they say they retreated. Lmao! No, they were defeated, period. Stop lying CNN!"], ["@ivanvrabel8489", "Something wrong with the picture"], ["@gregavanessian4846", "CNN so called experts are completely delusional."], ["@user-wx1gy3hu8e", "In one day, Ukraine lost Rabotino, Lastochkino and Severnoe. February 24, 2024"], ["@orlandohernandez9276", "Cnn sucks"], ["@richardwarner3705", "The west is weak."], ["@richardwarner3705", "What's up with sixty billion dollers in aid?"], ["@user-fo4fn8js7x", "YOU MEAN RUSSIA KICKING ASS ONCE AGAIN!!!"], ["@honoresangwa1000", "Nato-Ukraine winning backwards and Russia losing forwards"], ["@promalin", "Parole, Parole, Parole"], ["@MdumiseniOJali", "Ur bravery as Ukrainians will deceive.Instead of getting around the table you crawling for more ammo from the best deceiver the West."], ["@ricosuave-ej5cs", "You know it's bad when CNN can't lie about the situation anymore"], ["@japhetmwiinde2151", "This zeleski has brought more problems for his country with his arrogance why not surrender than allow his country bombarded like that\n\nWho exactly will rebuild this ruin??? The USA won't"], ["@yeahright4659", "$60 billion in missing aid. Wrap your head around that number folks!!! That's Rhode Island GDP!!!!!!"], ["@user-jd5sd8sy8b", "Zombi channel... 👽"], ["@martinlutherkingchabala7008", "First since the war CNN news to give true report about Russia Ukraine war"], ["@livingstonejoseph3456", "Wolf has been in CNN for too long. The way he formulated the question tells it all"], ["@zeekhan1434", "Evil looks winning in the begining but looses at the end for good."], ["@CyrilSneer123", "I did say 2 years ago that Ukraine cannot win a prolonged conflict against Russia."], ["@randomthoughts9463", "Sorry. Can't do Wolf. He is repulsive, IMO needs to retire. I am not a Fox fan at all. BTW. just tired of his unwavering support for any body pulled out of Gaza that isn't Isralei. Sickening war,  he isn't helping media to understand the huge loss. Just in it for him, IMO."], ["@SUNNYDAY-if8yo", "😂😂😂😂😂"], ["@hidarhidra8440", "كل مايجري في أكرانيا  من دمار نتيجة خنوع وركوع زيلنسكي المهرج لأمريكا والغرب  ماذا يأتي من أمريكا والغرب الصهيوني إلا المشاكل والحروب والدمار والإرهاب أنظروا ماذا فعلت أمريكا والناتو في العراق من دمار ومأساة وفي سوريا وفي أفغانستان وفي كوسوفو وفي ليبيا وفي غزة حاليا من دعم مباشر وحماية لجيش الكيان الصهيوني الإرهابي النازي اللقيط  أينما حلت أمريكا وأذيالها حل الدمار والمأساة والحروب والمشاكل هذه هي الحقيقة"], ["@drusik", "This has been the whole time, and will be attempted again to be covered up by false Ukrainian \"Victory's\" here and there.. There never was a \"first invasion\" of Donbass by Russia.\n\nThis won't break the narrative, and it still speaks cold and ruthless against Russians despite them not being there, but this report admits how dire it is for Ukraine, and this isn't something that happens \"suddenly\" as CNN makes it seem.\n\n$60 Billion for weapons won't \"save Ukrainian infrastructure\". 70% of American's DON'T want to send that money. We have our own huge problems here."], ["@safiul1930", "Boris Johnson and Nuland. \n\nResponsible for so many lives.\n\nMay Allah help the righteous."], ["@hagechada9664", "She is talking as though Americans pay taxes for Ukrainian expenses"], ["@virotemp8339", "Get rid of TRUMP,,, very quickly..........he is no where near the white house, maybe only the outhouse shit house ,,, that is where  he belongs"], ["@CyrilSneer123", "Many of the shells that have killed thousands of civilians in Donestk over the past 10 years have come from the Avdiivka area."], ["@handsom3", "How much does it cost to begin peace talks again? Ukrainians & American politics (both parties) seem to lack common sense and only care about money. Seems like a good idea to pay attention"], ["@Giardintek", "Anything this leftist propaganda channel says, take it with a grain of salt. Another reason C Amanpour left and created her own news channel. I bet CNN never gives you the list of losses ruszkies paid for Avdivka, Their losses are staggering."], ["@house2homeplus511", "Hehehe hehehe"], ["@Msoja8", "Stop lying evil CNN. There was no Ukrainian defence, they were retreating and running for their lives. The retreat was initiated by the ultra right-wing Azov battalion, and all others followed. That was the sat before the new Ukrainian commander ordered the retreat."], ["@knopfseibande", "Drone Imag(in)es mhm? \nJust call it generated videos with extra bad pixelation that makes it harder to see for the casuals.\n\nJust take a closer look at the hands and the legs from the \"soldiers\". Sometimes they are wibbeling wobbling out of the frames with strange movements that only AI does create. Look for yourself in low speed and you will see it! Even the Drone (images) \"footage\" are generated with that billow assets.. \n\nA war without losts but extreme high costs!"], ["@fortunatocardenas", "CNN reported that Ukraine is the MOST CORRUPT COUNTRY in EUROPE...Now CNN is promoting that the most corrupt country in Europe needs more money!!!! CNN is as corrupt as UKRAINE!!!! Shame on your propaganda!!!!"], ["@dejanfoder5648", "Ukrainias are like gipsy give us money wepon.. who will pay this give us for free..?"], ["@palhorvath3928", "🤣🤣😱🤮🤮tax payers pay price of war,USA big companies,banks get profit of war"], ["@timgarrett8002", "2 generals got caught stealing billions of aid money,  we should only send weapons not money russia and ppl of ukrainian decent are known to steal,  reason putin is worth 122 billion dollars."], ["@indian2003", "BBc is surely proud of teh state of Libya and Iraq."], ["@danmark1849", "70% suport to Ukraine 🤣 no no"], ["@candidkamerad", "The US is doing immeasurable harm to its global reputation in regards to the Ukraine war. Countries can clearly see once again how unreliable the US is as an ally.  The EU does not fare much better. The caution, foot dragging, and now (US) abandonment has empowered autocrats worldwide and will result in more long term pain and expense to the 'West' and the world at large than would have occurred with decisive action over the past two years."], ["@aldapostol", "Another Vietnam US of A?"], ["@venki1349", "$60 billion missing aid ? Wow Zelensky you are doing exactly what Richie Sunak did during covid lockdowns here in the UK. $60 billion missing in the UK too during Covid lockdowns."], ["@venki1349", "Boris Johnson is busy with 8th wife and 27th girlfriend to have couple more children."], ["@venki1349", "Boris Johnson wants uk to send few more billions of dollars again. Best way to spend money."], ["@venki1349", "Where is that $220 billion aid spent so far Zelensky ? Where did you and your chums buy properties ?"], ["@venki1349", "Ukraine women already fed before fall of Avdivka to UK and other European countries ?"], ["@alphaplus4162", "This war needs to stop,"], ["@user-wx1gy3hu8e", "Наша армия продолжает уничтожить противника на \"Работинском выступе\". ВС РФ буквально ворвались в центр и юг Работино. Противник откатывается к кладбищу. \r\nТакже есть продвижение к западу от Вербового."], ["@user-wx1gy3hu8e", "На территории н.п. Красное (Ивановское) Российские войска выбили противника со второй линии обороны, ожесточенные бои ведутся в центре населенного пункта.\r\nУспех в Красном крайне важен с тактической точки зрения, для будущего продвижения к Часов Яру."], ["@gary_beniford", "Less than 40% of Americans support the war! And it continues to decline! STOP FUNDING NAZIS AMERICA!"], ["@liviudiaconescu2628", "for what happening  in Ukraine blame Boris Johnson and Joe Biden who refuted the pace agreement in Istanbul!"], ["@walterstoll8043", "Really a bit stupid this Ukrainians, USA is not standing with Ukrainians only with some puppet leaders, selling Ukraine assets and load huge debts with the lend lease scheme on a future Ukraine."], ["@walterstoll8043", "It is a symmetrical war based on equipment for both available, so will be the numbers of victims, casualties."], ["@walterstoll8043", "The Russians are not only put the Ukraine to a hold but the whole NATO, EU, Japan, Australia and many others ...that is quite an achievement for a country of \"a gas station only,\" like Obama says."], ["@gary_beniford", "! Its a fact we know Ukraine is still very corrupt and some amount of the money and weapons sent were stolen by government and military in Ukraine for themselves. We've even seen weapons we sent end up the black market in Eastern Europe! Actually when Hamas attacked Israel even they had some western weapons that were originally sent to Ukraine!. I read one estimate only 40 to 50% of what was sent to Ukraine. Actually made it to the front. Clearly we can't keep sending money if it's being stolen at this rate and funding organized crime and terrorism.  All of that is ture and in the usa our democrat party STILL refuses to track money sent to Ukraine! \n\nI personally think we were lied to in the beginning when BIDEN claimed were only going to need to help Ukraine a little bit and they could handle the Russians on thier own for the most part. He said we would never send tanks, fighter planes, or long-range missiles because it could provoke Russia! Now he's broken all those promises and it's clear Ukraine cant support itself at all. Ukraine is 100% dependent on NATO charity for their war effort. Now that we've hit our limit for aid they are completely collapsing on the frontline."], ["@seansean7643", "\"how much is the shortage of US military to Ukraine to blame?\" How about we talk about that aid sent that was \"lost\" by Ukraine and how that effects future aid?"], ["@vicjsummers6816", "Joirnalism is dead. Only a strong point of view"], ["@batanglumaki5748", "WTF is this reporting. do you have evidence that the russian soldiers shot the injured ones that ukraine left on avdeevka? shot dead in cold blood 😂😂😂 clown reporter"], ["@zerotype9303", "I know america  is now  a slow maker ammunition and Russia and china is faster and many ammo maker ."], ["@deano2160", "Loads of paid for russian propaganda people in the comments. Dont be fooled."], ["@chibamv", "Ну тупые.... вы действительно верите что здесь говорят, мне жаль вас..."], ["@MrEricdraco", "Even Jews whose ancestors were slaughtered by Hitler's army are happily supporting the Ukrainian Nazis. It's a fuked up world we live in nowadays"], ["@decartes666", "Ucraina lost the war ,  somebody tell to Zelensky 220 000 000 000 $  for nothing ..."], ["@centurionstrategic578", "I love how they keep blaming us for the lack of funding!  We sent billions and billions only to keep hearing no ammo, no equipment at the front lines!  What is the sweater muppet doing with all our billions sent in aid?  Really tired of hearing the West not doing enough, the money sent could of helped our own people and border issues!  FUK CNN for entertaining this blame game on the US!"], ["@radenkojovanovic7841", "NATO=HITLER"], ["@LoveBagpipes", "3rd Brigade Azov (i.e. the nazi brigade)...and notice in their self posted combat footage their use of homophobic slurs throughout an entire 1.5hour video\n\nDisgraceful from the west to support these nazis"], ["@u.s.family9279", "Russian Warmongers"], ["@DonnieTownsley", "From down here in Tennessee,i salute you President Putin.\nIt's not your fault these Nazis are still crying over their beat down in WW2.\nApparently the US Government is crying along with the Nazis.\nThey saw the might and the will of the Russians,and bam!! NATO was formed by the US.(New American Thug Organization)\nOnly these thugs are being embarrassed by Russia in their chicken s&it proxy war.\nGo Russia!!!!!!"], ["@dmart3607", "Imagine how US troops would defend Avdiivka and for how long if they've never faced an enemy who actually rides the tanks, not camels"], ["@club4ghz", "We wasted our tax dollars and Ukrainian lives. It's time to go home. We're drunk."], ["@josephsumog-oy8503", "it must be hard for cnn to report US defeat😂"], ["@Doomblade1000", "it's a town now! and not a decades long fortress city 🤡🤡🤡"], ["@carlosw1687", "The UK is a murderous empire"], ["@jerrycoronado6887", "It’s not a win for Russia to take Avdiivka?  Hmmmm wasn’t that the same line used for Bakhmut?  Ukraine better start realizing that Russia will raze Ukraine if they don’t sue for peace.  Republicans ain’t the reason for the failure of the funding package for Ukraine.  That package has included liberal border policies that permit even more illegal aliens to enter the US."], ["@solares2001", "America started this war by backing the coup of 2014. Get it right."], ["@user-ym8qz4ug2v", "No accountability on the 100 billion sent before now they want more let the EU pay something"], ["@user-wx1gy3hu8e", "The leaders of Western countries committed a “confession” when they voiced their attitude to the Minsk agreements, - Russian Permanent Representative to the UN Security Council Nebenzya\n\n📝 “About a year ago, we all heard the confessions of Petro Poroshenko, Francois Hollande, Angela Merkel, as well as Boris Johnson that neither France, nor Germany, nor the same Great Britain ever took these agreements seriously and were not going to push the Ukrainian authorities to their implementation and only used them to delay time and give Kiev time to prepare for war with Russia,” the permanent representative said at a meeting of the UN Security Council.\nSyria has called for the \"immediate\" prosecution of Israeli regime officials for committing egregious violations and various crimes."], ["@elongelongranger", "#coin"], ["@meremortal5789", "When you are out of material, you are out, no matter who you are."], ["@GiLvEaR89", "Putin knew the west would pussy out, all he had to do was wait it out. Russia will win and it wouldn't suprise me that they take the whole of ukraine"], ["@user-wx1gy3hu8e", "Russia's permanent representative to the UN Vasily Nebenzya refused to listen to carbon-copy reports from representatives of the European Union\n\nAccording to him, EU members are deprived of their own point of view. Everything is decided for them in Brussels, and “Brussels is led by Washington,” the Russian diplomat noted."], ["@andreagv3", "Ha ha, so funny to see these totally incorrect, anti-Russia, propaganda fluff pieces try to put pressure and a sense of guilt onto Western countries that refuse to fight a proxy War and don't want to fund the useless and ridiculous Ukrainian stubborness and refusal to cooperate and negotiate for a prolonged ceasefire."], ["@rodrigoesparza2190", "warmongers"], ["@user-wx1gy3hu8e", "The responsibility of the West is already coming - a decline in living standards and economies, degradation of the population, economies, migrants, homeless people, crime, drug addiction... The West is rapidly heading towards its downfall. The fact that someone does not understand this will not change this fact. It was necessary to listen to smart people, in particular Putin - “the very beginning of a special military operation already means that they lost.”"], ["@mog404", "The 60-billion-will-save-Ukraine  bullshit is beyond imbecillic.  Do the Ukroid apologists think if this passes, ammo will suddenly apper on the battlefield?  The gov will need to award contracts, the manfaturers will need to ramp up production and then there is the shipment of goods.\n\nThe RAF will destroy those shipments.\n\nZelensky made his bed and now must lie in it."], ["@ProtectorOfTheWall", "Zelensky is a  clown, how can he send these innocent people to their death"], ["@petergorian535", "Another BS report on massive Russian losses - 1 to 7 ? But the Ukrainians are being outgunned by the Russians 7 to 1??  Makes perfect sense right?   Hostages in held in Russian??  7-% of Americans support sending more weapons?? Decision by Ukraine leaders to save the lives of their troops and do a strategic retreat?  It was a route the soldiers ran to save their lives then a 'treat' was called????? The media is suppose to report facts not narrative - the propaganda level is insane. The poor people in the Ukraine are doing the dirty work of the Neocons in the U$A/West - when will they wake up and realize who their really enemies and when will people in the West understand the BS is that is pumped out by our 'free press' 24/7 by these 'concerned' reports on the front lines?"], ["@antoniofrank546", "Russia lost 50,000 soldiers to occupy town of 30,000 (pre-war). So, to occupy entire Ukraine, Russia will need to spend about 70,000,000 soldiers. That's more that all men in Russia."], ["@diIbert", "Sounds like a YOU problem"], ["@homermadden4350", "No baby. No"], ["@user-wx1gy3hu8e", "The President of Niger has demanded financial compensation from France for 65 years of oppression... in cash."], ["@Klevra96", "Sounds Like A Bernie Madoff Deal"], ["@Klevra96", "Wolf is A Scumbag. Zelensky Must Quit Blaming 🇺🇸 for Its Inevitable Withdrawal. Were Not The Big Brother Who Fights For You Cause You Got Beat Up At The Bus Stop. Zelinsky is A Traitor 2 the Ukrainian  Ppl"], ["@serfredereck", "Israel's still doing the Russian way anyway .\n🇺🇸🤡🇺🇸🤡🇺🇸"], ["@joseaugustofigueiredo2796", "Twenty Ukrainian men have already drowned in the Tisa River, on the border with Romania, to escape mobilization, says Ukrainian border service"], ["@rogerfigas", "If the USA falls asleep, when they wake up they will be in Russia's throat and they will be speaking Russian in 100 or 200 years, then, it will be too late and it will be called USR (United States of Russia).  The most sinister thing about all this is that there are still Americans who are so stupid that they can't see this, they only think about their profit. Putin and the bunch of criminals  behind him are not to be trust. Wake up…"], ["@dal6984", "My God, CNN still spinning its bullshit fake news."], ["@user-wx1gy3hu8e", "Western Ukraine is the center from where the Nazis grow their legs."], ["@uralmashreporting", "i can show y’all what the citizens of avdiivka been saying but that doesn’t fit the western narrative so no one cares i have to watch news from western ukraine or it’s propaganda right?"], ["@user-wx1gy3hu8e", "Соледарское направление: продвижение ВС РФ в Красном\r\nобстановка по состоянию на 21.00 23 февраля 2024 года\r\n\r\nВС РФ смогли существенно продвинуться в Красном, выбив противника с высот к северу от населенного пункта, и заняв еще несколько десятков домов на восточной окраине города.\r\n\r\n▪Продвижение фиксируется в районе парка на перекрестке улицы Восточной и Школьного переулка, а также на Садовой улице.\r\n\r\n❗Северная окраина села при этом остается под контролем противника либо в серой зоне, поскольку улица Широкая находится в низине и простреливается с прилегающих высот. \r\n\r\n▪Вместе с тем не прекращаются удары по тыловым коммуникациям противника. Так, по Часов Яру было нанесено несколько арт- и авиаударов, в том числе с применением 203-мм орудий «Малка»"], ["@JellowGelo", "The only to stop this is to find common ground and just negotiate with it. Ukraine is losing the more it prolongs despite being provided by US dollars."], ["@Iliri-lo6nj", "Ukraine is USA proxy"], ["@theadvisor6666", "What an ambassador LIE!! She must have been a lawyer before becoming ambassador. Or perhaps she isn't deliberately lying; perhaps she is just regurgitating what the CIA has led her to believe - and of course, listening to too much toxic CNN propaganda."], ["@tarasenkostanislav9647", "I was amazed by the wife of a military man with the latest model iPhone, which costs an incredible amount of money for a Ukrainian resident. More than $1000...while the minimum pension is $61"], ["@user-wx1gy3hu8e", "России все равно, дают оружие украине или нет. Мы сильнее всего нато, вместе взятого."], ["@1k20a", "We all see what happens to the Russians when Ukraine has everything they need. For Russians to celebrate that they can only defeat Ukrainians if the Ukrainians have no weapons is cringe"], ["@robertbana8059", "What does the US has to do with Ukraine. Its like Russia supporting Mexico to get California back😮. So nothing."], ["@garyselders7388", "Where did all the money go to that they already got? Any paperwork on that ? Maybe people should stop worrying about getting rich by killing people"], ["@ronielfabroa8242", "Idiot, what are saying brave... Why running to save their lives."], ["@shinigamit0d142", "western media still lying all this time XDDDDDD"], ["@DragoM128", "Warning to our viewers: please make sure you double the dose of copium before watching the following video \"😅 \nPS : if you don't know that at 01:10 secs in the video that's the\"witch from Bakhmut\" then probably you don't know enough about the matter and should try to get more info before posting!"], ["@jojopapa7521", "CNN talking presenting some facts about UKRAINEs loss after 2 years is ONLY an attempt to BLAME republicans for not signing blank check of our TAX dollar to ukraine to benefit our elites!!! Lol"], ["@user-tt6fh7ce9c", "\"russia displaying their odd pride over the rubble\". Aha... Yeah... says CNN that supported all US neocon wars since 1965."], ["@stevenrakhmanchik3126", "another funny looking symbol in the middle 6:08"], ["@stevenrakhmanchik3126", "what's that funny looking symbol in the corner there CNN? 0:42"], ["@user-xb9si4fr8o", "Это было  юмористическое шоу? Россия пока еще ничего не начинала."], ["@stevieflax", "Nuland started the war !"], ["@stevieflax", "Fake polls, the majority of Americans do not support Ukraine."], ["@stevieflax", "Bravo Russia !  CNN  should quit their lying and propaganda bullshit."], ["@jetsetgojetsetgo-ft5lb", "NATO, sombie zelensky and the West is responsible for the war in Ukraine."], ["@hussainliraar5262", "Weapons save lives??? Ukraine will not win a war against Russia. Better sit down and talk..  All Ukrainian men are gone.. Still you are asking for weapons and moving ahead.. How silly you are. How many more people you want to kill. Stupid ambassador"], ["@RobertMolders", "This is what happens when you chose, as your main ally, a nation of cowards."], ["@user-wx1gy3hu8e", "The Russian Armed Forces entered Krasnogorovka - military correspondent Lisitsyn\n\nThe settlement is located north of the liberated Marinka.\n\n❗There are also reports of the withdrawal of the Ukrainian Armed Forces from Stepovoye (Petrovskoye) in the north-west of Avdeevka."], ["@HonestReactionsReal", "Ukraine is the battleground of the Westerns. Russia is actually defeating the whole West on battlefield.  Ukrainian people are only scapegoats used by West to further their interests.  Poor Ukrainians are dying for Americans and Brits & Germans. Russia had no other option but to respond to the NATO expansion."], ["@RunForest13", "Wherever Zelensky visits, the city falls within weeks."], ["@AbdulRahman-ux8ej", "😂😂😂😂😂 , tell me Ukraine is winning😅😅😅"], ["@noseycxnt3712", "Ukraine is corrupt especially that Zelenskyy. Payments need to be stopped immediately"], ["@nevergrowedup", "When the people of Ukraine realize that their corrupt government was bought by the US dollar to fight their neighbor in a war they could never win Zelensky will be a dead man walking. Ukrainians are dying because America wanted to weaken Russia. This Ukrainian Ambassador is a complete liar."], ["@carlosw1687", "Viva Russia 🪆"], ["@user-rc2pc7vp2n", "And I love how they say delay in USA. How about all those European countries? Last I checked Ukraine is not part of North America."], ["@manofpurpose8423", "The liberal media of which CNN is a mouthpiece is using the  fall of Avdiivka to exert pressure on House Republicans and Speaker Johnson to pass the 61 billion dollars. \nThere are two issues  that arise from video clip,  namely; 1) Ukraine lacks manpower to fight, and 2) no weapons including ammunitions to continue fighting.\n\nNow, how supplying weapons is going to resolve the manpower issues? Who are those that will fight with the supplied weapons?\n\nThose who have been following independent media on the war knew that Adiivka was going to fall to the Russians with time regardless if weapons were supplied or not.\n\nAt this point, the media should be advocating for a peaceful compromise and resolution and bring the war to an end."], ["@shane9597", "its been over"], ["@vitorino773", "You let your own citizens living in misery while giving their money, not hours, to Zelensky, The Actor send his own citizens to get miles...\nFools.\nAnd these old farts pushing for war is shamefull"], ["@Homosapianss", "USA, don’t let Trump win the election, this man is not who he claims to be, he will support the fascist regime of Russia, he will stop military assistance to Ukraine, this is a threat to Europe."], ["@terrylewis7414", "Wow 70 percent of Americans supporting Ukraine it more like 80 percent don't give a rats ass about Ukraine anyone who thinks russia can be defeated are out of there goddanm minds sorry lady I am American and have no business sending you monet"], ["@user-ug6rn5si4r", "Don't make the whole world laugh. What is Russia's threat to the rest of Europe? You yourself moved NATO to the borders of Russia. You are a threat to the whole world. The only thing you don’t like is that there was a country that sent you and your NATO away. Russia is not Yugoslavia."], ["@paradiso2k954", "Imagine.. no, just imagine that the rubbles seen in Avdeyevka take place in the UK. Because if the warmongers keep on pushing this is what's going to happen."], ["@user-ug6rn5si4r", "Dear Democrats from CNN. You are showing on the screen the icon of the 3rd Assault Brigade of Ukraine Azov. This is a wolf hook and a sign of the Nazi SS Division “Totenkopf”. This is not the first time you have done this. Is this propaganda of fascism?"], ["@neroma", "CNN= fake news!"], ["@harsimrat44454", "Zelensky's Name in the History of Ukraine should be written in Black words...Worst Leader of Century......Even a kid knows....we can't win a battle.....on other's assistance and weapons......."], ["@Fasili", "That ukranian women is delusional x) Even talking against the number the ukrainian millitary gives :P"], ["@ionutvrabie5730", "It doesn't matter how many months it takes! Russia is moving forward. Now, they are on full war gear! No messing around! Ukraine had its time to come to terms with Putin, but they listen to their masters from the West who do not get to die for their agenda. Russia will push now all throughout the front."], ["@boguecarol0873", "I don’t understand.  60 billion, 70 billion, 80 billion whatever, you can’t through dollar bills at Russia.  If the west can’t find/produce enough shells, the shells are not there to buy.  Plus the more money that is given to Ukraine, the higher, the shell price becomes!"], ["@levak8740", "Kuku lele wtf !"], ["@hus390", "All these towns and cities are very close to Russian border than to Kyiv. And they were claimed by pro-Russia separatists. That fact it took Putin more than two years to win Avdiivka is surprising."], ["@botayoung7712", "CNN says Avdeevka was not of any value..😂😂😂"], ["@botayoung7712", "As usual.CNN BS propaganda machine in high gear.😂😂😂😂"], ["@noahchizinga9921", "Corrupt zelenskyy and joe Biden must be removed from power"], ["@imperija01", "Ukraine was shaling Ukrainians since 2014! You are not correct in your speech that they have been fighting Russia since 2014!"], ["@SimbaM2kufu", "Where are they getting the 70% of Americans who support Ukraine?"], ["@tiagodagostini", "CNN   get less biased people to  talk with.  They did not take the city? Aadvika was a FORTRESS city,  the  Russian victory is in crushing Ukraien strongest defense. That is HUGE morale blow into ukranians. Stop trying to sugarcoat a disater!"], ["@JulieAnneBalos-Balos", "this is not journalism, this is simply people on tv begging for money..."], ["@user-DrJoe-Future", "The Ukrainians are dying for the U.S. and NATO, and we can't support one country in a war.   How is the US and NATO going to win a fight with Russia if we can't support one ally and defeat Russia in only ONE country?  We are so pitiful.  The U.S. is the weakest and worst ally you can have.  I blame the Biden Administration for this entire disaster in Ukraine, and continued disaster that he created on the U.S. Border.  Everything the Administration touches is a disaster.  We first need to protect citizens in the United States who are under attack.   That is our first priority, so Ukraine gets sacrificed because we can't defend our own borders in the U.S.  Biden is coming close to starting the next Civil War in the United States."], ["@nightcruiser6331", "first invasion over a decade? Idiots, study and learn."], ["@FskpZ", "6:10 We're looking at the Nazi symbol in the middle of CNN. That same symbol that killed who knows how many American sons some 80 years ago. \nNow those fallen heroes are turning over in their graves.\nConfirmation that stupidity is indestructible."], ["@javierrodriguezgonzalez3426", "Slava ukraina❤"], ["@descartesdonkey4291", "Utter bolloxs...why don't you tell the truth ."], ["@eddiesumogbamokollie1302", "Ukrain is winning according to the west"], ["@user-pi8iq5yy8g", "NATO is killing Ukrainians by sending them weapons."], ["@jondavid5056", "So America give close to 500 billion dollars in weapons and armor and what happened with that nothing. So what is 69 billion going to do. \nThey have to build all this stuff which going to 5 months or more to build it . And now you finally hearing from the mainstream media that there short on man power.  Again you give they all the weapons in the world but if you dont have the manpower, you are still going to lose.\nAnd where are the damn abrams tanks that was said to be the monsters on the battlefield.  Still haven't seen them."], ["@goldensteel8110", "Americans don't consider RUSSIA as enemy  its on American leaders think every country they cant bulliy as enemy"], ["@kevinbalkwill8426", "Why can't the truth be told"], ["@fwfeo", "Zelensky said 7 Russians to one Ukrainians! So, how are they losing a town??"], ["@fwfeo", "Russia has run out of everything nut shovels thanks to sanctions and incompetence I hear! Why did Ukrainians lose a town when the goat of Kyiv can push the Russians out!"], ["@fwfeo", "How are Russians beating them with shovels???"], ["@narithim8948", "US and West tie Ukraine’s hand for Russia to fight by delaying military aid allowing invaders to capture Avidiivka"], ["@user-wx1gy3hu8e", "Россия это в том числе непобедимая военная машина, которую нельзя остановить, если она включилась. Разумный человек 10 раз подумает, стоит ли погибать против неё."], ["@narithim8948", "US and West tie Ukraine’s hand for Russia to fight"], ["@user-wx1gy3hu8e", "Всех наших воинов с 23 фквраля!\r\nА враги на генетическом уровне должны помнить это:\r\nhttps://www.youtube.com/watch?v=BbZJMi82bnc&list=RDBbZJMi82bnc&start_radio=1&ab_channel=Sturm-152\r\nРоссию нельзя победить на поле боя."], ["@vasilicabuzereci1867", "Pitiful propagandists!🤑"], ["@rektboi4195", "Too any CNN/mainstream American viewers. I bid you too do research and check some insignia's of the Ukrainian army it won't take long before you see a lightning black sun with a circle outline logo in the back ground of most battalion insignia's it's actually called a Sonnenrad, Now you will wonder what is a jaggged black sun logo even mean? \n\nThis is a popular nazi / VERY far right logo used in SS divisions from times of past and also neo nazi groups that reside on the internet today. I don't have to say who that bad guys are in this whole thing if you don't already know it's actually both sides. One is a crazy authoritarian country that's ran by oligarchs and criminals who sell you oil and resorces even to this day through back deal lenders and the other is crazed neo nazi regime who we're a military junta coup when they took power housing some of eastern Europe's oldest and boldest SS divisions who still exist like asov battalion and other mechanized ones that share the same Sonnenrad logo."], ["@Random_JapGuy", "CNN coping"], ["@user-vv1kt5ex8w", "https://youtu.be/ImCBNgPZZr4?si=WsA8M1lcvQmFtjuT"], ["@lianaliberzon2169", "I’m not see the bloody student and running against the war in yeast conflict which the other people beside the Gaza border are threatening with life  and loosing their homes .So where are these demonstrators whose recently screamed death to Israel why the bloody Muslim do not running and scream stop the war in Ukraine .What only poor children of Gaza deserve the right to live but Ukrainian not human?"], ["@dt8762", "They never had a chance from the beginning. You people are so gullible."], ["@mabhutiq0ngwe21", "If they are killing 7 opponents at the loss 1, 🤔🤔🤔 why run?"], ["@rudolfoafonzo9414", "Cnn product of CIA"], ["@Daywalker222", "How much did Europe sent so far? Wolf being silent on them but real tough guy on Republicans. Ambassador did great not taking the bait!"], ["@milankatodorovic2758", "Prelepo😂😂😂😂"], ["@user-wx1gy3hu8e", "As for the Russian losses and the small town, this is nonsense, this city was considered by the Ukrainians to be an impregnable fortress and they built fortifications there for 10 years. And after a loss, of course, you need to downplay its significance. And here is the official information:\nFrom the report of the Ministry of Defense of the Russian Federation on the progress of the special military operation (as of February 22, 2024)\nIn total, since the beginning of the special military operation, the following have been destroyed: 572 aircraft, 266 helicopters, 13,137 unmanned aerial vehicles, 473 anti-aircraft missile systems, 15,171 tanks and other armored combat vehicles, 1,223 combat vehicles of multiple launch rocket systems, 8,138 field artillery guns and mortars, as well as 18,950 units of special military vehicles."], ["@PatrickPierceBateman", "*Russia loses 16,000 men and 300 armored vehicles to capture a tiny town that is now just a pile of rubble.*\nRussian Trolls: Ukraine can't win. Russia is simply too good at war."], ["@randall_c_6163", "Keep telling your self that Ukraine “not a win they just destroy the city” and it’s a “smart decision to pull out” = Ukrainian retreating from the Russian army, Ukrainian leaving active and injured soldiers because the retreat not well  planned."], ["@user-wx1gy3hu8e", "Ukrainians steal because there is no state there. But there is no state there, because they tried to build it on Russian territories, where the population supports Russia."], ["@Kevlar10", "Maybe if they didn’t waste half the funds and used all of the aide for weapons and war supplies the would have enough???"], ["@user-wx1gy3hu8e", "Даже там, где это было чуть ранее (Донецкое направление), после перегруппировки украинцы цепко держатся за позиции и вчера целый день шло сражение за н.п. Северное. Уже в пять утра началась мощная артподготовка, падало много \"чугуния\" (даже в центре Донецка машины иногда трясло) и к ночи населенный пункт (1-я Славянская бригада) перешел под наш контроль. Противник отступил (и уже признал это). \r\n\r\nВероятнее всего сегодня будет ожесточенное сражение за Тоненькое, выход к которому, и тем более взятие его нами под контроль, заставит противника окончательно отойти из окрестностей Ласточкино и заметно упростит нашим частям в районе Первомайского далее двигаться на Нетайлово и Карловку. Держим кулаки за парней. Тем более, что по разведданным на это направление для удержания ситуации под контролем, их под Херсона противник перебросил своих лучших беспилотников (группу Мадьяра)."], ["@kaneluo5212", "Media keeps talking like if the suspeded 60 billion aid can save Ukraine like Hallelujah, but never mention why the previous hundreds of billions aid didn't do shit."], ["@mkt111one", "On 1:22 He says:\n\"They (russians) came in, they came little by little, by small groups\"\nBut voice behind the scene translate it like:\n\"We didn't have enough shells\"\nWhy CNN?"], ["@garymattischannel6207", "The CIA supports Ukraine not the American People. It is dangerous to support Ukraine and it definitely can lead to WW3."], ["@garymattischannel6207", "Lying Ambassador we don't support Ukrainians."], ["@garymattischannel6207", "We don't support Ukraine"], ["@garymattischannel6207", "Provide for yourself Ukraine."], ["@garymattischannel6207", "No money for Ukraine."], ["@garymattischannel6207", "The USA has been bluffing Russia for 70 years now and Support for Ukraine is just another one to get a military base in Ukraine on The Ukraine and Russian border. Is that worth risking WW3 ? . Every time you support Ukraine you are bringing US closer to WW3.  Count the cost of borrowing foreign money to support Ukraine against Russia. I believe that if you count the cost you will say NO !"], ["@garymattischannel6207", "The USA must stay out of Ukraine and stop pretending that UN NATO is going to have a military base on the Russian border with Ukraine. Are You The American People willing to pay the price of nuclear War against Russia and China ? Support for Ukraine is ignorant as hell."], ["@garymattischannel6207", "They have not counted the cost of war before they started one with Russia. It's not right for USA Tax Money to be embezzled by Zelenski and his wife."], ["@garymattischannel6207", "Putin must advance into Ukraine to stop The Cash Embezzlement's of Zelenski and his wife."], ["@garymattischannel6207", "US Tax payers must say No to Ukraine. We cannot afford to borrow More foreign money for Ukraine and risk WW3 At the same time."], ["@garymattischannel6207", "Supporting Ukraine now can easily lead to WW3 in A very short time. And furthermore We are out of money. We have to look at the bigger picture as US citizens. We cannot borrow foreign money to support Ukraines War with Russia. The USA must act responsible with the tax money."], ["@garymattischannel6207", "Support for Ukraine is not worth risking WW3 !"], ["@garymattischannel6207", "Nothing has changed just like during WW2 and Ukrainians collaboration with The Nazi SS in Germany."]]