[["@frankbible5920", "the nazis started this war not russia"], ["@joseaugustofigueiredo2796", "Zelensky will only negotiate with Russia when the CIA and the British MI-6 get out of their hunchback!"], ["@Ibusoloriderindia", "Why EU,America &NATO is not sending arms  and army for war bcoz America force war against Russia...\nAmerica fooled you#Ukraine"], ["@charleso6316", "0:14 is a Nazi insignia and he is supposed to be the good guy according to CNN😁"], ["@brianconger8542", "So CNN agrees. Ukraine is lost. Biden better send a bunch of money we don't have or Russia will rule the world. Smh"], ["@robertryan7528", "Everyone made fun of Airsoft and MILSIM. Now you guys definitely don't say anything. They use it for pre basic training for trench warfare to save ammunition / Sim rounds."], ["@kameiachung5541", "CNN is an American elite mouth piece"], ["@credibletube90", "Ukraine will never win and the world has known this.This war is profit for US arms companies and the world is f.o.o.lish enough to buy into the greed for US war companies….in the real world David does not beat Goliath.This is  Borris the twat  and the Zelenskies the cl.owns doing at the cost of Ukrainian lives"], ["@Milyutin53", "lol..cnn is a joke. always been."], ["@lilquakeroats554", "Wars would end if women suffered casualties in the numbers of men. According to psychological studies, humans are wired to ignore men's suffering and pain. As long as only men are sent, the majority of humans will continue to just ignore it."], ["@shawntandy4326", "more bullshit! russia loseing thats what they say!"], ["@bigallabowski8235", "This is all the wests fault. If Ukraine would have been allowed to have normal relations with Russia, instead of instigating two coups, they would be living in peace right now."], ["@FasTFinGaZsTiZZa", "typical cnn.... \" Ukraine says there is a deal Russia would evacuate them and exchange prisoners\" yeahhh sure buddy. Ukraine was retreating from avdiivka and didnt pick up their own soldiers and they end up dead. Maybe they should talk about how ukraine bombed the russian plane full of ukraine soldiers ( prisoners for exchange )."], ["@andrewadams6905", "Poor Ivans are still pedaling obsolete BS excuses from their Russian Zombie TV (\"coup\", \"proxy war\", \"NATO\", \"Minsk\", \"Boris\", \"Donbas\") while Putin already left them behind, and moved on to other excuses like medieval history. LOL"], ["@dongusfinkleburn4172", "Do news outlets think we wouldn’t notice the wolfs angle in the title card?"], ["@josephsumog-oy8503", "it must be hard for cnn to report that ukraine is losing badly😂"], ["@josephsumog-oy8503", "its called.military smart"], ["@TheAdderalDiaries", "All of this just because you didn’t want to agree to peace and join an alliance that is openly hostile to Russia? Anyone who isn’t brainwashed by propaganda and knows how far back this goes and what and who caused this can only look in disgust. Ukraine is not a NATO member, Ukraine has never been an ally until a US coup overthrew the will of Ukrainians in 2014, and the US is forcing them to send every last man to die when there is no way to win. What a betrayal to your people! No wonder he suspended elections, because without the CIA he can’t win and that’s what this war is really about. It’s about the United States not wanting to let go of the power they overthrew in 2014. Ukraine is not a beacon of democracy, it never has been and never will be. Russia is far less crazy than Ukraine. I mean they literally have Nazi running around, and no that’s not Putin propaganda but an actual fact. I challenge any of you bird brains to come at me with actual intellect and not some emotional rant that you comment and then run like everyone of you do when you have no real education on the truth of the matter and just want to throw your ideological stupidity. It’s why the left can’t debate, and why no one takes you serious. You use bullhorns and scream instead of debate and let your mental illness really show"], ["@loboloco866", "CNN????wars sucks the Minsk agreement could have avoided all this stupidity,  while 🤡 clownslenski, enjoy traveling and easy life,  however every one chooses his own life."], ["@user-ow3pl4wh7u", "Does any one in the west do anything but propaganda and LIES? These Ukrainians are out gunned outmaned and need to surrender., why keep pushing weapons and shredded flesh, not YOURS of course, letting the whole generation of young, and now old men die? Seems like you are Money laundering, with blood money."], ["@mikyas392", "The guys in the bunkers found out they were being left when they tricked their commander by asking him \"when will the six  wounded be evacuated?\"."], ["@omarelassi6024", "don’t mess with mother russia ❤"], ["@iali00", "Why are they counting this war? There was a deal before the UK convinced Ukraine to walk away from the deal."], ["@SteelerzReignSupremeII", "How can this be. They only have shovels."], ["@ashishIMpro", "Russians had never been good at offensive capabilities. Ukraine and NATO caught them off-guard, under-manned and under-equipped at the beginning of war which led to failures in certain directions and setbacks. But when it comes to defence, it's a whole deferent story. We saw a glimpse of it in Ukraine's counter-offensive last year and it's just the beginning of their preparations. You can throw anything you want - F16s, any number of troops, and even nukes. You're guaranteed to receive equal and measured response. I'm not talking about Putin but Russian society sees west now as someone hell bent on breaking apart their country. And, We all know how much they love their country no matter how poor they might be.\n\nThere are emotions at play on both sides. This war will end in tragedy for entire world if not stopped by compromise from both side. Taking one of the biggest nuclear power to dead end is never a good idea and I believe most leaders in the West know this as well."], ["@user-gt2jh1eb4l", "Fools to fight ussr"], ["@jimjones308", "The Russian bots swarm these comment boards to make it seem as though opinions are mixed.  No, they are not. Decent, civilized, people support Ukraine, its military,  and its people and their struggle against hegemony.  Russia has to pay people to support them. I Hope you weasels posting from  Belgrade or Minsk enjoy your few extra pennies for vodka.   Pathetic."], ["@Wolfen443", "Jesus, those wounded casualties are terrible in this war. Were the wounded shot by their own side or by the Russians?. Have the war taken such a brutal turn already."], ["@samamir13", "How can people still believe CNN after all the lies been told🤔🤔🤥🤥🤥"], ["@kennethnjoroge", "Zelensky the puppet should negotiate with russia."], ["@arthuroliveira5454", "How did they get outmanned? Ain't just find more men?"], ["@TheRawdawg", "We sent them hundreds of billions. I'd say we have done way more than anyone else and more than we should have. We don't have the money to send. You dont borrow money to give away that's just beyond stupid."], ["@buddyaces2162", "0:48 \"the brigade claims it's training professional fighters, not cannon fodder like Russia\" LMAO, what the hell are you talking about, CNN? Ukraine now has no battlefield-experienced soldiers at all on their front lines. They deployed all their experienced troops at the beginning of the war, and now they are either dead or seriously injured, while the Russians used their fresh troops at the beginning of the war and are now deploying their well-experienced, battle-hardened troops. Good luck with your propaganda, CNN. we will all be able to see the truth in the next few months 🤣"], ["@AR15andGOD", "woman and man? Lol. Strange word order, there. Women are not fighting in the trenches; what a horrific sexist vile thing. I couldn't imagine russian soldiers getting their hands on a helpless little 75 pound woman........ a gun is no equalizer in a combat scenario. The equalization trope only refers to physical force, IE a gun gives a woman the ability to take down a man. But this by no means means that their combat prowess, instincts, and ability to hold it together in some of the toughest scenarios are equalized. Certainly not"], ["@buddyaces2162", "The only reason why CNN is emphasizing the fact that Ukraine lacks ammunition is solely because they want to point fingers and blame the Republicans for opposing the $60 billion bill of US taxpayers' money to aid the Ukrainian military. A war happening across the Atlantic Ocean that has nothing to do with the American people"], ["@Bplus0224", "😂😂😂😂😂ARMONPOR 😂😂😂😂😂"], ["@bunncameron6687", "But I thought they had only lost 37000"], ["@joseescobedo7080", "Serhii is not serving his country, he's serving zelensky's ego and NATO."], ["@loukreu", "No American troops to Ukraine ever. Joe Biden, Donald Trump, Lindsey Graham, Victoria Nuland, Adam Schiff, and all their friends in the media can go fight as mercs if they care so much."], ["@barringtonfisher2131", "How the heck you buy your own martar, she didn't realize what was saying."], ["@jebes909090", "\"the gridlock in congress over military aid...\"  why fund them at all?  They're not in nato nor are they a us protectorate."], ["@moon_krendelsestate", "3:44 “-catastrophic- shortage on people”"], ["@moon_krendelsestate", "1:15 he is speaking Ukrainian…. Translation is right, btw"], ["@JamesJohnson-sl3ui", "If only our president would secure our own border we could send then the supplies they need. And save American and Ukrainian lives. Come on Mr Biden get your head on straight"], ["@KizitoObedhi", "Is becoming a NATO alliance important than loosing lives and territories politicians have mercy on people stay neutral save people simple and precise"], ["@zdravkoavdalovic3131", "Christiane Amanpoop"], ["@mh-ht2fp", "Why are the news so different now? What happened to the ukrainian game changers and great summer offensive?"], ["@vxngeanxe", "they train with electric airsoft rifles?"], ["@roberteugen8479", "AHAHA WATH A PROPAGANDA  SHAME ON YOU CNN PROPGANDA CHANEL"], ["@agegroot5666", "Unit of former AZOV veterans. These are by the west white washed nazi's !!!  What have become of us we are doing that?"], ["@thatosebotsane8017", "“There was a deal”? lol🤦🏿‍♂️"], ["@alessandrolegnaro2717", "A peace deal was on the table two years ago. But U.S.A and UK pushed for the war to continue ,sending a lot of armament, using Zelensky as a puppet for they proxy war"], ["@user-ld7qp9rg1p", "cnn promoted this war, now what?"], ["@femboyshitposter676", "Those airsoft vests are crazy for \"proffesionals\" anyways so was the latest cassualty of the war the ABRAM who just got destroyed."], ["@mafiooato7233", "It funny how all the Ukraine soldiers speak in Russian than Ukrainian."], ["@PhillipMortlock-yt8wc", "Haha female soldiers are as ridiculous as female police."], ["@necamilosavljevic8722", "https://www.youtube.com/watch?v=WAVpwh6XDRg&t=2100s&pp=ygUUdWtyYWluYSBvbGl2ZXIgc3RvbmU%3D"], ["@necamilosavljevic8722", "Tamane vas Rusi kao bubasvabe. I jos ce..."], ["@rikkertbatzback1816", "Even in the 3rd year you dont manage to spot the Wolfsangel in the thumbnail.\nShame on you hypocrites."], ["@christopherlykins7311", "Yo listen to the gun sound in the start. Those are air soft guns if you know your gun sounds thats no real gun. They wasting money on training with them or is CNN fake."], ["@user-bh9vf2zu1r", "Why are they training with airsoft guns?"], ["@brankel", "Ahahahahah, what a mockery, Amanpour , how pathetic one can be, & as always Goebbels propaganda  & devils lawyer."], ["@gregchijoff9959", "I guess the United States set the bar really low when Biden sent Ukraine 155mm cluster munitions! Do you really expect  Russia  not to respond 10 times harder?!"], ["@jamescc2010", "Biden and US fighting  is succeeding to to have then fighting to  the last Ukrainian.  Very sad and stupid for Ukraine to sell out to corrupted Biden.  No more of our US tax money to corrupted to Ukraine. We need money her for Americans."], ["@toralf63", "Let’s summarise: Russia is winning, US with their Nazi friends is loosing!"], ["@ScentlessSun", "If the USA really threw its weight behind this, and pass a 600 billion weapons package can you imagine the problems this would cause for Russia? If Ukraine mobilized 500,000 more troops then most likely Russia would be kicked out of the country by the first part of 2025."], ["@MetalArrow", "Like a war between Guatemala and the USA, but I guess dumb Europeans want to find out the hard way, fighting the biggest nuclear country on earth."], ["@norhishamisa3187", "I am actually feeling very sad for these group of human beings in Ukraine. On the other hand, I am grateful that I am living in a part of the world where there is peace and I am healthy."], ["@arnauddemalartic4499", "Why don't we speak about peace talks? We  are too proud to recognize that this war is lost? How many young people must die for this deadly attitude?"], ["@michaelholt7994", "You mean when the yanks invaded dombass and luhansk  with its proxy America,got it the wrong way around.imagine dying for those thieving lying bullies in the WH."], ["@chrissimpletown9654", "4:00 they had to buy their own mortar. There must be quite a black market in the country that received over $100 billion in free weapons."], ["@chrissimpletown9654", "2:37 nice t shirt. the Ukrainian master race"], ["@davidpalmer7952", "Time to negotiate already. Your leadership has completely sold you out."], ["@chrissimpletown9654", "ahhhh. the Azov 3rd assault brigade. CNN's favorite nazis"], ["@justjake5389", "Nazi wolfsangel Symbole in the thumbnail 😂"], ["@sunraylight8", ":'("], ["@JGPIRL", "0:50 the opposite is true there is a reason when Syrskyi was appointed the general in in charge that the solders in the rank felt fear. he is known as the butcher of bakhmut, with minimal training and as going far to put 72 year olds in tanks, the Ukrainians are finished everyone knew they were no match for a superior fighting force. this is not even full strength of the Russians, 42,000 new recruits show up by themselves to serve for the federation of Russia of their own will. not forced like Ukraine who has resorted to kidnapping of age men on the streets. stop pretending if they have a chance it is only a matter of time. you can send as many bullets to them but they are running out of men to use them. an idiot can see how dire the situation. these fools in the comments won't since they believe everything cnn says."], ["@black_triton9264", "CNN can't help including yathzee logos in their thumbnails\n\n... also, there are no yahtzees in Ukraine 😂"], ["@yanoshack", "The wolfsangel is a Nazi symbol. Are there really no neo-Nazis in Ukraine?"], ["@safiul1930", "I was told Ukraine was winning under the leadership of the great khazarian comedian.\n\nNow should I feel sorry for them?"], ["@goranrubar7595", "This is kapitalism waging war"], ["@goranrubar7595", "Fighting for NATO imperialism"], ["@salimjuma8877", "But Russia has been loosing since the start and also been running out of ammo?! 😇"], ["@festekj", "Biden is to blame for impeding negotiations at the onset of the conflict. YT auto deletes an Estonian media organization that tracks Russian KIA despite it being backed by the BBC. If you want to know huge disparity between Ukrainian and Russian KIA, Google Russian KIA Estonian media. If I put the name, Google auto deletes it."], ["@alexej1987", "Absolutely heartbreaking to say the very least.\n\nI sure hope that fighting for Donbass and Luhansk (that Ukraine bombed for 8;years prior to this invasion) is worth it. What a huge mistake by the government that young Ukrainians now have to pay for. \n\nAny comments by Boris Johnson by the way? Maybe someone should let him watch this video and then ask a couple of questions regarding his expertise and advices."], ["@sajjadmahmudrozin2828", "Consequences of Comedian decision"], ["@lazaroskordas4397", "\"It's asthma\", \"We need to take our best men\", when the best men you have left are the ones with asthma and hell knows what else ....."], ["@dimbasz", "What a nice thumbnail, CNN! I commend your continuous commitment to spotlight this straight up 3rd Reich fan club wearing it's symbols all over)"], ["@ronhat-nx6yq", "This is what I call dead fools still walking, Aint that right CNN. I just came here to see what lies you were telling all the idiots today."], ["@ronhat-nx6yq", "Interesting uniforms they have! They obviously do not get dirty even when they are head deep in mud????"], ["@73chengosaro4", "IF THERE IS A SHORTAGE OF WEAPONS AND people - that means you are defeated unless you want the war to transform into a world war"], ["@ToskaForsite", "Poor salonazi."], ["@merocaine", "The tide has reslly changed in the comments, a couple of years back this would have been wall to wall Ukraine support."], ["@merocaine", "At 16 seconds some chick has a nazi flash on her helmet.  No Nazis in Ukraine 😅"], ["@miasanmia4086", "Hello, as a Polish citizen, I have a question for my colleagues from abroad.  Unfortunately, our government and the media do not say much about the plans.  I have the impression that important topics are hidden from us.  What information is provided in the context of war plans?  Will Poland participate in it?  What is your impression of the current situation?"], ["@amunra5330", "I am surprised that CNN (mouth piece for the CIA) actually admit ANY Ukrainian soldiers died in the war. The main stream media portrays that only Russia soldiers are being killed in the war."], ["@dennykovach9859", "Bullshit. People i had young Ukes come to have food a 20 yr old pulled a wad of money from his pocket ALL OLD FACE CRISP AMERICAN. I ASKED WHERE HE GOT THAT. MY BANK HE SAID"], ["@irlin9062", "£€$$$$$  usa rabble!"], ["@avinashpathak1335", "This is the result of NATO expansion towards eastwards. I do not understand what is the  point of that"], ["@andyerickson666", "cow pie.. holy shit... land mine"], ["@ehisgeorge414", "For 2 years, Western leaders and their train of media houses claimed Russia has lost the wars, lost strategically, ran out of missiles, using washing machines and refrigerators electronic cards, fighting with shovels and economy dead. That Russian soldiers are deserting, not well trained, lacks basic kits, no food to eat and their officers are drunks and cannot command. Which Russians is occupying about 21% of Ukraine, driving Ukrainians out of their cities and towns and destroying tons of ammo send to Ukraine by about 50 nations. What happened to the 8 years NATO's trained 900,000 Ukrainian soldiers???"], ["@MartinMaarva", "So they have left their home and travelled several hundred miles to fight someone. Lucky ones or unlucky ones returned alive."], ["@alec1984", "It's CNN Morons. You can't believe anything they report. After a $45M investigation of the Trump-Russian collusion hoax by the US government, which proved Trump had nothing do to with Russia, CNN are coming out again with more Trump-Russia propaganda."], ["@_pindi_", "What kind of morons considers returning amputees to the front line? Superhumans my foot! That little comedian and his western fans thinks this is one of his standup shows.."], ["@solomon3845", "Zelensky failure to negotiate peace....Ukraine could have avoided war"], ["@youreatowel9705", "Ukraine: we lay down weapons for peace?\n\nRussia: you lay down weapons we build more... for peace.\n\nUkraine: that is a sweet deal we'll take it."], ["@darryllawrence2530", "I thought the UN band landmines in war."], ["@jonathanfriedlander8563", "Boris Johnson  is the idiot to blame !!"], ["@user-hc8cl2ez9m", "Negotiate and save lives. The Ukraine won’t liberate the East nor will Russia surrender. Make a deal, the more time that passes the more it benefits Russia."], ["@well9179", "I noticed Ukrainians are so good to make their symbols look awesome. CNN : \"....not cannon fodder like Rusia\", damn!!!"], ["@JC13406", "Prayers to Mr Putin safety"], ["@bot071", "Go home Nato/America your over matched and bleeding out. Zelenzki and his buddies  are all millionaires thanks to the US taxpayers. Follow the money..."], ["@KaiserBlade", "Leaving wounded behind,sounds like Biden is in charge."], ["@KaiserBlade", "I thought Ukraine was winning."], ["@ronaldblamble8206", "I thought they were winning vs the Russians with shovels"], ["@andrewadams6905", "Poor Ivans are still pedaling obsolete BS excuses from their Russian Zombie TV (\"coup\", \"proxy war\", \"NATO\", \"Boris\", \"Donbas\") while Putin already left them behind, and moved on to other excuses like medieval history."], ["@karlmunford7000", "Not biased much.... the same stories both sides, its war and war it hell."], ["@russianarkadiy", "I love how the main soldier in the image for the video has a Nazi symbol in his helmet. Сnn has zero awareness."], ["@craig331", "Biden and Nato are Aholes. Can't you see what you are doing to people in Ukraine? Stop sending money and weapons to Ukraine. Ukraine will have to stop the war. Only way to stop it."], ["@manlede", "Lucen con orgullo las runas SS en el casco y CNN lo muestra sin ruborizarse.🤬"], ["@ska5568", "*VIVA LA RUSSIA*"], ["@johnwi-l_l-iamsf3763", "So giving more weapons will stop the suffering? What a pathetic channel"], ["@mirekslechta7161", "B. Jonson indirectly caused the death of hundreds of thousands Ukrainiens and he is also responsible for present danger of nuclear war."], ["@al65850", "They’re kids"], ["@munteza9262", "Just Remember!\nIt goes both ways...\nThe new russian soldiers who arrive Dont know Where the former units lay there mines😂\nIt so Fubar..."], ["@E27446", "Lady you don't  understand.\nPeople are  expendable.\nLeaders dont care.\nPut that in your report...."], ["@E27446", "Ukraine abandoned there own wounded..\nWhat a democracy.\nPlastic army now.\nWhen will zelensky  stop killing his people."], ["@andrewadams6905", "Came back to check if Russian Zombies finally came up with a new excuse for starting the war, but no... they are still pedaling the same old lame BS from Russian Zombie TV: \"coup\", \"proxy war\", \"Boris\", \"NATO\", \"surrender\". LOL"], ["@nonamex3052", "You see now westren media is slowly preparing you for ukraine defeat"], ["@badrobotNG", "They need to replenish the ranks....? \nYou are a very wicked woman. They should go back to the negotiation table and stop all this nonsense. They were the ones that pulled out of the negotiation...this needs to stop...."], ["@akhiltt8823", "All prayers to them but now imagine the carnage in Gaza. I see the lack of reporting of the mainstream media in  Gaza highly disenginous."], ["@springbloom5940", "You can say its not all of them, but you just cannot see a photo or an interview of 3 or more Ukrainians, without a crooked cross boy in it  🤨"], ["@djura1389", "They are not recruiting cannon fodder, but they are recruiting people with medical conditions like asthma. Tragycomedy propaganda video. Come on CNN you can do better 😂"], ["@henryraymond9204", "The west have been causing conflict in Africa for decades. I think its important they enjoy their fair share as well. This is like entertainment to some of us."], ["@sserunjogialphat3470", "Syria ..iraq ..libya...afaghan...all are in ruins coz of one country so do Ukraine"], ["@sserunjogialphat3470", "There was time for diplomatic relations between Two countries....But NATO sacrificed Ukrainians"], ["@barnabasniwamanya8397", "And that's what so called \"NATO\" is meant for \"shading blood\"  so Ukraine looked for this"], ["@himiehonor1196", "Stop lying Amanpour, the US has run out of ammunition not cash which you have printed in bales! The Ukrainians are still being deceived to give them more hope. Even if congress releases the money tonight Ukraine will not get any weapons or ammunition for months. This war has shown the US political, military and critically, literary and Press leaders for what you are, same team. Sell-out Amanpour"], ["@ThisHandleWasTheOnly1Available", "Stupid. Losing your limbs for what? I don't see Klitschko\"s sons of Zelensky's colleagues from his comedian days on the frontlines. Why is that?"], ["@Flippi037", "Total insanity! Ukraine has had how many peace deals? They and the west said no. The fact that people and Ukrainians are willing to be manipulated into being slaughterd as cannon fodder for the west and NATOS proxy war is mind bendingly stupid. Why? Its time for people to say no to be sheep in these stupid wargames."], ["@josue_kay", "CNN still propagating bullshit!?!"], ["@paulnewsome6289", "Why are none of these reporters, journalists, commentators camped outside World Leader H.Q.s asking where the LONG OVERDUE military aid to Ukraine is, AND HOW MUCH LONGER DO THEY HAVE TO WAIT FOR IT?"], ["@BADDUDE_CORNPOP", "Ukraine has lost a whole generation and zielinski just keeps giving up more. Because Boris Johnson in a letter from Trudeau in Biden say not to give up. You should have negotiated a year ago. Now you're still going to lose drop the lines probably where they are now lose a little territory. But you gave up an extra 600,000 lives you didn't have to lose.\nZ..Z..z"], ["@twistymcfistysback", "The journalists in Gaza has been proved to be nonsense, so many are Hamas claimed journalists."], ["@shamsuaddinrachedi792", "hear that, they're NOT battle fodder, its official"], ["@derinden15", "\" There was a deal . Russia would evacuate them and exchange prisoners\" . Ukraine is lying. The wounded Ukrainian soldiers said that they were told they were going to be picked up by a car. Ukraine evacuate its best units and left the rest cannon fodders to slow Russian advance."], ["@atomatom4964", "It is extremely irresponsible of cnn and Amanpour to continue fanning the flames by asking for more weapons instead of promoting peace"], ["@i.d.6492", "So many smart NPCs in this comment section🤣"], ["@user-yt7gw9gf2g", "hey Congress and Republicans please help them, i will pay you back with interest."], ["@beauwetere353", "What a load of dung"], ["@user-zi5jy9lt1r", "1 milion ukiranians dead alredy .....and other side ot even 100 k.....THIS WAR ITS A  DEFEAT COVERED BY NAZI KIEV PROPAGANDA"], ["@perrystone879", "These journalists should know that there are life risks when they go to an active war zone."], ["@farright118", "3:15 nah there not outmanned Ukraine has 850k soldiers on the front to Russia 660k. However Russia will reach parity by January if the Ukrainians don't increase their army size"], ["@farright118", "1:35 so dumb for russia to shoot them. Now they cant get their own soldiers back"], ["@LiCan46", "Many people die for Zelensky and Putin now, sad war. Battle between clown and dictator."], ["@mahedihasan2762", "Do a report on palestinians"], ["@humanequilibrium", "At 0:15 the woman soldier has a Wolfsangel on her helmet. \n\nThat’s a Nazi symbol."], ["@_Tony.Montana", "Ukraine is already sending 50 years olds to the front lines. Now they want to send those crippled soldiers back to the war as well acording to that half breed CNN reporter."], ["@georgenelson8917", "Please learn English: decimate means to lose or kill 10% NOT WIPE OUT , DESTROY, KILL MOËT EVERYONE. 10% , 1 out of 10 . Bone head reporter"], ["@billalumni7760", "At 0:54 the Ukrainians state they train their men to fight not like cannon fodder like Russia.  Ahem ... the Russians have been training their men for about 6 months and Ukraine ... well reports have been stating they are lucky to get two weeks.  A lot of them are just a few days before they are on the front line.  Ukes don't have much choice though.  Average age of the ukes is now 43 by their reports.  When you are sending 50+ year olds to fight, you have run out of men."], ["@ArseniyBandarchuk", "Вчера у моей жены и дочери отрезали голову русские окупанты. И вот моя история. Только пожалуйста прочитайте до конца.: Доброго вечора. Мене звуть Арсен, я родом із України. Все, що пишуть кремліботи путлера або агенти кремля - це неправда. Я живу на вулиці Степана Банденри будинок 29. Щодня нас обстрілюють російські оккупанти. Але ми тримаємося тому, що у нас у підвалі є польські військові, які захищають нас від цих окупантів. Щовечора я приношу Нашим польським захисникам свою доньку для тимчасової втіхи, щоб моя дочка спала з польськими солдатами, а моя дружина працює з американськими найманцями. Моя дружина каже що американці в плані втіх та задоволень краще ніж німецькі найманці. Я сам щоночі підробляю чистильником туалету для арабських найманців, які живуть у нас у Києві. Наш український народ обов'язково здобуде повну перемогу над росією. Ми Українці народ сміливий відважний і відстаємо нашу перемогу над путіним. Перемога буде за нами. Ще я за нетрадиційну сексуальну орієнтацію. У нас в Україні усі чоловіки за ЛГБТ співтовариство. У нас усі чоловіки особи з нетрадиційною сексуальною орієнтацією, а всі жінки активно вступають у зв'язок із арабськими найманцями. Всі наші діти дуже люблять працювати за їжу, люблять спати коли у ліжку знаходиться найманець з будь-якої країни світу. Ми любимо витрачати гроші на спа салони та салони за доглядом за шкірою. Це все тому, що наші доблесні наймані військові зі США дуже люблять гладку шкіру. Ми обов'язково переможемо у цій війні, бо ми Українці доблесний народ. Перемога буде за нами. Слава Україні, героям слава. Нехай Україна буде символом дикої рослини під назвою Елда. Вона росте лише на свободі. Тому Єлда – це Україна. Єлда – це Україна. Єлда – це Україна. Єлда – це Україна. Єлда – це Україна. Єлда – це Україна. Єл це Україна.🙏🇺🇦🇺🇸🙏 🇺🇸🇺🇦🙏🇺🇸🇺🇦🙏🇺🇸🇺🇦🙏🇺🇸🇺🇦🇺🇸🇺🇦🇺🇸🙏"], ["@sergepajcin1255", "Cnn propaganda"], ["@Chaldon-hl6yk", "After World War II, public exhibition of the Wolfsangel symbol became illegal in Germany"], ["@tomsawyer283", "🇿 🇻 🇴"], ["@kimannepark4709", "War never changes"], ["@willgiddings9941", "Obviously this proves that ukraine does not have or ever had the capability of defeating russia. Facts dont care about feelings."], ["@Im_Ain_Ani_Li_Mi_Li", "Amanpour concerned for Ukraine, not so much for Israel.   Multiple conflicts make for conflicting messages."], ["@ImTooTallForThis", "A woman fighting for her country instead of leaving and starting an onlyfans. Much respect."], ["@ianantoinerobinson715", "The end result of nazism"], ["@JohenMiler", "What people don't understand is that a few have to be sacrificed to defend our values, democracy and western way of life and ultimately freedom. The West and its way of life are being defended in eastern Ukraine. And any means will do!  This must be communicated to every male Ukrainian who is fit for military service. And when the recruits run out there, we must ask our Western and European legislators and decision-makers to recruit people from the middle of the eu  and us and send them to the front to protect our liberal-western way of life. As a member of the LGBTQ+, this news about deserters and conscientious objectors is worrying."], ["@nabeelasghar6883", "what about palestine"], ["@JoeyJoJoJrShabbado", "The Nazis got a program called superhuman 😂"], ["@ronblack215", "CNN communist news network"], ["@ronblack215", "Joe obumer is criminal in chief and the so called democrats are organized crime"], ["@christophernovember163", "That black logo drawn on the female recruit's helmet was the divisional symbol of the 2nd Waffen SS Panzer Division \"Das Reich\" of World War 2 infamy.  Anyone out there who doesn't want to realize that NATO is propping up a corrupt regime rife with Nazi-wannabes, YOU can go stick it where the sun don't shine!"], ["@jhagler9010", "CNN and western media: “ saying there are Nazis in Ukraine is just Russian propaganda “\nAlso CNN: Has thumbnail of Ukrainian soldier with Nazi symbol on helmet 😂"], ["@yupsureok1778", "All Ukranians are cannon fodder"], ["@darrenpowell7225", "The people telling Ukraine to fight on should send their own children"], ["@qayyaracenter9357", "this USA promises to Ukraine 😊😊"], ["@rifledepot6067", "Can you guys keep your stories straight one week Ukraine’s gonna win the war in the next week are being decimated my goodness! All I keep hearing is more money more money😊"], ["@matthewkowall-gn3te", "Damn this is heavy"], ["@alirite2158", "Those people are making BANK out of those Amputees, they aint receiving them for free thats for sure, i just feel bad for the amputees"], ["@user-bs4sq4ef1g", "But Ukraine is still winning, right?"], ["@u.s.treeserviceinc.3217", "What is nazi sign doing on soldiers helmet?"], ["@brianchristoffer5872", "I love how the soldier on your thumbnail has a white supremacist symbol on the side of it 😂"], ["@h02ctn", "Josef Geobbels would have become proud of what America turned into."], ["@hokavistark7671", "CIA pushed Ukraine to this just to sell their oil and arms"], ["@antontarasenko9736", "Они уже и женщин хоронят. Ало"], ["@hgsert2733", "Russian landmines decimate ranks of Ukrainian . This is work of Victoria Nu land, the work of the Coup d'Etat by the US embassy in 2014"], ["@wren2900", "“Not cannon fodder like Russia”. The level of dehumanising the enemy not seen from the times of Hitler. But Ukraine is already lost"], ["@bikechainmic", "These mines also decimate the drunk ruZZians who cant remember where they put them"], ["@user-fd1bb8dc8t", "If sending money to Ukraine is a target of criticism, I think we can impose economic sanctions on Russia.I'm sure the American Republicans won't complain about this."], ["@radscorpion8", "Republicans refusing to fund Ukraine, why? Because Donald Trump told them so. Because its an election year. Or because they think the border is more important, as if you couldn't do more than one thing at a time. Any of these reasons is so sad and immoral. We have hundreds of thousands of people losing their lives or limbs defending their country and loved ones, don't you think that is important enough to warrant a small fraction of our yearly military spending? How can you have no empathy for human beings just because they live in Europe?"], ["@RoryMcDuff", "As if this is the year 1945 and the last days of Germany !. those sacrifial lambs think they serve their country whereas they serve the interests of Nato and the US of course !.."], ["@VovaYanchich", "Сраный Путин, устроил войну там, где к ней не было предпосылок."], ["@sirpout1216", "Who would have thought for all the hundreds of billions of dollars going into Ukraine, they used Airsoft rifles to train their troops?"], ["@tallest4eva", "The bloods of a lot of these brave men and women are literally on the hands of the GOP in congress while they are on their vacation."], ["@bcc1955", "Your looking at Ukrainian canon fodder for NATO proxy war. Totally unnecessary loss of a generation of Ukrainians on both sides. MSM and MIC and Biden Administration all war crime accomplices."], ["@ZURRAIN1", "i thought zalensky was winning....?"], ["@user-sf7kl9uh7k", "This is horrible"], ["@artkahn888", "This is all TRUMPS and his MAGA minions fault for blocking the foreign aide bill…. We need to supply aide to Ukraine NOW!! 🫡🇺🇸🇦🇲🇺🇦"], ["@razorback0z", "Russia has an obligation to defend it's citizens and it's nation from NATO aggression."], ["@SNNS-nq5zg", "Bravo à la russie dans son entreprise de dénazification de l'occident ❤"], ["@IsaacMuntz", "Nice propaganda"], ["@andrewadams6905", "Spent some time watching the \"denazification\" of the second Russian A-50 radar plane ($300M), came back to check if Russian Zombies finally came up with a new excuse for starting the war, but no... they are still pedaling the same old lame BS from Russian Zombie TV: \"coup\", \"proxy war\", \"Boris\", \"NATO\", \"surrender\". LOL"], ["@pea-tearwingedlion3422", "Are they shooting airsofts??? Sounded like it"], ["@go4broke407", "F cnn now a Russian propagandist"], ["@user-tm5em4vu7u", "That poor man with Ashtma is not going to last long! While Zelenskyy and the elite are all making billions from the foreign aid!!"], ["@stevenbaer5999", "General Sherman of the American Civil War is actually right about wars that War is Hell"], ["@ivangamer8022", "Nice propaganda your filthy ''media''"], ["@foreign_agent", "WTF is wrong with America? Keep  producing news reports about Ukraine war but holding back military aid. Fu*ing Idiocracy.🖕"], ["@victoriaa9107", "People of the world! stop speaking death over Ukraine! Specifically, you, reporters and media! My people, hear me!  lying is a mortal sin.  The war in Ukraine started in 2014, to say otherwise is to heap a curse on oneself!  In 1987 Saint Pope John Paull II came to the United States of America and said \"God bless [the United States of America]\". The Soviet Union took favor on the Russian Orthodox church and put false priests into the church the same way Bella Dodd claims the Soviet Union attempted to put false priests into the American Catholic church to push Russia/Soviet Union's political ambitions.  No leaders of the USSR or Russia recognize the pope or the Roman Catholic Church until even today, Putin will not meet or acknowledge the pope. The Russian government together with the Russian Orthodox church rejected the apostolic authority of the Roman Catholic Church and instituted Christmas in January instead of December in persistent rebellion against authority claiming that the Roman Catholic Church is a false church.  Russian and Chinese Communism persecuted, imprisoned, tortured, r.aped, and murdered Christians all over the world under the Soviet and Chinese banner. The Marian Apparitions accepted by the Roman Catholic Church by the magisterium under the leading of the Holy Spirit foretold of the \"lies of Russia\" spreading over the earth and that repentance would stop the consequences. On December 25th, the Soviet Union collapsed and became Russia and many other countries emerged.  I am amazed whether in a year, 10, or 100 God's Holy Spirit breathes on the earth to make Himself known. In this move of God's will many of those nations cleaned up their acts, rejected the Russian idols and joined NATO, a blessing the United States who Russia bullies constantly and tried to bomb by placing missiles in Cuba and now more recently Venezuala.  China has joined in on bullying the United States.  As God made appearance to Moses and the Hebrews in slavery in Egypt, He appeared in Europe and Asia with the collapse of Russia//USSR's slavery of many nations.  I am amazed to see God break the Soviet Union apart on the day of Christmas, the day God instituted through the Roman Catholic Church as a remembrance of when He came to the earth as Jesus to bring salvation to all nations, the Jews and the gentiles.  The same day the Russians snubbed in rebellion.  The Baltics and so many other nations that joined NATO are a blessing for the United States of America.  Russia is a majority Christian, mostly orthodox, and the USA is majority Christian, mostly protestant.  Pope John Paul II blessed the USA over Russia and took favor on USA over Russia.  Neither orthodox or protestant churches recognize the pope or catholicism, but the USA does not persecute catholics nearly as much as Russia has.  Communism has killed and tortured hundreds of millions, and additional billions through forced abortions.  It, including Russia in it's present form who allies and yolks with CCP,  North Korea, and Islamist terrorist groups and governments who torture, imprison, and murder Christians world-wide is the greatest stumbling block to the worship of God since the days of Moses.  The territory of Ukraine including the russian occupied areas would bless the United States of America and be a great strategic acquisition to NATO.  The peoples freed to worship GOD without coercion by Russia would be a gift to God and Christian witness to Jesus Christ.  Let us all press into the Word of God and repent where we find Jesus in the Word that we do not pursue in our lives. <3"], ["@MTF-ALPHA1", "ZZZ"], ["@user-ik8uo1dt2j", "It is much easier to carry a one-legged bride to the altar than one with two legs."], ["@mjfamgo6563", "Today apparently is punishment day for Putin with new sanctions😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂. The west is bunch of comedians nothing they have done has even slowed the Russians."], ["@neilmaclean8102", "When will the west realize they caused this war by their non adherence to the Minsk agreement  ? , how long ? . This insane hatred against the Russians, fuelled by the crazy western media is totally out of order."], ["@cairhis5670", "What’s funny is the USSR included Ukraine. It’s Russias country anyways and we (USA) just want a puppet government over there to protect our interests. We should have never funded them and the war would have already been over and less people dead. Our meddling has caused this."], ["@cairhis5670", "I was gonna say, why are they shooting airsoft guns? But it’s training. 😂"], ["@7sunsetmaro7", "I feel bad for these soldiers. The men are forced to the front lines to be ground up lole minced meat. All for nothing just to protect a corrupt government."], ["@TheExplorer250", "Stop voting blue stop sending tax dollars to Ukraine."], ["@jantzfitzgerald6115", "What a crock. Russian soldiers  are more trained than Ukrainian soldiers.  Ukraine  is desperate,  not Russia The war is over. Someone  needs to tell these fools. No bill in congress will make up the shell or artillery shotage in 2024. NONE. It is this funny thing called MATH."], ["@carpediem7654", "Things aren't looking good for Ukraine"], ["@DiplomatGaming", "What happened to “Ukraine is winning” U.S. regime propaganda 😒🤥"], ["@joekizito8320", "3rd assault brigade is that Nazi Azov brigade that has been renamed for those who don’t know"], ["@candyvitvitska2748", "There is shortage of men because all are fleeing to Europe"], ["@josegh89", "Ukraine: \"we dont train cannon fodder.\"\nAlso Ukraine: fails to evacuate, leaves wounded soldiers behind.\nMakes total sense."], ["@SimakSantana", "boomers and gen x lost to bots worst generation in usa history"], ["@mark4371", "Ukraine will win the para Olympics at this rate"], ["@mark4371", "What a made up propaganda piece 😂"], ["@zamorskymisa", "Just a comment on so called palestinian journalists - most of them work for Hamas."], ["@TBoy1247", "So sad what NATO expansion has caused."], ["@cruisemissile2873", "🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺"], ["@redross8518", "CNN always using Azov Battalion videos"], ["@crazy88909", "Are they using bbs?"], ["@user-jb1lh5uo4m", "CNN SHOWS A Z WITH A LINE THROUGH IT ON A UKRAINE HELMET THAT HAS DIRECT LINKS TO NEONAZIS AND WOLFSANGEL SYMBOL"], ["@user-jb1lh5uo4m", "CNN SHOWS A UKRONAZI THAT SYMBOL WITH A Z AND A LINE THROUGH IT IS LINKED TO NEONAZIS"], ["@Schizofre", "FUN FACT: There is 0 evidence Russians ever used their soldiers as cannon fodder. The fact that western mainstream media still spins this lie around is just showing how dishonorable they are"], ["@terike9738", "Oh look, it's Christine Amanpour, sophisticated journalist and international correspondent 🤣🤣🤣"], ["@xasikayagulwa497", "How can a man with no legs return to the front line Ukraine people are being misused by America"], ["@Barneys69Ruiz", "Snowdrops?🤔🤔"], ["@FBAagent", "this is as tragic and as sad as watching americans fighting iraqis in 2003 or americans fighting vietnamese in 1960s. Why? They shouldnt be fighting each other at the first place."], ["@binteam8501", "All of this for what? I would never go on the frontline unless my country has played all its cards!"], ["@Brad-fw4cn", "If your not in the war and your a journalist who chose to be in a war zone you get no pity.This is a war zone people. I am a veteran and I know gold star family’s and amputees who still can get compensation from a war we ended 2 1/2 years ago.I can’t tell you the frustration to see a network like CNN push this agenda when our own is struggling so bad over here.We are not the police of the world nor are we the clean up crew."], ["@Brad-fw4cn", "Sure Biden just send more money for another country’s war so we can struggle to buy groceries over here.Dummy"], ["@The_Riddler21", "Super sad seeing what is essentially brothers fighting brothers, Russians and ukrainians are the same Slavic people, hope this comes to a end, ukraine was fooled by usa luring Ukraine with a bright future if ukraine only follows americas orders, Greetings from an Iranian ✌️🌹❤️"], ["@garysmith6056", "But they said Russia had run out of missiles and everything, but how come Ukraine is under manned. They shd be just walking to moscow by now."], ["@ReflKnight", "Boi Russia is dangerous with all the shovels and stolen toilets they are using to fight Ukrainians trained by Nato. Just imagine if they did not run out of rockets and ammunition 2 years ago"], ["@iROChakri", "Please surrender. Russia doesnt want this war but Russia will defend itself from the Nazi of the West. Rewatch the video if you havent seen it."], ["@tankeriv", "Wolfsangel, nope no nazis in the Ukraine 😁"], ["@Theone-bc7tr", "Nazi corrupt Ukraine"], ["@panyo2511", "What makes Russia strong are the Trans-Siberian Pipeline (e.g. near Uhkta), the Rosnefts Tuapse refinery on the Black Sea, the Lukoils Kogalym oil field in Western Siberia and Gazprom's Bovanenkovo gas field on the Yamal Peninsula. That's where the money comes from. Russia uses this money to buy what it wants. When it wants and where it wants."], ["@johnrexx6903", "NATO needs to step up and accept Ukraine into their fold, or Ukraine will fall by summer"], ["@laumrabodemwig7913", "The subtitles are absolutely horrible."], ["@WeaGy79", "Meanwhile Zelensky and all his bodies in crimes have their families well guarded and safe. People are blind."], ["@johnbrown8570", "Nazi symbol on helmet!"], ["@MasterNeoRNCP", "One man made the change - Boris the Liar"], ["@MrOliverAC", "Sadly, the russian people is all at fault, most of them praise Putin and dispise Ukranian citizens. Empty minded russians."], ["@GungaLaGunga", "oh man this sucks. war is hell. just pure horror."], ["@shajiashamim765", "Ms. Christaine Amanpour \"It's an one sided story!\" of Ukraine - Russia conflict."], ["@ssullya", "Peace please come back . Cruel Russia and brother Ukraine is fighting. Not worth loosing people. Please stop war."], ["@lordfatcock", "That's a interesting symbol on that lads helmet and on the thumbnail.."], ["@steveagola9317", "Every assault squads are meat squads"], ["@antonioigneous6653", "zelesky is killing his own people,\nwhat is the point of Joining a NATO at expense of all amputeese and deaths,\nGOD will judge his for his NAZI spirit and greedy for power,\nfrom jungles of Africana"], ["@YoungOneYT", "Slava Cocaine!"], ["@Ferndalien", "Putin was an officer in the KGB, so I'm fairly sure that as a child he was a Soviet Young Pioneer.  One of the Young Pioneers' duties was walking as guards around the massive Soviet monuments to the Red Army dead of \n\"The Great Patriotic War\" (WW II).  Young Pioneers, including Putin were indoctrinated with the heroism of the Red Army.  The estimates of Red Army casualties for that war range from eight MILLION to thirteen MILLION dead.  Overall the USSR lost at least 27 million soldiers and civilians.  But from the beginning of the invasion of the USSR by Nazi Germany to the end of the war was four years.  There were between two and three million Red Army dead PER YEAR.  In the worst time for the USSR there were probably more than three million Red Army casualties per year.  Putin remembers this. Current estimates for total Russian Army casualties for the two years since the initial invasion are less than half a million.   A quarter of a million a year compared to two to three million per year for WW II.  In Putin's view, and the view of older Russian generals, that's a tenth of the losses, and I believe that they are confident they can sustain that for as long as it takes to conquer the Ukraine.  Russia won't initiate any peace talks that fall short of total surrender of the Ukraine."], ["@Nina-eo8vp", "Stop the corrupt Biden sponsored war"], ["@ahmedalsharman", "Western propaganda 😂😂"], ["@manoftheroad55", "Thank you Biden ...send your son.."], ["@stanislavsavonin6405", "\"Non cannon fodder like Russia 😅\" When they say that it's funny. That is what Russians say about Ukraine as Ukraine doesn't have as much fire power and artillery. I watched interview of Russian solder who was saying how Ukraine just throws them knowing they will be shelled and not survive. This whole thing is so so sad"], ["@user-ks4ts8xi9o", "America and UK had bring the war on Ucraine lands.... Zelensky must live . Zelensky it's just a slave off those how don't want peace....."], ["@andrewadams6905", "Russian bots don't respond to comments, only post BS from their check list and run. LOL"], ["@leo5543", "God bless these Brave men and women fighting for their country. Congress is playing political games with their ability to defend themselves. I am calling my rep today. Maybe I can spare some money for a donation."], ["@Krispy1011", "Zelensky - give up and quit destroying your country and your people for your insane NWO ambitions - Stop war and have peace negotiations!"], ["@Benjamin-ii5ei", "Memory is the faculty of the mind by which data or information is encoded, stored, and retrieved when needed. It is the retention of information over time for the purpose of influencing future action.[1] If past events could not be remembered, it would be impossible for language, relationships, or personal identity to develop.[2] Memory loss is usually described as forgetfulness or amnesia.[3][4][5][6][7][8]\n\n\nOverview of the forms and functions of memory\nMemory is often understood as an informational processing system with explicit and implicit functioning that is made up of a sensory processor, short-term (or working) memory, and long-term memory.[9] This can be related to the neuron. The sensory processor allows information from the outside world to be sensed in the form of chemical and physical stimuli and attended to various levels of focus and intent. Working memory serves as an encoding and retrieval processor. Information in the form of stimuli is encoded in accordance with explicit or implicit functions by the working memory processor. The working memory also retrieves information from previously stored material. Finally, the function of long-term memory is to store through various categorical models or systems.[9]😂😂😂😂😂"], ["@adwoaacheampomaa7304", "Who is going to solve this dispute among this two country?oh people are injuring and dying"], ["@aprilmustjune", "look at the nazi insignia !!!!!!!"], ["@chemifav", "stop the war! we need negotiaons not more weapons i feal sorry for both sides!"], ["@santanaserrato3909", "Meanwhile Ukraine president in US president drinking coffee on the office counting  millions ,"], ["@USB740", "Every able bodied Ukranian male need to sign up, there are way too few volunteers. I have not seen a less motivated people. If you are not willing to sacrifice for your country then you will lose. This is just the brutal truth."], ["@fghhna", "0:14\nwhat kind of sign is on the helmet?"], ["@roljavi", "0:15 what's that sign on helmet, dear CNN?"], ["@ElwoodBluesAK", "CNN forgot to remove the Nazi symbols from the footage lmao"], ["@mickusrobertson9534", "Why wasn't western media reporting the hard reality 18 months ago or even 2 months ago? Instead of just promoting false narratives? Oh because it would actually show that Ukraine can't win and this conflict needs peace negotiations, not more weapons and money to keep it going."], ["@brokengenius315", "The most unnecessary stupid war....that is killing thousands of innocent lives....."], ["@labouraredangerous", "The reporters killed in palestine would they be the same ones who participated in the October attacks on isreal"], ["@user-hz4qy9lq7v", "Ukraine started the War by threatening to join NATO. This could have been avoided."], ["@user-hz4qy9lq7v", "Soon US Soldiers will be drafted to fight in Ukraine."], ["@andrewadams6905", "Today, February 23, Russians celebrate the \"Defender of the Fatherland Day\" to commemorate German ultimatum to the defeated Red Army on February 23, 1918 😂 \r\n\r\nOn February 23, the Germans responded with an ultimatum allowing the Russians two days to open talks and three more to conclude them. Lenin, realizing that the new Soviet state was too weak to survive a continuation of the war, threatened to resign if the German terms were not met."], ["@LtGregoryStevens", "I like that literal ukranian nationalist nazi symbol on the fascist thugs helmet in the thumbnail. They openly show it and then claim they arent nazis 😂😂😂"], ["@kinddave27", "Wait a minute is that rifle sound!!! Is that an airsoft gun noise. Wtf"], ["@juanvga", "USA just want to destroy the Slavic race..."], ["@ifeetz7612", "What idiot ever believed that Ukraine would ultimately win this war? It was all about feeding the taxpayer lies, to justify robbing them to fight this war!"], ["@bobgonzales9680", "Ukraine a sacrificial lamb in an Anglo-saxons proxy war..."], ["@paovang1685", "It's called war stupid. If Ukraine don't want it don't start and just surrender."], ["@Wredd60", "Us Americans will not be sending you guys anything anymore"], ["@Wredd60", "This is a civil war"], ["@cornebod", "Hold up, Russia has landmine shovels now?🤯🤣"], ["@PAMPOSZINONOS-th6di", "English full of sheet"], ["@user-cc1bf2pv4h", "fight for freedom, fight for democracy, fight for your own country. fight for your next generation and future , fight for the value that is what citizen are for"], ["@francoissodohoue3469", "What country dropped cluster bombs in Ukraine, in order to stop the Russian troops?"], ["@michaelkelsey574", "I got a whole new opinion on russians. 4 one they are stupid.\n\nAs for puttin he's a big baby trying\nTo take the toys away from the\nOther kids. His mommy (gov) let's\nHim.... so I think a adult should \nStep in because his mom sucks"], ["@rajesh_624", "omg christian amanpour - what an effing  joke."], ["@_hootjohnson", "This is all Speaker Mike Johnson’s fault."], ["@IngCarlosSagan", "The most horrible thing is that the United States is helping Israel to do the same with Palestinian children."], ["@Mordu83", "Airsoft fake news"], ["@andyfren5490", "\"the brigade says its training professional fighters, not cannon fodder like Russia\" << well, if i were Ukraine, id use cannon fodders, because right now it seems Russia is winning using only cannon fodder soldiers.."], ["@alexshapiro9841", "Ukraine DOES recruit cannon fodder. They are 30 mln men, and they want to recruit a million. Those people are ex students, office workers and farmers. In 2023 Ukraine sent a wave after wave of them on a 'summer offensive' that failed."], ["@W3_WuZ-Kaaaaangz", "This is UKRAINE!!!"], ["@donmcglothlin841", "If they’d took the negotiated settlement Putin offered this wouldn’t be reality"], ["@o.n.s.j.c8696", "Obama killed the American credibility regarding the defense of Ukraine's sovereignty when he closed his eyes in 2014 to the invasion of Crimea by the Russians, in Budapest (1994) Ukraine ceded its entire nuclear arsenal to the Russian Federation in exchange for protecting its sovereignty within recognized borders by the UN in 1991 that included Crimea, so signatories Russia, USA, UK and France committed themselves to ensuring Ukrainian sovereignty.\nRussia broke the agreement like all the others that signed it, the only one that complied was Ukraine, which was left without its nuclear power, which today would be a deterrent to Russia. \nTherefore, and particularly today, the USA, in order to reverse this loss of credibility in this Ukrainian process, must effectively ensure compliance with the international legal terms of 1991. \nThe more hesitation there is in definitively helping Ukraine to win this war and expel the Russian army to beyond internationally recognized borders and including Crimea, the more likely it is that the Americans will be forced to put boots on the ground to solve the problem.\nSo it not wise that the American Congress is blocking aid to Ukraine now when later the Americans will see their children once again directly involved in a war on European soil."], ["@OrataKopata", "Woah, two days in a row...(Re:)Would it be possible if by any chance CNN could refrain from pushing, glorifying and promoting the insignia and other visual representations of the 2nd SS Panzer Division Das Reich and their spiritual descendants, the ukropitecian rebranded azov-swines, the re-imagined 3rd separate sturm-gruppe?"], ["@jameshhaner", "Zelensky spoiled the peace of the people of Ukraine"], ["@tilahuntesfaye5506", "This is what you got when you became puppet of Americans"], ["@grumpygregory3095", "But you told us a few months ago Ukraine was winning this war.  CNN lies"], ["@riche4you1975", "So what use is UN? They bark on behalf of hammas also the ccp back in the covid days but do nothing about RUs' descusting behaviour, RU are no better than hammms."], ["@ravenof1985", "kinda strange that CNN would release a video showing Ukraine doing badly, when theyve spent YEARS only showing the wins.  i wonder if there are any Aid bills having trouble passing through congress at the moment?"], ["@MG-fr3tn", "Putin is going to learn about hell, its going to come from the ones he stole ideas from.not mighty armes not nations.\nDeath on a scalethat will make the free world wish they saw him for what he was."], ["@TheBello1974", "Amanpour has ever try to uncover the truth as a journalist does normally in the name of free media or just always served her masters with these kind of neverending lies in interests of american weapon industry?"], ["@jojopapa7521", "This wouldn't have happened if BORIS JOHNSON and BIDEN didn't ill advise ZELSNSKY to cancel the agreement reached and signed with Russia!!!"], ["@user-lx8ep1xq1e", "Не переживайте, они уже в плену. Его вылечили, накормили и жена с радостью благодарить, российские освободительные войска, что хоть уберегли её мужа от омиреканизацыи от крепостного права в Украине границы закрыты мужиков на улице, ловят и отправляют на фарш Если кто не знал"], ["@danw918", "I wish the Americans would either shut up or put up. Not everyone would drop their guns are gun away like you did from Afghanistan."], ["@dm8579", "Russia can only afford a few months of fighting. They lost all their generals in the first two weeks.  They have no equipment and people are sent to the front with shovels. They lost 3 million men and 6 million tanks in the first months of the war."], ["@casprog1911", "CNN, talk about Gonzalo Lira."], ["@casprog1911", "CNN is fake news."], ["@user-pj9mo5od6b", "Unfortunately for Russia, the situation may unfold according to the Afghan scenario, a protracted and long war that threatens to develop into a partisan war with all the consequences.  Descendants will answer for what one dictator did."], ["@Alexander-mk4qf", "😂😂😂😂😂 canon folder like Russians 😂😂😂😂😂 said CNN 😂😂😂😂😂 crazy how they invert situation"], ["@bharathramesh4924", "Biden should send 300 billion dollar to ukraine,"], ["@user-yg5hl7gr7j", "0:14. Wolfsangel? No. It seems to me..."], ["@davidkindandi7631", "Reason why Ukraine must negotiate with Russia and stop this nonsense that causes life disasters"], ["@lukelilly1572", "This war needs to fucking end! This is horrific."], ["@LienNnamenhab", "Russian shovels and washing machines are lethal."], ["@stephenkennedy7931", "The Republican Party should be so damn proud of them selves seeing the havoc they are creating. May GOD have mercy on your souls"], ["@binder946", "The helmets have nazi insignia 😢😢😢😢"], ["@TheGryph78", "GOP = Putin's gang!"], ["@mientrungtv76", "Chế độ Phát xít không thể tồn tại trên thế giới. Nga hãy xóa bỏ chế độ của Tổng Thống Ukraine ngay lập tức, kể cả phải sử dụng vũ khí hạt nhân."], ["@oscaroctavio", "Russian army is an army with no honor 👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻"], ["@thesavagewombat6867", "Republicans of the past are turning over in their graves for the lack of support given to a country fighting a brutal Russian dictator."], ["@tiktokasylum5186", "This is horrible"], ["@skariachenmathew3775", "If America was not there it n this picture . This war never be like this . More people are dying"], ["@santossarmiento5600", "I thought the USA sent 100,000? Where did they go man I swear they be tryna lie sending us on suicide missions pretending to make us fight Nazi but really the Nazi in the USA blaming other people of their own lies and corruption forcing them to look like crooks. We seen the military blame and still use the German Nazi snake European flag, and we ain't going to be hanging out we really just going to Start fighting straight up I don't care about your family or your female 😂"], ["@mrislavibra", "This is a zionist propaganda story,starts with Ukraine nd then goes to tell a little about journalists  in palestine then she says it is because of Hamas then goes to interview a mother who lost her son in Iraq bcoz of ISIS\n\nClearly trying to rouse islamophic feelings \n\nNo mention of more than 2,000,000 Iraqis dead because of the USA invasion of iraq\n\nNd also in Ukraine,how do u move from that to Isis"], ["@paulyoo4050", "영국, 프랑스는  자국 병력을 참가시켜서  \n전쟁지원해야한다. 뒤에서  작은 돈만 지원하지말고, 희생을 각오해야지"], ["@paulyoo4050", "Present  Biden  needs  to  go"], ["@davd1986", "None of this would have happened if the US didn't meddle in Ukraine in the from 2008 and especially in 2014 and onwards."], ["@lawrencecole6527", "I guess Boris should have never talked Ukraine out of peace."], ["@BB-zc4gq", "Rootin for Putin. Zuck Felenskyy."], ["@arianshaholli7770", "Stop the civil war, west stay away?"], ["@henkvisser9741", "wasnt cnn already ousted for prviding fake news during desert storm? im sure i saw a clip of them wearing helmets on a green screen."], ["@henkvisser9741", "I heard, from a grapevine mind you, that the USA might have weapons of mass destruction and are develeping next gen So even if we ignore this fake interloper war, in the meantime US is developing WMD's. and as we all know, delevoping WMD's is a reason to invade."], ["@willkuerlich", "Stop slaughter in Gaza"], ["@DDWRT88", "Didn't CNN say the russians were fighting with shovels and washing machines? 😆"], ["@kormidoit6709", "Why is no one asking this question.....WHAT dirt does ZELENSKYY have on bidens????"], ["@taklinfuel3477", "So, the Russians are not out of ammunition and fuel and low on fighters? Do you all remember when they were saying that? It's all over YouTube if you need to check."], ["@leohedrick1624", "In China they call Ukrainian soldier Teletubby 😂 because it rhymes with 填线宝宝 😂 people in the west actually naive enough thinking Ukraine will secure an victory …"], ["@SM-ie6sz", "this is heartbreaking. fucking putin and the spineless republicans,"], ["@Paul-rz8ws", "3rd Assault Brigade = Azov"], ["@jeasgordon2802", "When the stupid western countries refused to send there lethal weapons to ukraine they want to help ukraine but they are not sending there best they are just there just for moral support"], ["@andrewadams6905", "Wanted to check if Russian Zombies finally came up with a new excuse for starting the war, but no... they are still pedaling the same old lame BS from Russian Zombie TV: \"coup\", \"proxy war\", \"Boris\", \"NATO\", \"surrender\". LOL"], ["@Evemeister12", "Ukraine hasn't got a leg to stand on militarily."], ["@user-yq3yx3cw3p", "why go? Russia is going to win.  The USA started this in 2014 when they over threw the ukraininan government.  Russia is doing pretty good for a bunch of drunks stealing microchips out of washing machines eh?!?"], ["@Cheapmotorcycling", "CNN … you won’t convince anyone with your BS fabricating-reporting!"], ["@James-hm9on", "Who is paying to kill all those people in the Middle East ? The west doesn’t  have the moral high ground , we are the bad guys and the entire world can see this , our media has lost the propaganda war"], ["@sungazer454", "Hello Ukrainians! \nYou seem to be new to the US‘ aggression by proxy game. \nNow you’re dying for US geopolitics.\nSad."], ["@rockyfjord5338", "Russia has the moral high ground since the filthy Obama-Nuland CIA coup in 2014. You have to be banal and stupid to think that US/EU/Nato could win this proxy war.\nRussia lost 27 million in WWII. the US less than 300,000 combat deaths. The Russian soul is invincible."], ["@haskeww8193", "I am so saddened that the idiots currently in charge in the United States exacerbated this conflict with Russia. If I were the president we would immediately host a peace summit with President Putin. Sanctions would be immediately lifted USD would be demilitarized, We would negotiate a fair settlement that preserves part of Ukraine as a free European state, rightfully Russia would annex the eastern osteoblast and Crimea. We would not be naive but we would seek good faith efforts to repair our relationship with Russia. Blackrock has exclusive contracts to \"rebuild\" Ukraine after the war is \"subosedly\" over.. let me tell you... This war is going to drag on and on and on and it could have been completely avoided if Russian interests were recognized and respected and declarations were made  to cease aggressive NATO expansion beyond a reasonable defense posture!"], ["@jeddmohlenkamp6870", "Can’t fix stupid 🤷🏼‍♂️Ukraine is careless with their conscripts"], ["@stephansteohanlarsen7457", "Difficult to watch"], ["@Krispy1011", "Zelensky - give up and quit destroying your country and your people for your insane NWO ambitions - Stop war and have peace negotiations!"], ["@Krispy1011", "Ukraine's own landmines are putting their own soldiers out of commission - and thats a fact Jack!"], ["@stephengillott9435", "Certain members of the American congress should be ashamed of themselves, using support for Ukraine as a bargaining chip for what they want."], ["@nate_reatcz", "Lol they last a month . Also hey the nazi helmet?"], ["@pierrevallet6188", "c'est tout benef pour les allemands qui ont augmenter leur productions de prothèses"], ["@ahmedmaeeshmohamed4193", "\"We are sending real soldiers while russia sends cannon fodders\" \n\nMeanwhile, the videos of recruiters kidnapping people to get sent on to the front"], ["@BA-ho7dw", "The fact that western media start changing the narrative and report more about ukrainian reality (lack of men, losses, defeats) means that the US is preparing to pull out of this conflict"], ["@pavlovic61", "Is it the same Christiane Amanpour who claimed that Iraq has weapons of mass murder or how Serbia is mass expelling its population from its territory in Kosovo?"], ["@jimahlgren6177", "Sounds like Christiane Amanpour should go to Gaza to report."], ["@carolbennett1427", "CNN is a weak ally- more probobly a detrimental ally"], ["@andrewadams6905", "Russian bot farms got instructions to beg Ukrainians to surrender aka “negotiate peace”, so Russia could secure the loot before striking again later."], ["@mussydesign7933", "poor kids, war is no joke, war is hell! stop promoting this senseless war..."], ["@georgeokorie905", "Come to  the table to negotiate.\nThis cannot go on forever."], ["@aigaoliveira3278", "That phone call between brother and sister was beyond heartbreaking. Cruel world."], ["@Aria2023", "No one to blame but Borris Johnson and the comedian in cargo pants!"], ["@user-rq3pe2yw6y", "We all know the US is preparing a bigger war in Europe against Russia, its all about saving the economy and debt of the US, CNN did not report what hapenned in Georgia a week ago or so, cowards!"], ["@racingfan1697", "I thought Ukraine was on top of this and winning?!🤔🤣"], ["@user-rq3pe2yw6y", "Those from CNN documenting the war as if they did not have their share of responsibility in it, they told the world there is no alternative but to fight until the last boy not explaining that there were peace agreements more than a year ago and that the territories conquered by Russia are rebuilt and the population of those separatist areas are freed to returns to a normal life."], ["@chrismerkel9604", "The MAGA GOP Need To Get Off Their A$$es And Pass The Funding\nBill So Ukraine Can Kick Putin's A$$!"], ["@MoisesAguirre-uv4oy", "Dawg they don't even have sights on their bb guns"], ["@collettebarham6360", "Well done Joe and the other warmongers. Did you put in the same effort to prevent the war as you are trying to put in to prosecute it. Abandon Afghanistan to barbarism but the next year you have another \"forever war.' Will you cough up the one trillion dollars that it will take to rebuild the Ukraine, or will you abandon the Ukraine too once its usefulness is done. \n\nI cant understand the media pushing this madness. I will never forget WMDs in Iraq. A total lie facilitated by the media and as a former military officer I could see that Colin Powell was lying or at least pushing misinformation. I was willing to fight the Warsaw Pack then but not Russia and China now. The rot in the West is too great now and we are too much like Russia and China. Even Trudeau says he admires the Chinese political system and would love to bring it to Canada to govern that wonderful country. Seriously!\n\nHow many of these arms dealers, journalists, and politicians ever served their country or risked their lives. I did for 10 years and I am against avoidable wars. Linsey Graham says money and lives well spent. Seriously. I pray for the soldiers on both sides who should be home with their mothers and wives.\n\nThe old lie: Dulce et decorum est pro patria mori! \"How sweet it is to die for one's country! Go read Wilfred Owen and the other war poets. I ain't dying for Joe, Richi, Barak, or Bill Gates or the bottom line of Boeing, Lockheed or Raytheon. ."], ["@ErrorOptik", "What’s with the Airsoft sounds?!?"], ["@ezzieeddie5439", "Life is full of choices. If you choose to enter a war zone the sadness and pain comes with it. Choose wisely and think of your family. Try not to be selfish"], ["@Fj8282haha", "Human Brother and sister, peace , we r one"], ["@avex3903", "nato bots you are free to join the front and help ukraine instead of whining all day"], ["@atlas6676", "Ahahaha) take a look at the preview for this video! Nobody notices anything? On the helmet of a Ukrainian soldier the symbol “Wolf Hook” is the symbol of Azov."], ["@martindread6530", "Peace, Prosperity and Secure Borders. \nTrump 2024 🇺🇸 Save America"], ["@garryleslie1256", "We enjoy how the world has discovered the CNN fake gutter press and racist media coverage of Gaza and genocide and historical ICJ processing ..Laughable daylight disgrace...That's the problem of being a zionist mouthpiece In the first place."], ["@elvenkind6072", "Interesting to watch this many pro-Putin comments on every single major news channel that have anything to say about the war in Ukraine. I wonder if the FSB have some kind of automated system by now for \"debating\" on Ukraine issues, and how many % of Trumpists work for free, doing hard work to spread defeatism."], ["@fredkite9330", "Its scary that the GOP Pro Russia Party, continues to support TrainWreck Trump."], ["@juanmiguelreyesguerr", "Fighting for Washington’s proxy wars is terrible business."], ["@BDRioga", "I thought Ukraine was winning? 🙄"], ["@Russellviews", "CNN censoring comments."]]