[["@lexfridman", "Thank you for listening. Here are the timestamps: \r\n0:00 - Introduction\r\n3:53 - Putin\r\n20:07 - Navalny\r\n41:20 - Moscow\r\n1:00:48 - Freedom of speech\r\n1:07:03 - Jon Stewart\r\n1:19:48 - Ending the War in Ukraine\r\n1:29:15 - Nazis\r\n1:37:42 - Putin's health\r\n1:48:47 - Hitler\r\n1:58:12 - Nuclear war\r\n2:16:31 - Trump\r\n2:33:27 - Israel-Palestine\r\n2:39:37 - Xi Jinping\r\n2:53:34 - Advice for young people\r\n2:58:53 - Hope for the future\r\n\r\nTRANSCRIPT:\r\nhttps://lexfridman.com/tucker-carlson-transcript\r\n\r\nSPONSORS:\r\nPlease check out our sponsors to support this podcast:\r\n- ZipRecruiter: https://ziprecruiter.com/lex\r\n- Listening: https://listening.com/lex and use code LEX to get one month free\r\n- HiddenLayer: https://hiddenlayer.com/lex\r\n- LMNT: https://drinkLMNT.com/lex to get free sample pack\r\n- AG1: https://drinkag1.com/lex to get 1 month supply of fish oil"], ["@CeeMigoLoCo", "👏🏽To The speech at the beginning of the video from Lex.. Good for you sir, Good for you.. God Bless you🙏🏼"], ["@loreneelliott8313", "You are a trader too."], ["@NathanCroucher", "Lunatic, a rambling dangerous lunatic. And that laugh..."], ["@ZenEconomicsChannel", "The problem is nothing Carlson says can be taken seriously since he tried to say since groceries are cheaper in Russia, Russia is a fine place to live...*without* telling the listener Russians spend 60% of their (15k equivalent) income on groceries. He loses any credibility at that point and exposes himself as a pro-Russia sympathizer and also anti-US, so this interview and his perspective is entirely useless."], ["@jaikyiv", "It's not that you don't ask hard questions. You don't ask any questions... Tou just let people spew lies for 3 hours. How do you except for your viewers to understand the difference between a made up story and a fact?"], ["@user-ef4xs8fv4s", "I’m surprised Tucker pick Malaysian mafia😂"], ["@loreneelliott8313", "Tucker is a USA trader"], ["@luckyfk3452", "Nice. 3 hours of kremlin propaganda. Like there's not enough of it already. Rubles don't smell, comrade fridman."], ["@5gPheromoneTrail", "INTERNET SEARCH QUALITY EVALUATORS are hired by private firm who filters them out politically during the job training process. Applicants sign non disclosure agreement before “hired”."], ["@cosimocub", "course Putin authorised the killing of Navalny, Putin does what he wants, when he wants in Russia"], ["@andyjota8906", "Americans talking about imprisoning political opponents.....................................  "], ["@Villanuevva", "I wonder why didn’t you, Tucker,  call putin out on all these “dumbest things”? You were sitting and nodding there for two hours, and then went for groceries.\n\nTop notch journalism 😢"], ["@vaguehonk", "Our government is shit, mass media is shit, society is going to shit, everything is turning to shit.\n\nWell Tucker, how do we fix that?\n\nEasy, we elect a hateful, sexist, xenophobic, narcissistic, pathologically lying egomaniac who's a fraud on top of that. What could go wrong?"], ["@DrMentosFreshMaker", "\"People who pursue wealth and power for their own sake can not be good morally.\" \n\nSo America is....."], ["@laurenfonseca9098", "Tucker lost me when he denied that Nazis existed outside of Germany."], ["@RobertSweatman", "Liberals WITH SANITY love your interviews ... the Shamans ask us to seek Truth & Enlightenment ... Thanks again"], ["@Mtneer-sk8vh", "Claiming Denazification is not true (minor issue). It makes it propaganda.  Putin just cannot logically believe it."], ["@Graplernapler", "At what point will we start to ask the degree of influence that ancestral and ethnic-historic ties in the area have in directing US foreign policy among those in power?  Or is this outside the window of acceptable discourse ? Lex?"], ["@sonnystreatwise1231", "Tucker goes deep into truth"], ["@hanghaeja", "\"Moscow was surrounded by Germans as you know. For a year\". What a joke."], ["@scaringclaring5240", "I just find it dumb to be generalist ageist. If a 77 year old is more acute intellectually, gifted, loaded with life experience & wisdom than say, 95% of 35-45 year olds in 2024, why should one of the mediocre 95% be eligible to run for president but not the 77 year old sitting at the fringe end of the curve? Tucker surely knows, just as genius & highIQ is uncommon, you could be missing out statistically on the best person for the job if you go by majority or average or median. One should never make selection of individual for a particular position based simply on averages or even majorities. Missing out on genius (not just in literal IQ terms) is immeasurable."], ["@gonzalosilvavera616", "You should talk to everyone 👏specially those who you disagree with, I don't understand why people is always avoiding those conversations those are usually the best and most honest conversations one can have"], ["@mrplease66", "says 'I'm much older than you. My life was defined by the Cold War' to a guy who was literally born in the USSR and emigrated to the USA. That takes a special amount of narcissism"], ["@poltergeist6151", "If Putin attacks Ukraine and aims to erase their nationality, that is indeed - Nazism. Therefore, Putin is a Nazi, and the stupid claims that Ukrainians are Nazis are lies."], ["@ICU-mw7su", "Now we know it was the clot shot!"], ["@jordanrock3494", "The Biden administration is a fascist coup. The irony and hypocrisy will come back to bite those who voted for it, and I'm here for it. 💋"], ["@user-lu1pn6to9e", "Tucker you are my hero for just being straight up real about matters."], ["@JustinDeRosa", "Lex, I'm not mad buddy... Just hella disappointed.\n\nThanks for helping this be the last time though.\n\nStronzo come non se altro.  Che schiffo."], ["@magister1978", "He does not understand the difference between Nationalism and Nazism - these are different concepts."], ["@mntlblok", "Without Covid, would life expectancy be falling?"], ["@recklssabndon", "Omg that moment where lex asks if he’s wearing cowboy boots was great. But also, that was a red herring of a question— if someone points a gun at you then that’s brandishing a weapon. No license allows for that without response. You’d be well within your right to shoot them if they pointed a gun at you. I think the realist approach Lex describes is kind of going over Tuckers head a little bit. Or Tucker is waffling a bit from hating on moralists while also being a little bit of a technological moralist"], ["@gigilaco", "43:00 Moscow IS a very beautiful city, I’ve been, and St. Petersburg is even more beautiful. However most Russian cities are run down like those in the USA if not more so. Maybe they don’t have gang violence but in cities like Cherepovetz there is very bad pollution and many run down areas. I understand Tucker, I had rose colored glasses towards Russia for years and although it’s beautiful in its own right, it’s not far better than the USA like Tucker says. American small cities are where the beauty is kept in the USA."], ["@strangeanimal1535", "Humanity is a warrior breed. We probably ate the missing link too."], ["@tempest-9115", "I don't think that Tucker is thinking rationally in millitary terms. Raid on Kyiv was not a bluff to scare  Zelensky out of Ukraine, Russians got their asses kicked out of the capital by Ukrainians."], ["@earnestwolfson6557", "totally agree with Tucker - \"russians so dumb\"?? and it is amazing how he calmly listen puttin's gibberish"], ["@Truth_Hurts528", "If you want a great real world example of what Tucker is talking about, with the acceptance of the decline in living standards look to that poster child of progressive liberalism that is South Africa. Where once clean, safe, functioning towns and cities have been turned into hellish, crime ridden ,collapsing third world shitholes( literally sewerage flowing in streets, beaches contaminated and unsafe, pandemic of cockroaches etc). But when anybody advocates real solutions or worse dares to point out things were once better you're immediately condemned by liberal Trevor Noah types as racist, fascist etc and told not to believe your lying eyes these are just minor \"challenges\" in face of a glorious utopia of  diversity, equity and inclusion that's blessed the nation."], ["@paullobosco4454", "Best line : It is cold outside"], ["@rosemarysegroves8208", "He probably got the Jab. Clots are a big problem."], ["@darkdvr", "Lex, you say you value \"opening a door to a conversation\" and a possibility of peace. Can you elaborate on your feelings on a Zelenskiy's enabled law prohibiting Ukraine's officials from having any sort of talks with Russia, locking Ukraine in a \"defeat Russia or die off completely\" situation? It's a fact, it is a law signed by Rada of Ukraine in 2022, quick google search will give you full details."], ["@stuartmiddleton1972", "Tucker and Rogan I would watch that in an instant. Please make it so."], ["@DanielMooreClan", "TC needs to be called out on his own BS. The WAR in Ukraine is NOT KILLING the US economy by investing 5% of our MILITARY budget in Ukraine. The US economy has record low unemployment, and highs in the stock market, 3% inflation. Come on man!"], ["@jaikyiv", "So ruzzia production is 7:1, it's more powerful than NATO... But you don't think your kids are going to be fighting for NATO. Pure American patriot."], ["@user-ul9se7qt5q", "Enjoyed the video very much 🙏"], ["@sonnystreatwise1231", "Ticker is really extraordinary"], ["@WallabieMcDee", "\"What was your goal?\"\n\"To bring more information to the world.\"\nJournalism... the word is journalism."], ["@vdachev", "The architecture stuff is absolute bs. Yeah ancients built pyramids and castles (because they needed them). We built the Eiffel Tower in Paris, the Statue of Liberty in NY, the statue of Jesus in Rio de Janeiro, the Garuda Wisnu Kencana statue in Bali, Atomium in Brussels, tons of amazing cities in the Netherlands and all around Europe out of the ashes of WWII.\n\nAlso, the subway in North Korea is just as beautiful as in any other communist country but people are still starving and life expectancy is going down the drain.\n\nTucker has literally taken Russian at its face value. For someone who claims to be critical it's pathetic to draw his conclusions based on Moscow's downtown. How about Vladivostok or Kaliningrad? Or maybe the suburbs of the other major cities?\n\nA claim that the US, Europe or Korea are dying are just ridiculous compared to what Russian elites do to their own citizens (and the citizen of the territories they grab - Crimea, East Ukraine, parts of Georgia or Moldova...)."], ["@2018tundra", "Talk sorry you are kgb agent"], ["@Goldplusdiamonds", "He only chose to stay after Israeli PM called Putin,  and Putin promised not to kill Zelenskiy 😂😂, this was well reported in the media"], ["@nidalhanna9675", "Ur so bias lex it really shows in this interview"], ["@SlimJimJimmy2", "Sorry Lex not gonna give 3 minutes of if this one nevermind 3 hours"], ["@tubby_osrs", "When Tucker retires, this guys going straight off the grid"], ["@thomasmazzola4760", "Putin did a very lengthy, very detailed interview juxtaposition to Biden who can’t complete a sentence. Demoncats and their cult will destroy the western world"], ["@MD-rz7dn", "Provided platform for Russian propaganda."], ["@user-be5nz6fg1v", "About Navalny - idk why he was not in prison all this time, before he got there. He was a western agent for destabilizing our country. At the end he was useless and almost no one care about him here in Russia. It can be the reason for his death - this way he will be useful for the west one last time."], ["@user-vi1mz6ee3n", "Carlson is just great"], ["@raytaylor3077", "why was he allowed to go over there ?   surely he asked his masters if it was alright for him to do it .  Be very careful of this guy Carlson. He is a snake and a traitor.  Watch and see."], ["@ceeceeh", "I wish Lex would have followed up on some of Carlson's statements.  I usually learn so much from his guests.  Carlson came off as slightly goofy (oh that laugh!) and out of touch with the thinking of actual older people like me who HAVE lived through the many changes that have occurred since \"the greatest generation\" of WW2. The Civil Rights Movement, the feminist/sexual revolution and the Vietnam War for instance.  He kept saying he is allowed his opinions because he is so old at age 54. 54...really??  I raised a person of his generation.  The only change they made was enthusiastic adoption of the drug culture inherited by them from the hippies of the 1960s. For claiming to love America so much, this was a very anti-American interview, but maybe he was really just doing a little campaigning for Trump against the Biden administration.  I appreciate that Lex allows his guest to speak freely.  I like his interviewing style for that very reason, but I would like to have had him make Carlson just expand more on certain subjects. His explanation of why he wrote in an email that he hated Trump made no sense at all.  And his treatment of fellow Republican Nikki Haley was downright mean-spirited, also a Trump campaign talking point. Why Putin allowed him to do the interview was quite evident. Putin knew who he was dealing with.  Carlson's knowledge of Russian and Ukrainian history was  negligible and Putin's history lesson left him speechless.  It appeared the only thing he wanted to get out of the interview was the big news event he would score if he could get Putin to allow him to take home the American journalist Russia is holding.  That was 3 hours wasted that I will never get back."], ["@henrytears481", "AMEN 🙏"], ["@MrEmafon4", "Amazing. Comrade Tucker seems to be a ever more present reality. He made several leftist cornerstone talking points, and these were made more valuable by the context of his life as a hardcore conservative."], ["@stevep4358", "Watch Larry Johnson  ex CIA anaylst and scott ritter  ex US marine and  weapons inspector. ..on the true  Nevalny .. C. I. A. And MI6 asset ..dont beleive  me.  ,..research  yourself find the truth"], ["@nexsusfive2042", "So Tucker is saying the bullies shold win, because they can make more bombs? He also says that Russia is on a war footing. So based on what he says, what does peace mean. We all learn Russian and Chinese? Siery, but i tried to get something out of this interview, but it was all about a small privileged person who is really an empty vessel. That is the most important thing i learnt about Tucker, he is toxic and shallow. No real insights from Tucker. The woman who cleans my office toilet has better ideas."], ["@natural91LC", "1:50:00 you don't create a cult of personality unless you're politically insecure ... does he realize what he just said? An orange cheeto comes to mind."], ["@vukans595", "Can you call an opposition leader a person that have 4% of support, who's funded by CIA to cause chaos and carry out a colored revolution!?"], ["@257rani", "❤Thanks Lex,❤"], ["@samiam6962", "Tucker is a play actor... Hes a pesona imstead of a person."], ["@scottbutkowski5803", "Fantastic show, Thank you both so much. There was an immense amount of honesty to it. Alot of it was very hard to hear. The truth always is. Tucker, Did you ever think it would get this bad? I mean, How could that be possible!?\nThis is the United States of America! Thanks,Lex. Tucker, Please be safe. Have a good day, Gentlemen."], ["@AB-vt9xr", "And have someone that in court has admitted that he lies and he plays a character. Lol wisdom?🤔😂"], ["@janessaraeann5371", "Do the interview with Putin, Lex!!"], ["@chronicillz1879", "if this is a lex friedman podcast then why is he in tucker's house, so then, will there be the same exact video on the tucker carlson channel?"], ["@gregbors8364", "Should have pushed him harder on how he “knows” the 2020 was “rigged.” “Because mail-in ballots” was a non-answer. But I do realize that making him explain his logic (if any) in coming to that conclusion may have put him on the defensive and tanked the rest of the interview."], ["@AB-vt9xr", "Your disclaimer is so egocentric and clueless why people complain. You somehow turned it into they like drama."], ["@oniiJitsu", "Phenomenal interview. Can’t cut the tuck"], ["@JesusChristISTHEONETRUEGOD", "Tolstoy WAS NOT PRODUCED BY TODAYS MOSCOW CULTURE 😂 Tucker seems to be giving a lot of word salad mixed with some fair points."], ["@vikingbynature777", "About time you bring a real man on your show"], ["@nellymoo635", "Tucker is so right about central planning. Capitalism has changed since globalization. We're are told about the directive and have to eat what we've been served. Yes, Wikipedia is a joke."], ["@AB-vt9xr", "If you’re willing to talk to everyone you have to be consistent and push back! You let people say things unchecked! The fcc should start getting involved with YouTubers! Or allow them to be sued easier for never having disclaimers! This doesn’t share wisdom. It shares ideology at the expense of our country! Pussy!"], ["@serhiidrashpul8172", "it was childish??? massacring the civilians, bombing the kind's shelter, and ethnic cleansing is just \"childish\"?"], ["@martinair329", "Nice table, Tucker!"], ["@user-jh7du4if1i", "Islam is the truth, Tucker! And you should have said no to genocide. Free Palestine!"], ["@LaidbakZak", "If people try and tell you that you shouldn’t talk to someone because of their political views, then that’s usually a good sign that person is making sense"], ["@alexanderwestphal9777", "This is the fucking filter. Putin  -> Tucker  -> lex  -> ?  -> joe rogan.\n\nLOL as i was typing  at 27 :30  when Asked if he was afraid to \"speak out\" while in russia? Tucker says \"How honest do you want me to be\"?  \n\nyou would say \"how blunt should i be?\"\n\r\n\r\n\nevery word is lies"], ["@amcmillion3", "“Power is dangerous. It corrupts the best and attracts the worst. Power is only given to those who are prepared to lower themselves to pick it up.”\n- Ragnar Lothbrok"], ["@r.bond.006.9", "Tucker said he's a Soviet history buff? What is his version of Poland 1939 and the  Molotov–Ribbentrop Pact? Because Putin's version was pretty delusional..."], ["@redo3138", "57:42 I am here and listening to TC is like consuming a really disgusting meal. \nTC loves clean, safe and beautiful. Ok. Got it."], ["@samurajudge", "YOU DONT NEED TO SEND NAKED PICTURES OF YOURSELF.  THE SAME FEDERAL AGENCIES WILL TRAFFICK YOU THEMSELVES ON LINE TO DISCREDIT YOU."], ["@IAMACollectivist", "I unsubbed why does this garbage keep coming on my feed?"], ["@BG-xx2cx", "Путин безумен и аргумент,что невозможно захватить город с населением 3 миллиона человек   малым количеством войск это только подтверждает.Русская пропаганда так часто говорила о невозможности Украины сопротивляться,что сама в это поверила.Безумие требовать оставить России полностью территории Запорожской и Херсонской областей,хотя они смогли захватить только часть этих территорий.Город Херсон был оставлен Россией(\"Херсон русский город,мы здесь навсегда\"😂),а город Запорожье никогда не был под оккупацией."], ["@uncle_tao", "Nazism is a state of mind. you think germany started as a nazi movement?? it BECAME a popular movement through power and government.  its an ISM. we can split hairs"], ["@ih_yt", "53:00 There is a monopoly as Google in russia and it's called Yandex that handles almost 100% of searches, taxi rides, food delivery"], ["@orafaelrosa7", "Tucker’s laugh is very weird 😂"], ["@sta1ler", "Можно сделать интервью с типом слева про интервью с Такером Карлслоном? ПЖПЖПЖПЖ"], ["@radinelle", "I totally agree with you Lex. I admire your open mind and your kindness."], ["@BenefitOfTheDoubtInquiry", "@9:16 nailed it."], ["@velmano", "Your a real fool Tucker Carlson. It's pretty clear in the overall view of your out come of the context. Very bad and shady professionalism. \n\nP.S. That comment that your not affraid to die is a real laugh....oh what a risk, hahahaha \nWell at least Lex let's you speak...."], ["@gtx332", "Tucker, 26 million Russians died fighting Germany. Id say that gives them the right to call nazis out"], ["@mntlblok", "I'm now wondering if Peter Zeihan has turned you down for an interview.  Zeihan's reaction to Carlson's Putin interview was bizarre and seemed far out of character for him. Any insights on that? \n\nI have no access to accurate information about how sanctions are affecting Russia. It's very hard believe that they are not causing significant problems."], ["@doriandd4648", "I didn’t think Putin was nervous at all :)."], ["@drew4324", "I am sure plenty of fact checking can be done across this video. The fact on the US dollar trade value declining due to the war at 19:50 when fact checked with the first 3 credible sources I could find is flatly incorrect. Trade transactions since 2012 have increased 1.4% to over 88 % FX transactions. The only real decline I have seen is held reserves of US dollars which has only declined 1% in the last decade which makes sense as other economies grow stronger.\n\n Not sure Why I felt the need to say this but its out there now. If any one has alternate data or I may not be understanding statistically something different he is referencing please help me understand."], ["@sta1ler", "2 гея на видео"], ["@StuffyLICIOUS-nv8fx", "Is Tucker pretending to be a moron?"], ["@Tupeloboyms", "I believe GOD is testing his people, but I'm starting to believe the by lifting and following this ungodly man had received their mark (666) already and have lost their souls and I don't think they realize it."], ["@marv1174", "Bro thinks USA has the Most freedom of speech 😂😂😂"], ["@MFSAMS", "The nazi part lost me. The azov battalion is/was a thing. An battalion of nazis. They go by 3rd seperate assault brigade since being reconstituted. Its why zelensky had such a hard time firing zaluzhnyi."], ["@rickshawwheelchair", "\"We HAD both\" i also grew up with no worries, mom told me \"go play outside.\" When i got a bike i took 25 miles to build friendships and a whole afternoon."], ["@Dave_167", "Turned the page on tucker, NOT WORTH MY TIME."], ["@user-be5nz6fg1v", "About Putin not being not fully satisfied with the intervew. I think there are two things in it. First - Tucker didn't ask some important questions. Second - Putin was ready to meet \"western jornalist\", but he met a decent human being insted."], ["@miks8", "Russian military-industrious power and capacity is greater than that of all of NATO combined? Bullshit! That patently absurd."], ["@carwink8124", "Thank you Lex!"], ["@danakweems", "Tucker needs to read Mien Compf. There are real Nazis in the US. So it stands to reason there would be in Ukraine."], ["@katarinahinsey3931", "Tucker completely misunderstood the history lesson from Putin. In order to understand today's non-American counties, all of which are much older civilizations, is necessary to delve into their deep histories, and gives a deeper understanding of their conflicts. In this case, the reason for going into Ukraine was to defend the Russians in Ukraine, who are there because for the majority of history, it has been their land."], ["@Community_Guideline_Violator", "Cool! Wonder how many of his followers who watched and bought it the interview with Pootin also have the capacity to sit down and watch this interview 🤨🤔"], ["@gtx332", "As popular as tucker is, he’s pretty dumb."], ["@bromisovalum8417", "2:06:00 I think the root of the problem here is that people have replaced religion with a religious faith in science and technology. It is killing our souls. Science is a method, not a faith. And it is limited in scope, meaning on a certain point they can only speculate about our origins and the nature of existance. Religion is important and provides the backbone of society, modern western man scoffs at what he doesn't understand, and has replaced it with a worship of \"progress\" through advance of technology. That's how we are at a point that we can't even say what's a man and a woman anymore. It can only end up in the worst nihilism and despotism, in a complete corruption of morals. Dostoevsky already showed this well in his work \"'The Possessed\", our generation would do well to take note."], ["@LATINCLASSICSByMiguelito", "Tucker Carlson is a bright bright person, he uses simple logic to opine. He loves freedom of speech and believes in it deeply. This must have value even more for any minority. \n\nFreedom of speech must be for all, and he defends the conservative side of the conversation. Very hard to do in this neo society. \n\nFantastic conversation"], ["@mim2990", "Hey, Kremlin bots, where are you?))))))"], ["@imgeometrydash", "First time listener here and amazed by you. Thank you for your understanding of the \"long conversation.\""], ["@BarringtonJames1940", "Tucker is so American.  A really decent, innocent, sincere guy."], ["@captnemo7620", "To have children in Russia is a benefit, not a huge expense. This influencer , I know for years, just found out.\nIs there ANY reason to HATE this people?\nhttps://www.youtube.com/watch?v=wsO8ivx-otY"], ["@bruceontheloose1708", "TUCKER IS A PROPAGANDA  SPEAKER  JUST LIKE JOSEPH GOEBELS OF THE NAIS. A TRAITOR TO AMERICA"], ["@darkdvr", "Yeah, disregard that Kiev, along with several other cities has one of their main streets renamed to \"Bandera st\", who is an absolute, confirmed, agreed upon (including US/CA/EU) legit, 100% nazi. For many reasons. Disregard that Ukraine has almost a DOZEN full batalions that wear swastikas, SS \"dead skull\" emblems (just to name a few - \"Azov\", \"Kraken\", etc.) Full, self-named, proud actual nazis with 1930-1940 german ideology. If they are not nazis, nobody is, yeah."], ["@IRLxKORA", "Tucker is the real deal. Protect this man at all costs."], ["@h1yaaaguy", "This is great. If you know nothing about history, are entirely unaware of the geopolitical climate, and have never seen more than five minutes of the thousands of hours of Tucker footage that exists, then this guy will seem like a real champion for fair and honest journalism😂😂😂"], ["@rezaom", "Two fake pseudo ” journalists “ meet for an interview, and that’s what you get in this podcast. Waste of time !."], ["@askold5611", "There was Nazism ( fascism) not only in Germany, but in Spain, Italy, etc. It takes a small cruel quantity of nazis to subdue a huge population"], ["@foyoulombe6519", "Well thanks. I see the bullshit."], ["@Fabian_GVI", "Lex Fridman is a Perfect Interviewer"], ["@salal98110", "Lex- you are the bomb!  Thank you so much for your fascinating, educational, thoughtful interviews 😊"], ["@slacquin", "leave those kids alone!"], ["@snozzberry1916", "What a stupid introduction, so far up your own butt Lex"], ["@Roberto32222", "Joe we are waiting ❤ love you bro"], ["@bradonchristian6017", "Lex is an establishment cuck. However, every now and then he invites someone on that makes me think their is hope for him."], ["@gtx332", "Funny that Tucker doesn’t believe in Nazis in Ukraine. When it’s documented, Ukraine supported Hitler and the current battalions, where their insignias and tattoos, not very well educated. Russians have the right to call people nazis"], ["@IvlievEugene", "После драки кулаками не машут. / It is too late to lock the stable door when the horse is stolen."], ["@karengiles1195", "Oh come on Lex! You can't tell that Biden is impaired! Lefties Lex is confirmed! How's the coolaide $$$"], ["@marandlen", "Thank you for this interview with “Mr. T”😉 now we have another level-headed, open-minded resource! 🙏🏻❤️🇺🇸"], ["@carrotking8893", "How does it feel being a russian asset lex? A traitor? You probably don't even read the comments because your aware people with a brain can see right threw your statements. You are trying not to piss off your handlers by not saying putin killed navalny, acting like the US sent an assassin to a remote facility to off him.. creating false narratives to confuse the already confusing world of politics."], ["@alina_travel5587", "Такер так и не понял мысль Путина. Нацизм на Украине есть, более того он возведен в ранг идеологии. Там улицы названы в честь пособников нацистов, они отмечают шествиями день рождения нацистов, установлено много памятников. Можно ходить с флагом со свастикой фашисткой и наказания не будет. К сожалению, это норма для современной Украины. Такеру нужно показать фото украинских танков с крестами"], ["@82mprosen", "He laughs like an insane person"], ["@ggfmua", "This interview proved how much Tucker  is ignorant. And people who listens to him and thinks \"oh, hmm, probably he's right\" - are as dumb as Tucker"], ["@user-nh9dd8lc2d", "Tucker, there are nazi in Ukraine - go to ask about Azon and similar gangs in ukraine.   do not do post interviews - you degrade yourself and the value of your work that was watched by 1.1 Bn people."], ["@miller566", "I said some comments on here on why Russia feels nato was expanding closer to the Russian border, and the comment was immediately erased. It's pretty scary that free speech is disappearing."], ["@MrRicardowill", "Lex Fridman is cool, calm, and collective in this interview. He is like a chess master playing against a novice,"], ["@katarinahinsey3931", "First of all, brilliant introduction, although it didn't need the swearing for authenticity. This new thing where they've convinced us people who swear are more intelligent is a trap set to make us sound like idiots."], ["@alikabalan2519", "Asking about Israel-Palestine as if Hamas attacks were the only thing that happened there. Ignoring the daily massacres and famine palestinian people are living in. Such a biased question from Lex who is clearly influenced by the zionist propaganda."], ["@darkdvr", "Excellent interview skills by Lex, but holy Jesus, is he naive and poorly informed on Ukraine. Unfortunate."], ["@Killajmj", "Lex Friedman is a industry plant with 0 charisma."], ["@irena8226", "Russia has no monopoly? That is because the few oligarchs own everything"], ["@RGMFchannel", "The sad thing about Tucket is that he tells some truth and then adds bullshit immediately"], ["@RobBritishCity555", "Tucker agreed to be interviewed by Lex for the same reason Putin agreed to be interviewed by Tucker - both knew they’d be handled with kid gloves. The result is two “controversial” interviews that aren’t very interesting."], ["@jurekorosec5355", "Gold standard."], ["@dmitriymidnight372", "1:29:50\nИменно поэтому украинские боевики используют немецкую символику времен третьего рейха"], ["@ty_nobody", "An answer to the question of why Americans are using drugs (opiates specifically, but all included) and not reproducing at a sustainable rate. \nIn my opinion, young people are using opiates because it makes you go away. Your not in reality anymore, your in your mothers womb. In your mother’s arm, being held and “sh sh shh” ‘d into complete calmness. \nWe grew up with the idea that if you work hard and do the right thing, the American dream is waiting for you. The American dream is dead and so hope is dead. \nOur medias constant lies and gaslighting and propaganda creates a lot of anxiety in young people, the world is Scary. This time period is unlike any time in our history, so no one can understand or truly empathize for what this generation, or few generations are going through. Life is hard. It’s scary. It’s extremely painful and it feels increasingly pointless. So when the question is… am I more afraid of dying from fentanyl, or am I more afraid of living day to day in the reality of the lower class in America. Being shit on day in and day out by our corrupt “leaders”. Is it worth the risk to be happy for a few hours, but maybe die… some think so. Life is so painful for a lot of younger people that it is worth the risk. \nI’ve been sober for 5 years. I have a great, skilled blue collar career.. and when go to buy a house, I’m paying twice what I would have a few years ago, and I have no say in that. I’m paying my taxes. Upholding my end of the deal… “they” are violating our social contract, and we the little people have absolutely no way to do anything about it. People are still in jail for protesting on Jan 6. We are helpless, and for a lot of people, being a slave to system that no longer works for us is a worse gamble than getting high and possibly dying. \nSorry for the ramble I just feel very strongly about this and alot of upper class people are truly confused as to why we do this. We’re lost, tired, morally confused.. we’re hurting and no one cares, so we medicate"], ["@brett2015", "No matter how you feel about Tucker, he’s the only one who’s ever come out of the corporate media sphere to ever admit that he has been wrong at times. No one out of that scum-ridden hole that is corporate media ever does that."], ["@idalbertoalvarez4493", "The issue with technology instead of just not driven by which government but based on profit margins. With that said what we're facing is technology advancing at such a fast rate that we cannot afford it and spend our entire lives attempting to acquire it. Do most cases manufacturers of Technology don't spend time improving their products they simply move on to another device or products that has just as many issues as the last."], ["@ih_yt", "35:00 why does he think he was spied on from the US, but it wasn't leaked from Russia when he arranged the interview, or some airline through which he bought the tickets, or someone at the hotel in Russia where they were planning to stay? There are so many opportunities to lose your privacy and some kind of secret, and he only says that his people are very reliable and the intelligence services just hacked his signal."], ["@DaveHawthorne-lk9mz", "Wake up Lex! Most young Ukes left for Europe. Get real."], ["@tylermulder8005", "1:25:49 zelensky is a crook not a hero"], ["@moristar", "Wow, the point about Boris Johnson's name that makes him unable to call Tucker a Russia simp is just... wow... holy... that devalues Tucker rationality in my eyes like -80%. And he says he doesn't bring emotions... Bitter about FOX, bitter about Stewart, bitter about life is more complicated than he thought in his younger years..."], ["@SmallWetIsland", "I like Lex but allowing Tucker to spout what amounts to Russian propaganda without much pushback helps cement a post-truth world. Compare Tucker's supine agreement with Putin's motivation for attacking Ukraine to Fiona Hill's. Tucker:-  \"Putin attacked Ukraine because he feared that NATO, the West, the United States and the Biden administration will preemptively attack Russia.” Putting aside the fact that Putin's war on Ukraine started in 2014. Here is Fiona Hill. \"Vladimir Putin is determined to shape the future to look like his version of the past. Russia’s president invaded Ukraine not because he felt threatened by NATO expansion or by Western “provocations.” He ordered his “special military operation” because he believes that it is Russia’s divine right to rule Ukraine, to wipe out the country’s national identity, and to integrate its people into a Greater Russia.\nHe laid out this mission in a 5,000-word treatise, published in July 2021, entitled, “On the Historical Unity of Russians and Ukrainians.”"], ["@latifhasani4744", "Hey wait a second is this tucker of foe can’t believe it he is talking sense"], ["@marshalltodd2241", "First of all Russia never intended to invade Kiev, a city of over 3 million people, the Russian’s only placed about 50 thousand troops there, you can’t invade a city with that population with that number of troops, just read a little of history, Stalingrad with less than a million people, over 2 million German, Italian , Hungarian, Croatian, & Romanian troops could not take it. So to think Russia was going to invade Kiev with 50 thousand troops is ridiculous.also understand the Russian state has not declared War on Ukraine, only SMO, special military operation, if they declare war Kiev’s government would be reduced to rubble, no government buildings, no banking system, no communication systems, and not by invasion, I suspect mostly by hypersonic missiles."], ["@nevemartins", "1:43:00 \"follow the money\""], ["@christotaku", "YES. Watching..."], ["@jeromehaymaker5071", "Tucker never confronts Putin with denial of truth to the Russian public. Ukraine has the right to be safe from invasion from anyone."], ["@massdupp", "Woke people/govt.:Dont talk to tucker hes not on our side anymore.\nSo dumb ..we need people like tucker..i pray he stays safe"], ["@user-vn2ol5zd1r", "Oh boy, what a crashing bore. I hadn't listened to this guy much before and only did because of Lex. I lasted about an hour and that was as much as I could take. Clearly not an intellect and actually not that intelligent which makes him a major departure from the usual guest on the program. He is, however, super confident and knows how to keep talking. What it says about a certain segment of US society is scary. At least he knows himself... a dick and a sexist. That's all we need to know.\n BTW Lex you're opening statement tells us all we need to know about you. Please keep up the good work."], ["@yuyaku1270", "Is it.. AI edited? Or did Curlson break? 😅"], ["@sniper1444", "I have a hard time believing that Putin does not speak english.... and as I listen further to the podcast I heard he does speak English LOL"], ["@mixamixa5790", "1:30:36 а как же то что у этих тварей даже приветствия как у Гитлеровских нацистов, татуировки такие же и идеи?"], ["@jimflagg4009", "I can not believe Tucker said that. So Tucker honestly believes this stuff."], ["@Diabolo3999", "Friedman will defend Lebovitz aka Jon Stewart. Same kosher tribe."], ["@user-kk4ey4fs1m", "Так, ну придется посмотреть с Яндекс переводчиком)). Послушаем, что он здесь рассказал"], ["@ai-dubb1355", "A different color background for the intro wouldn't kill you. You look like a floating head with a black suit on a black background."], ["@HomeAtLast501", "When Tucker was explaining how Democracy works, I saw reflected on his Perrier bottle the image of Lex furiously taking notes."], ["@BGStudiosTV", "Pump the breaks Lex. Think about it like this. Zielinski was paid to stay. This whole operation/war is part of an inevitable action from a country that tried to avoid a war. Yes Russia did some bad things in history but so did the US, China, Japan, they all do bad things. But the media, which is controlled by the government, tells you so you believe what they say is true. We know the media lies at the benefit of the government and their agenda. Why are you ignoring the idea that Zielinski isn’t just a pawn and he is in fact in on this whole thing. He was an ACTOR before this. A nobody. Now he’s a leader of a country? No. He was the right fit/personality for the job. He’s a manager, just like the president of the United States, appointed to do the bidding of the global powers and super elite. Come on man"], ["@newweaponsdc", "John Stewart is a government-funded mouthpiece to spread regime propaganda. His views are the same views as the government, the same views as The View, and the same views of every idiot who is out there claiming to be a \"progressive\" or to be \"speaking truth to power.\""], ["@sciezkapolnadroga", "Very good interview kudos for Lex, but it just shows how ignorant people in America can be. If someone like Tucker, who's \"so informed\" was so impresed by Moscow and Russia, and drew this conclusions..  HE is saying that America has stupid politics... that does not look good for humankind"], ["@rickshawwheelchair", "Jon stewart is not his real name. Tucker Carlson is his real name. true value"], ["@mmmu9638", "Lex is right. We should listen and talk to the Russians invading our country to understand their reasons for killing us before judging them too harshly. Love is always the answer and beauty will save the world."], ["@mishanjad2383", "1:55:53 Bullshit!!!!!!!!!! It’s Russian propaganda. You can freely speaks Russian. Only media and government are strict to use Ukrainian. Half of our army speaks Russia. My GOD HOW STUPID YOU ALL ARE!!!"], ["@ragnardanneskjold7259", "Who gains from killing Navalny? \n\nCertainly not Putin. In fact, the only thing such an act accomplishes is to reinforce the image of Putin as a bloodthirsty monster, which the west has worked very hard to substantiate."], ["@Astrodicted", "Something felt so off with Lex. Passive aggressive bootlicking. His Ukr sugarcoating was cringe for many reasons. I guess he's happy to play with big boys now"], ["@gryhvidsten1450", "Technology that have made people life easier, is insulin pumps with cgm 👍"], ["@ErockHen", "People arent corrupt, governments are corrupt"], ["@thespartan8476", "I love how Tucker Carlson thinks Americans have more freedom and the phones are been closely monitored by the US government. \r\nAnd they have to switch phones getting new phones often and spend a thousand dollars with a freaking Apple Corporation. That's American Capitalism. And pay taxes. \r\nAnd they claim America is better than Russia or China. The truth about Americans is like some cheap joke.😆😅🤣😂"], ["@GoProChicken", "🍸"], ["@TheShapeShifter20", "it's not so much that people don't want to see tucker get interviews or speak with reporters - it's that he's inauthentic and spent his time at fox sowing lies and hatred. he would go on air and praise trump while behind close doors talk about how much of a bumbling idiot he was (is) and how the election was not stolen. how can you take someone like that seriously? how can you believe anything they say? why should he be platformed to spew the same lies he was being paid to spew at fox? it just feels pointless and i feel like that's where people draw the line."], ["@mushin0247", "Criticizing people for asking questions ... that where our civilisation has fallen ."], ["@stefanpopescu9664", "So Russia is making more shells than EU(or NATO) as if EU/NATO are in a direct war at the moment ... and Viktor Orban is a very smart and wise guy (sad that all EU leaders and most of Hungarian people) think otherwise ... \nand this from the first 15 min of video ..."], ["@timmynguyen8876", "Two nuclear hydrogen bombs dropped in Japan,  where is third nuclear hydrogen bomb ???"], ["@blastradiu5", "Awesome!"], ["@artursalksnis140", "Whay a joke..."], ["@000EatMan000", "Tucker \"Russia Just Wants to Avoid a War\" Carlson.\n\nThis man is an absolute clown desperate to fill his hollow, rich kid life with attention."], ["@JorgeRamos-xw6dy", "I don't know if Tucker is smart and perhaps he is but he truly behaves like an utter idiot although it is probably for self serving reasons.  Either way he sounds like a traitor."], ["@Blackcatwar", "Why did Putin allow Finland to join NATO? and didn't attack her? Tucker, have you thought about this? you are so stupid to understand that Putin is using the NATO interpretation to avert his eyes from the fact that he wants to get the territory of Ukraine and that’s all"], ["@garydavidson6917", "traitor!"], ["@mendicant1981", "Great opener Lex."], ["@MasterBlaster3545", "What these two don’t understand is what does freedom of speech really get? \nLook at the West now and how that freedom of speech has led us. \nThe left has got in and we are worse than Russia now. \nYou can say something online and be locked up by the crooked left judiciary.\nA woman can stand quietly and pray inside her own head and be pulled off the street, when another culture can walk down our streets and call for the eradication of whites and not be touched. \nSome freedoms."], ["@Marcus_MG42", "Lex will never interview Vivek Ramaswamy."], ["@danlindy9670", "There it is. He said it out loud: “So you don’t get confused by your own lies.” (time: 4:20)"], ["@divinelyshpongled", "Jesus Christ Tucker, the reason that people can live in Moscow in a clean environment is because the government cares about making a perfect city to be proud of for people to see and think that Russia is prosperous. China does exactly the same thing with cities like SHanghai, Beijing, Guangzhou... yet most of the rest of the country lives in poverty or at least absolutely couldn't be further from the types of places that YOU would like to live or anyone who lives in most cities in the US. They're able to make their big cities like this BECAUSE they are dictators that don't have human rights or even any real concept of it."], ["@random9username", "It’s crazy that we’re on the brink of the 3rd version of the “Great” one, all because a female Presidential candidate from 2016 didn’t want to admit that her emails were leaked by a now deceased DNC staffer and not “hacked by Russia Russia Russia” and “geniuses” like Lex still don’t seem to see that. I understand the millions of low IQ democrat voters not seeing it, but Lex knows Jiu Jitsu… he’s supposed to have some grasp of critical thinking, deception, and actions having consequences. Sad."], ["@mikewicker1944", "Carlson is a trader"], ["@drunkrtard", "He said he thought the election was rigged, and now it's obvious it was. Then he says at the time, he couldn't say it because there was no evidence.... as if there is now... \nHe's so FoS."], ["@tekboi1984", "Yeah I bet the feds found something really juicy/incriminating in his accounts seeing how he lost his job.."], ["@rickshawwheelchair", "Tucker for VP!!!!!"], ["@anthonyallen9135", "THIS was amazing.Thank you,both"], ["@howdydoodie", "NEXT INTERVIEW IS WITH PUTIN!! \n\nPlease world make this happen for LEX!!!"], ["@non-applicable", "Zelensky the hero of Kiev? The US has been running the show in Ukraine long before the war. Zelensky is just a mere puppet.\n\nUndeniable facts we do know: \n\n1.The CIA has had bases on Russia's border in Ukraine since 2014 and trained the Ukrainian secret service.  The story is they called the CIA and MI6 on 29 feb 2014. 4 days after Maidan...?\nSince then they have been in an intelligence collaboration with CIA, MI6, Dutch secret service and NATO. As reported by new york post in the last 2 weeks. \n2.Merkel told herself the Minsk treaty in 2014 was only to buy time to built an army. \n3. Stoltenberg himself said they were building the army in Ukraine since 2014. \n4. NATO has had an office in Ukraine since 2009.\n5. In 2008 NATO declared they wanted to include Georgie and Ukraine. Look what happened in Georgie.\nBut they did not expect the same in Ukraine?\n6. Ukraine has 40 million ppl. About 10 million are ethnics Russian.  10 million Ukrainians have fled? \nA country with then the population of the size of the Netherlands is going to win against Russia?\nFrom the start this war could never be won by the people of Ukraine themselves. Fact. \n7. The leaked Nuland-Pyatt call in 2014 where American officials discuss who to put in place of power in Ukraine beneficial to them.\n8. How about the 18.000 civilian deaths of ethnic Russians between 2014 -2021, also reported by Olivier Stone at the time. Due to bombing and shelling by west Ukraine. Compared to the 28.000 civilian death Ukraine is reporting now after 2 years full blown war? \n\nDoes that sounds like not provoking Russia?  Or does that sounds like a country who is preparing for war with Russia.\nAnd is that not the reason why Ukraine was able to ward off the first attack by a country that apparently wasn't prepared and thus serious about taking Ukraine? \nWhich we were told that had the intention to conquer back all former soviet countries and EU? It makes no sense at all.\n\nAnyone reading news, with a long term memory and a slight bit of critical thinking should come to the conclusion we are not being told the truth. I have no clue to their intentions.\nIt could be in the interest of us, the people of the west, or in the interest of just a few....\nUnfortunately I don't believe the first. The west is becoming more like our \"supposed\" enemy each passing day. \nA ruling oligarchy, democracy on just the surface, declining freedom of speech and steering to communism. Where the oligarchy owns all the state firms, devoid of any competition."], ["@TheS1ot", "Russia has multiple Software monopolies directly controlled by government spreading the centralised propaganda: Yandex and VK (stolen from Pavel Durov). Do your research, Tucker."], ["@Joeshcast", "@Lexfridman when can we get the Destiny X Tucker Carlson debate?"], ["@irenebarnabishvili", "These people are incapable of talking genuinely. That's why you got criticism."], ["@DeepThinkersClub", "The truth is, capitalism isn’t a sustainable model.  Most elites know this.  However, if the common people believe the illusion of capitalism as fed to them in propaganda, they will work harder.  So, a society where the illusion of capitalism or the “American Dream” is carefully orchestrated, and the people believe it’s what they are living under, then maximum work ethic will be applied.  The top dogs will benefit the best from this.  \n\nDo you want to live in an illusion of freedom?  Or do you want your live in reality?"], ["@rbolton13", "For somebody who says stupid alot, you'd have to be stupid to think anybody expect Putin is ultimately responsible for Navalny's death."], ["@johnathanknight", "To connect the dots. Putin's denazification term was to reduce the control of import and export Ukraine has on Russia."], ["@ikjb8561", "3h of common sense.."], ["@Timmho123", "as expected, no hard questions. consider yourself complicit, Lex. Shameful."], ["@Marvelcurd", "Im sincerely cannot make myself to continue watching, sadly I do not see no usefull information here, and in the same time Im baffled by amount of, let put it mildly, opinions not backed up by facts. Love other podcast though"], ["@raphipik", "I was not ready for Tucker Carlson’s laugh and I love it."], ["@ffakhoury", "Great interview ❤"], ["@camouflarney3268", "Really disapointed in this one.. Talking to someone this dishonest and with so many skeletons in his closet with this little pushback is really, really shitty."], ["@dextercool", "What a crude dumb low-level interview. Is Lex really that naive?"], ["@rossteazis9760", "Pretty disappointing that both Tucker and Lex dont know about the huge Nazi following in Ukraine They  pretty much headed the cuop with CIA assistance on Ukraine's previous government. The Azog battalion r pretty well known and have a huge following so it doesn't make sense that they both don't know what Putin is talking about with de nazification."], ["@derekcraig3617", "Oh great, you just had the Biggest Traitor in America. You recommend to subscribe to his nonsense? C'mon"], ["@janosaideron7371", "I can respect those principles. You got yourself a subscriber"], ["@BoEmery", "Interview Michael E. Jones."], ["@AdiVenete", "He could learn a thing or two from Lex about how to interview. I'm just saying."], ["@Ho55ua", "Such a snake."], ["@twosox3648", "Lex's reaction to everything proved Tucker's points better than Tucker ever could. It wasn't a good look for Lex, and I suspect all the pressure he addressed in his opening statement really got to him. Tucker couldn't say anything at all without Lex reacting with \"well you should have said Putin's a piece of shit\". My favorite reaction from Tucker was \"In the grocery store?!\" \n\nIf you don't have the spine to deal with trolls and haters, you shouldn't be an interviewer. I really like Lex Friedman, but this episode and his reaction to pressure showed why he'll never be a Tucker or a Rogan. He is pretty young however, so maybe he'll mature into it and learn the lessons. Great interview."], ["@roboatnick6178", "Not sure Carlson is still a conservative. He was interviewed by left-wing Jimmy Dore and the two were 99% in agreement. The conventional labels are losing meaning."], ["@jennieanderson2611", "I appreciate tuckers work. I'm appalled that there are people that want to murder him for shedding light on the whole picture and decent morals that many do not seem to care about anymore. American is going down a very dangerous and destructive path and it needs to change fast!"], ["@mnmillard", "Who are the ignorant sheep that tell you not to talk to certain people??? I bet I could point them out."], ["@pupples9720", "Tucker is a real guy...faults and all....he doesn't hide anything....\n\nVery liberating"], ["@scaringclaring5240", "Google and most software consumer technology has made things more convenient. It has NOT made us smarter or better people or made our lives better. People who were alive pre-internet in the First World or the upper classes of any part of the world, can surely attest."], ["@divinelyshpongled", "Argh Lex.... HOLD HIS FEET TO THE FIRE for gods sake.. why are you letting him spout so much absolute horseshit without calling him on it?? It's soooo hard to watch"], ["@halvehalf", "See more into the situation."], ["@Superlowrise", "Nice interview. Tucker is a man-child, like most right-winged political commentators like Ben Shapiro."], ["@globalprofits101", "Plot twist Lex is Putins son"], ["@theartofancientegyptianmet1747", "Next, Tucker should interview President Xi."], ["@erwin2912", "Putin's poodle .... a naive American pupil fell into the clutches of a cunning violent criminal"], ["@divinelyshpongled", "lol safety, cleanliness, beauty... you have got to be kidding me. How about human rights, access to food and water and shelter, and safety are obviously infinitely more important than how clean and beautiful a city is. Or how about, access to employment and quality of life? God Tucker is just full of soooo much shit covering up anything he says that actually has some truth"], ["@gdgrim", "Weak questions, barely pushed him on his bullshit like you did Kanye. 3 hours of a monologue from Tucker."], ["@AmandaMcKayJean", "The problem with the Tucker-Putin \"Interview\" is that it wasn't an interview. It was Putin monologing and Tucker acting like a fangirl."], ["@tuscantony", "Excellent three hours gentlemen,  thank you hoth so much for your time, patience and erudition."], ["@ilovehanoivietnam2521", "Awesome….brilliant !"], ["@seasidesue816", "Tucker keeps interrupting Lex.  It’s driving me crazy!  And I like them both."], ["@JanHore", "As a Norwegian, i can assure you that there is no free speech in Norway!! All the news channels a pushing out propaganda..."], ["@End0fst0ry", "Everyone who seeks power and money for the sake of power and money is damaged moraly. That's right, Tucker. No sane person needs to total control someone's life."], ["@samorostcz", "Thank you! It is good he talked to Putin. But what about Assange? Why there is no outrage about it while he is still in prison? Or Gonzalo Lira? Todays mainstream are just jurnos, puppets which push narrative and \"right opinions\", good PR and nothing more. Very sad. So thanks again for this. Vivek would be cool next choice for interview..."], ["@waen606", "Very eye opening Lex and a wonderful thing to see my own stupid biases,shown up.  I think I like Tuckers attitude a great deal ,however he does seem a little blinded by Mr T …my advice would be vote neither for trump or Biden …..it’s a choice you have when you don’t have a choice ."], ["@kekedong", "When someone say he is not nervous at all, you know what he is going to say next  is out of some kind of act"], ["@joshuam.9182", "The reason we put missiles on the border is due to the war-hungry/money-hungry jerks who make a lot of money every time a bomb is blown up. Nato is like how the Kings back in the day made packs. They used to marry their daughters and sons to each other's families. Now, they just trade money or permissions/deals to abuse and get away with it."], ["@justme-cr3xe", "The fruit of the farmer shows me, just me, who the farmer is."], ["@tryfryingmikejones", "Lex is such a stand for nothing self serving opportunist. perfect guy for the modern age lol."], ["@nikolovtod", "At best Lex is extremely weak interviewer with very, very low intelligence. More realistically...he just likes what Putin is doing."], ["@ShadeNinja2990", "He’s actually right about Jon Stewart tbh"], ["@JustAnotherJarhead", "2:24:00 I am floored at how Lex can be so checked out of reality, and still have 3.69 M subscribers.  There are several things he says where he is just off in left field, but this Doubting that Biden is senile, and that half the country doesn't think he is senile nor of his right mind, just reflects how clueless Lex is."], ["@_darquan", "Okay, I'm not sure anyone would read it, but ... Hey there! I'm a Russian and I live in Russia and here's some points I can't quite agree with Mr. Carlson here.\nSure, cleanliness, safety and beauty is fine. But Russia is not safe. The corruption ruined everything, the safety standards, the police, the food, medical services. Russia is not safe by any means. \nI lived in Norway, too. I speak Norwegian beside English. Mr. Carlson doesn't know what he's talking about. And dismissing that Norway is first on the freedom of speech is just it - ignoring the facts. There are a dozen of facts Mr.Carlson chooses to ignore, and some aren't very beneficial to his views. Is it freedom if you are being watched by your government for your opinions? Not because you are a threat to people, but just because you have to say? It's all a bit sad, you know. Anyway, this came already too long, I just felt like I had to say some of it. And thanks, Lex, for this interview."], ["@AmmarKhanSthlm", "Isn’t it generally known that there is a real neo Nazi phenomena in Ukraine and that’s what Putin was alluding to? I was a little disappointed you seem to be oblivious to this."], ["@user-no5mu1oj1f", "So Lex, please tell me what you learnt here? What did you learn of Putin? What did you learn of Carlson? What did you learn that made you give a platform to this man that would appear to be a main actor in the previous attempt to destroy the greatest democracy on Earth & again looks to be playing some strange, but no doubt major, part in Trump's plans to usurp democracy & to this time become a tyrannical dictator (as openly expressed by Trump himself).\n\nI don't understand Lex...what made it worthwhile for you to sit there idly & barely so much as speak yet along challenge the numerous inaccuracies claimed by Carlson. You spoke nothing to his lies. Why?"], ["@jackclingenpeel5020", "What a silly man.?"], ["@charliebags69", "“I like ballsack” - Tucker Carlson"], ["@shegally", "I appreciated that Putin got 2 hours to provide context for his decisions and mindset in the interview w Tucker.  So important to allow for context and respectfully allow people to form their own opinions."], ["@pi2glorf", "I think this Mr is really looking at the point from lens of tourist the same way treated like when you go to north korea, they wouldn't show you famine and ppl high on amphetamins (in korea, its cheaper than food..) .. also you didnt live at all in country under the russian/soviet overview.. he would say different stuff.. not seeing ugly parts of the main city doesn't mean the rest like 40 % of ppl of that country doesn't have ceramic toilet.. they are shitting in a wooden tois outside of houses.. so cmon.. get real.. russians are not illuminated/mindful populace.. they are only nation who believed their nationalistic story about how special they are.. other nations hads it same, but they realized it was just romantisized story about their greatness.. jeez.."], ["@dabichotv", "You think it’s the talking to people with opposing views that makes you brave or different from everyone else? No. It’s holding them accountable for what they have said and done, and probing their answers- hold truth to power. If you say you don’t want to antagonize them in order for them to ramble incessantly without any pushback for 3 hours then it might as well be a monologue."], ["@sgtthicc", "Feels weird youre defending someone who said \"Polish people deserved WW2\" Very odd."], ["@kanegallagher9533", "Lex- “if you completely supplicated yourself to the msm and combined two of your segments, to make sure you portrayed the subject matter at hand, in the way in which they would like- now that would’ve been “Bad ass”.” 👌yea…… I.e. never make any observations about Putin or Russia without including a negative criticism. I know this guy, lex,  sees himself as really enlightened, but does he realize he’s carrying water for the people that have lied to the public for years? TC is right, doesn’t matter what he says, all in bounds. That’s America. And there is one differing opinion in the media, Tucker. But Alex is working hard to rectify that and make sure everyone repeats the same lines. Even if TC is completely wrong, there is value in having a differing view be represented in the argument."], ["@JamesFAFOCreel", "If we are being spied on then how are we a free country? We are not!"], ["@robertanderson866", "Tucker has become unhinged...he called Ukraine repressing religion when the government raided the Russian Orthodox Church for spreading pro Russian propaganda, he praised the Tates and acted like he didn't know that the lover boy method of human trafficking was human trafficking, and now he lifts up and praises Putin who is slaughtering Russians and Ukrainians..."], ["@toribern816", "This was a really good listen. I recommend. 🤍"], ["@Zephyrus-zj4kn", "Tucker Carlson is a propagandist."], ["@crimsonchin2280", "wow he really couldnt resist doing a klaus schwab impression at the end, how thoughtful and enlightening"], ["@anotherday8106", "Tucker is obviously delusional in his dysfunctional opinion."], ["@StingerByte", "Good economic cooperation between Europe and Russia would guarantee a very strong Europe and, above all, Germany. This is precisely what is to be prevented.... It would be bad for the USA, it would shrink Uncle Sam's delicate weapon...  ;-)\n\n\"[...] for the United States the primordial fear is German technology and German capital, Russian natural resources and Russian manpower; as the only combination that has for centuries scared the hell of the United States. \nSo how does this play out? Well the US has already put its cards on the table: It is the lion from the Baltics to the Black Sea. For the Russians their cards have always been on the table they must have at least a neutral Ukraine not a pro-western Ukraine [...]\"\n\n_George Friedman, 2015, \"Europe: Destined for Conflict?\"_"], ["@momchilalakushev9222", "Hearing what Lex Fridman said at 1:25:30 really makes me loose hope for the western society. Grown men, who interviewed so many intellectuals of our time to be so childishly, moronically naive...There really is no hope..."], ["@dmitryberman7334", "Tucker should take a trip to Russia outside of Moscow to open his eyes and understand what life in Russia is truly like and what Russian people who live in those cities experience life like. It’s totally different from what He left with perceiving🥲"], ["@kodiekulp", "Why don't you talk about his family upbringing ?\nThis isn't a journalist, this is a propagandist. \nA person who helped spread white replacement theory, A fringe white nationalist belief into the public consciousness of america. That is not a journalist.\nLex will talk to anyone for the money."], ["@samuelspencer6016", "Tucker is on a tour to interview and be interviewed by tough people you have to respect him for doing that kind of work."], ["@JRead0691", "Lol, you don't even know what a tough question is..."], ["@schuler6267", "2:23:50 Lex: I think half of the country doesn't think he's senile. I think he just has difficulty speaking. Like a gradual degradation, just getting old. Cognitive ability is degrading...\r\n\r\n\r\n😂"], ["@martinstuvland8620", "I find it funny how Carlsen spins his answers to make himself out to be the well meaning, slightly naive, journalist that has the best intentions at heart. Part of how he presents himself is probably authentic. But I also think he is very much aware of how this presentation makes him come off. And that he can avoid answering questions in an incriminating way through this frame of presenting himself. Unless Lex asks him some actually confronting questions, I suspect he'll get off easy. I will say. I am only 16 minutes in. So who knows. But I'm not holding my hopes up based on those first 16 minutes."], ["@Armanst88", "Tucker is the perfect reference for Useful Idiots"], ["@dmitrynova", "I know now what i hate about Tucker - he PRETENDS to know the truth, he calls \"facts\" which are not facts at all, he says things he cannot prove but says them in a way as if they are proven. And he wraps that poison into a layer of properness. As if he was a good person. Which he is not. \nI think his interview with putin was a great thing, i truly do - because it's a clinical study. And that is a good thing. \nBut Tucker CONSTANTLY does one thing a journalist mustn't ever do - he says his own opinion. Which is always wrong unless he's saying what is simply common sense knowledge. Example - Russia is big, blablabla. Ok, USA is big and Vietnam is small - and?.. Or the x7 production blablabla - ok, at what cost? How long can RU sustain such a rate of production? What about having just about 200 fighter jets (which is an incredibly small number)? What about hightech, what about precision, what about quality?.. But most importantly - who's the source of this x7 munition production?! And what's THEIR source?? Because they're wrong... One idiot said one thing and the other idiot lifted it up and started yelling \"this is the holy truth!!!\"... That is what Tucker does and now i know why i hate him so much."], ["@samansiddiquie1902", "46:21 😒"], ["@richardjohansen2953", "Good Job Lex you proved that Tucker is in fact an idiot. Most of what he says is really tiersome to listen to because its more clear next  to you Lex that he really isnt the sharpest tool... Never listened to a dude who says he doesnt know anything about anything outside of Maine and still has so much to ramble about everything."], ["@burm_danil", "Navalny was definetely killed, no man dies in his 40-es by accident. Actually, Putin was almost ready to change Navalny for his friend that is in prison in Germany. But what I think, he just hates losing, and brinning his biggest emeny on the lose is a huge lose"], ["@Putinshellbound", "Traitor to America, freedom and democracy.  All this sorry excuse of a human deserves is the WALL !!"], ["@dmitryberman7334", "Tucker is absolutely right about the criteria for the leader qualifications. If you only use the same quality medications in his interview with Putin, then he would certainly realize that he is a horrible leader for Russia."], ["@amark350", "Tucker they are targeting you to make you look like a fool… “Interdimensional beings“ and crap like that. Trying to get you to talk about those things so you look like a fool. Don’t fall for it."], ["@daikyosenshi", "1:30:14 omg. Tucker. \n\nAzov. Tornado. Aidar.\n\nGoogle. Fucking go. Do your damn job.\n\nThere are literally articles upon articles about this in respectable newspapers. There are times and bbc documentaries about it. For fuck sake."], ["@bigjim268", "Wonderful interview. Just to clarify, cognitive impairment is not a part of normal aging and is always a pathologic process. Slower reaction times is expected with aging, but I think Tucker has the right idea regarding Biden's impairment"], ["@abubakrpasha5799", "I want to see Andrew Tate on your podcast"], ["@zikaperic2133", "@35:30 if you phone battery dries out quickly it means you have too much spy software 🤣🤣"], ["@matthewjoiner3472", "$1,800,000,000 for holiday shack under flight path wow what a real estate genius trump is how many planes were landing in that video\r\ntheres a man that engaged in a insurrection…. do you approve?\r\ntheres a man that rapes a woman and molest others... do you approve? $88mil and he wants give her morewhat if a man keeps secret sensitive files in unsecured ways.... do you approve? \r\nwhat if a man cooks the books and steals from the people... do you approve?  $463mil\r\nwhat if a man conspires to steal votes... do you approve? 4/19 plead guilty\r\nthese are just 5 undisputed question is this the type of person you will support at the sake of losing your own respect. \r\nhow much of your money are you prepared to give him last year he used $50000000 of your donations for his legal costs. you could always give him money for his appeals he now has a \"go fund me\" i am sure your pensions will strech a little further.\r\nthe gop leading contender for president has just annouced that in the event that a delinquent nato country gets invade buy russia he \"would encourage them to do whatever they like\" article 5 has only been used once and that was after the eleventh of september attack on usa. is this the true \"manchurin candidate\" via the kremlin\r\nof all the 6 bankruptcy he had the contractors lost the most money except one and that was stormy daniels\r\nCitizen drumpf seems to want to have it both ways with SCOTUS in that states should have the final decision over womens bodies in overturning roe v wade but when it comes to him as presidential candidate the federal courts should have the final say that he can be a candidate"], ["@mishin900", "This guy is so delusional,I feel sad for him."], ["@deafshark9932", "Correction, the most famous oppossition figure in Russia is the Communist Party. Navalny is a financial criminal to the average Russian."], ["@ntme333", "❤"], ["@andrewvanrensburg1983", "Great interview. As an interviewer all the intriguing qualities of looks, image, intelligence and a simmering restraint one imagines could explode if pushed. Tucker Carlson entertaining (apart from weird laugh) and agree with much of what he says apart from it all coming down to having children - ai, could have done without that damp squibb"], ["@kbs5150", "Commercial every 4 min . Un watchable"], ["@goodcitizen7615", "Tucker says he wants to protect are American freedom but his actions say something else. Him and Trump are communist sympathizers, far left ideology that lead to totalitarianism, political repression, restrictions of human rights, and cultural and artistic censorship. Womans birthright, defunding Ukraine, and the anti woke , burning books , censorship of black history , the lack of compassion for immigrants and voting against a solution, are all being implemented now by the far left Maga!"], ["@CollectorsAnonymous33", "ive been watching lex for awhile now. after that intro i finally subscribed good intro man i respect it al the way."], ["@authenticthexception", "2:02:15 the man's laughter is pure gold 😂"], ["@topknotsrule", "Thank you, Mr. Carlson , for helping to legitimize media by the people, for the people 🫡🫡🫡"], ["@modemmack", "Not sure about platforming a (half) man that shit talks America while coddling the Russian regime and Putin."], ["@filipeventura2729", "Jon Steward being called a \"plant\" is insane. Who supported the Afghani invasion?? Who supported military action - the same he now condemms cause it fits his narrative - it was Tucker!! If anybody protected the vile American geo political targets it was Tucker! But at the end of that only one of them fought to make sure that even though he did not agree with the war, the veterans who fought it deserved respect and care - It was Steward! \nDont forget that as he disrespects one of the most important figures in your political scene."], ["@gtx332", "Navalny was only popular as a US asset. On his own, wasn’t popular enough to be mayor of one city"], ["@julianciahaconsulting8663", "A great introduction by Mr Fridman - but an introduction that he should never have felt that he needed to make.  As a non american it is very depressing to see how dogmatic, intolerant, censorship inclined, xenophobic  - and yes anti democratic -  the Left in the USA have become. I was too young to experience the McCarthy-ism of the 1950s but today's Democrats with their insane media groomed pathological hatred of Russia surely are the McCarthy-ites of our time."], ["@stefanleithner6922", "I thought carlson was way worse, but he seems to actually just be a human, like everybody else."], ["@greggwilson492", "Tucker is a cool 54yo🎉"], ["@FireTheHoker", "At the height of his career Navalny had a 3% approval rating and this clown Lex calls him the most famous opposition leader in Russia ?"], ["@ArborJedi", "I love Tucker, but I’m not sure if Tucker ever visited New York City before Rudolph Giuliani took office. NYC was a dump. It is par for the course with Democrat leadership"], ["@michaelutech4786", "Trumps current defense is that he cannot be prosecuted because as a president he has the right to commit crimes.\n\nIf the documents case is fake because it's just about \"documents\", how was the email scandal of Hillary a real thing that because of Comey's timing almost certainly cost her the presidency?\n\nAmerica is no Democracy. It's a banana republic worse than anything you could find in the southern hemisphere. Please stop pretending..."], ["@used369", "IT'S WORSE !!!\nVictoria Nuland Ordered Zelensky to ASASSINATE Tucker in Moscow..."], ["@jebstuart2704", "Fridman is having a hard time remembering the talking points he was given that's why he is shutting his eyes and waving his hands so much trying to recall what he was told to say in response.  Or maybe he's going senile."], ["@thysonsacclaim", "Please don't watch this.\n\nI am constantly surprised by the depths of bullshit you plumb. I don't dislike you as a person, but I do find your schtick to be that of an insufferable fool who platforms morally ambiguous or detestable figures in the name of \"neutrality\". That's not neutrality. You are participating in the spread of harm.\n\nFurthermore, the sickly sweet idealistic philosophy of thinking if you can just get two people on opposite sides to talk, that magically peace and harmony will come out of it is not how things work, Lex, and you know it. Thus you are either incredibly privileged and thus blinded by that privilege, or as cynical a man as Tucker or Solovyov, because you know it's not true, but is an attractive idea.\n\nIn fact, I would rather believe it is honest, because if it's a schtick, the moral depravity and cynicism of it is unforgiveable. Thus I find the persona of professional sycophant that you have created for YouTube to be nauseating."], ["@nemohoes619", "Everyone falling for lex's fakeness. Be more sincere, you're full of yourself."], ["@nikolastojadinovic2534", "Lex you are so linear in your thinking, technology is not unstopable, nature is."], ["@short3358", "Who with any brains would not want the tough questions asked!?!"], ["@madeline5188", "Anyone who talks about the Israel-Hamas war without mentioning the 30K+ civilians who have died has no heart."], ["@EricSnydereasphotography", "38:10 What Tucker said......"], ["@benjamingladinathor686", "1:58:00 Why are people not having as much kids anymore? Cause life is getting too damn expensive. Housing has become ridiculous and that's not because of technology.. Why are cathedrals still the most beautiful buildings? Because they were not build for practicality and cheap brick is ugly. Not because of technology.."], ["@mholdenmatth", "He has a point. For the inconceivable amounts of money the government takes in from taxes, the public amenities should be some of, if not, the best in the world.\nBut they ain't.  In fact, far from it. 🤔"], ["@ahmedabdullah2147", "Interview is great , ads every 4 minutes is annoying as fuck"], ["@boreduser12", "The best person to interview Putin would be someone who speaks English and Russian. Ask questions in English and hear the answers in Russian. Let the translators translate for the audience as usual"], ["@rickshawwheelchair", "\"Anyone who doesn't hate war shouldn't have power\" \nNice"], ["@Lazy_berry", "An anti-establishment US journalist is not worried about Russia's relation with free speech. HOW ODD\nI wonder if russian journalists are worried about it 🤔"], ["@user-wk3ii2wv4k", "I myself personally stand with Tucker Carlson truth"], ["@Pete1987pl", "Lex , you re a great man and your podcasts bring actuall conversation.  Also, you dont need to explain yourself to anyone, expecialy to people that already made up their minds."], ["@je__.", "\"men do nothing until they have to, but once they have they will do anything\" boy! words.. feel like someone just slapped my face and ego 😂"], ["@rickshawwheelchair", "Thanks for repeating the fact that the biden admin (Blinken and Obama) sent Boris Johnson to stop peace talks that could have stopped the war in Ukraine."], ["@Sichko021", "\"One of the most successful capitalist systems in the world\" Why did the USA attack every other system in the world by overthrowing the government, colored by revolutions, etc. The USA did not allow any other system to be developed because it would threaten the USA system.\nWhy did it switch to a debt economy and replace the gold standard economy? When the loans of the countries that they took from the USA after WW2 for reconstruction began to be completed in the USA, the economy began to sink into the economy before WW2. That is why the USA started a war economy because it saw how much money could be made from war. We got a system of petrol dollars and the dollar as a means of trade, in other words, the whole world is a slave to the US economy, or better said, the USA is a parasite of the world. What is best seen now is the sanctions against Russia. The USA managed to turn Europe (the European Union) into a slave again. The EU imposed sanctions on Russia to its detriment, and after the sanctions were imposed, it began to destroy its industry and agriculture. Due to the high prices of energy products that the EU imports at three times the price from the USA, industry from the EU is moving to the USA. The whole EU is in recession. The USA was on the brink of recession and economic decline drastically before the war in Ukraine. That's why they first attacked the Chinese economy, first the companies, and then the Chinese 5G network, which is better than the USA 5G. Then the famous covid appeared, and from covid to the war in Ukraine. Let me remind you what happened before the announcement of the economic crisis in the USA in the late 90s and early 2000s. 9/11. WAR!"], ["@prashinrao4931", "It all seemed very real and serious until he starts laughing and twitching on himself like gollum. Very scary guy. He tries to be normal, tries very hard to please his audience but behind many his words and interpretations, I find very a dangerous man. And also an apologist and enabler of drump."], ["@idontknowname-rl8yb", "LEX.   LEX LEX IS A ZIONIST AGENT"], ["@gryhvidsten1450", "As a Norwegian I can say that you can’t say NATO blew up the pipeline on Norwegian television and not loose your job😅 Norway is not a free speech nation 😢"], ["@homerscornbread", "Tucker esteems the republic so much but also says its leader should care enough to act as a father. The problem with our republic is the citizens keep putting into that position those who will do their desire. What father pray tell Mr. Carlson governs his family according to the will of the children? \nHmm?"], ["@CLR1992", "The man who ate up Putin's propaganda and allowed it a platform, where it further morphed reality for people unable to analyse and evaluate comprehensively."], ["@JonnyMoto", "I'd be willing to bet those that disliked this video didn't even watch it. I'd also be willing to call them ignorant, egotistical and tyrannical"], ["@filipeventura2729", "Tucker really compared EU countries with Russia in terms of Freedom of Speech?? What a ridiculous line of thought rilled with intention! \nThe whole notion of - \" wanna go to the supermarket and not get killed\" - i live in Portugal one of the supposedly non free countries he mentions, go look up our crime rates! Europe has always been the safest region on earth since it was created. The \"left\" he fears so much insured that was the case, in fact it was with the rise of populists like Tucker defends (Hungary PM for example) that lead to the rise in hate crimes and gun violence, also led to some of the terrorist atacks.\nJon Steward being called a \"tool of the regime\" is insane and unscrupulous.  Who supported the Afghani invasion and the rest of the middle eastern destruction?? Who supported military action - the same he now condemms cause it fits his narrative - it was Tucker!! Who backed Wall Street?? \nIf anybody protected the vile American geo political targets it was Tucker! But at the end of that only one of them fought to make sure that even though he did not agree with the war, the veterans who fought it deserved respect and care - It was Steward! \nDont forget that as he disrespects one of the most important figures in your political scene."], ["@mucafit", "Lex, please read last week's New York Times column about the CIA and Ukraine and wake up,please."], ["@makoffee79", "Ok I just unsubscribed from my favorite channel.  Sorry Lex, but you are way better than this.  Shame on you for amplifying this kind of bigoted propagandist."], ["@kwatson917", "Trucker is a Russian propagandist and not a journalist as he thinks he is and who supports putin, a mass murderer.  What does he expect when he squeals that the inteligence is checking his phone: he is supporting a foreign hostile power.  Tired of Tucker's lying and BS."], ["@lgsutube", "Being new to the channel, I have only listened to two of your podcasts.  The first one was the Ben Shapiro Destiny one  I really liked that episode.  One thing I noticed in that was how much you let the guests talk, compared to you talking.  So listening to this one, I guess that explains the difference in the amount of time compared to you and Carlson.  I would have liked to see you push back more on some of the factual deviations that Carlson spouted with respect to the election being just one. There were others.  I did not have a high opinion of Carlson, and this interview did not change that any. To me, Carlson consistently did himself a disservice about his humility when he spoke about others being ignorant / stupid or dumb. In short the guy is basically full of you know what, and like I said above, nothing in this episode has changed my opinion about him at all.\nThanks for providing a mechanism to get to discover the \"real\" Carlson."], ["@nonotion3815", "yeah the small percentage of nazis in Ukraine isn’t the justification for war and they don’t have real power. except for the fact that nazi battalions are implemented into Ukrainian army, they have weapons, heavy artillery, support from local population and really threatened to kill Zelenskyy if he doesn’t do what they say. despite that yeah they don’t have real power and denazification is stupid 🤡"], ["@terrytucker7533", "Great dialog, please keep it coming! As you eluded to this very dialog could save the World. Relatively unimportant but curious why the UFC photo presented with Tucker and others doesn't include Joe Rogan? Is there an inside joke that Joe looks like Dana White?😂"], ["@LexBruckner", "We  do build monstrosities. look for nation cathedral - bucharest - still under construction"], ["@garytibo", "Lex...if you think about the people that believe in God and the one that say that they don't...THEY ARE ACTUALY THE SAME...THERE just believer."], ["@themustyburger9284", "Bipartisan hacks"], ["@classicjetsims", "The problem though with Carlson is that it's all a big grift. He doesn't believe most of the nonsense he says."], ["@themustyburger9284", "Bipartisan hacks 😂"], ["@SegnoongeS", "Cant believe someone critcised Lex for talking to Tucker, look at the views count. 1 day over 2 million seen this. Clearly everyone wants to see this. I love both gentlemen. Good bless freedom"], ["@cashkash1547", "Tucker knows American Democracy is a joke......yet he is talking all about A,erican freedom!"], ["@muhammadzulkarnaen4229", "Broad generalization here but isn't Republican the one that insists public transit is not worth the hassle to implement in the US like the rest of Western European countries? Even in the shottiest European city you probably can count on the public transit still working affordably. Anyway, I am coming because of Lex and I'm sorry but I stopped at the one-hour mark, I can't complete this.\n\nCarlson's view on European Infrastructure and public transit is just the typical American person who travels abroad and realizes how much of a dump the US actually is on that front. The problem is unlike the rest of the people who feel enlightened and become advocates for this I would bet my meager 2$ Tucker Carlson will just go to sleep and wake up the next day licking the boots of the corporations and political movements that are against it."], ["@robertmaune8557", "Google search takes you to curated knowledge, (which is far from being 'the world's knowledge'). Mr. Fridman's comment is naive or disingenuous.."], ["@daikyosenshi", "And also quick question to the people living in the country with the biggest amount of free speech:))\n\nHow come google decides on a whim and deletes youtube channels of ukranian people who oppose the current regime? Isn't it supposed to be protecting the freeedom of expression?  And yeah...not for nothing. Rumble is a thing."], ["@je__.", "dudeeee, what an awesome 3+ hours conversation... hate him or love him, you cant deny Tucker sincere passion and love for his country and humanity"], ["@crabofchaos7881", "Jesus Christ, this guy is gish gallop personified. I got a fuсking dоg, and this was a hit to my mental health (I went in thinking \"I'll figure it out\"). Responsibility is not for everyone, and I'd rather spend more time working. From his point of view, I should knock up some poor girl who'd rather go to college and get a decent job right now. Crazy, crazy advice for the young people, I'm amazed I made it through three hours of his nonsense, gives me hope I could visit my grandma and not die from cringe one day."], ["@garytibo", "Everyone believe that you have to do something or there a trick to it...BUT now you see LEX …Tucker got it."], ["@TheWillEckert", "Liked for intro"], ["@maximzhentichka350", "\"There is so little nazi in ukraine!\" In the time Azov battalion members just are smiling:)"], ["@ElmoRitter", "Holy shit this was eye opening. I didn't realize people like tucker are out there and it's pretty concerning. He tried to deny nazis existing in 2024. what the actual fuck. The way he's so enamored over moscow because it's clean is borderline insane. Some points were definitely worth discussing, but good lord this generation is SO entitled it's mind boggling"], ["@idontknowname-rl8yb", "@lex is a zionist agent ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"], ["@tadwitko8046", "What a jerk Carlson is. No depth, just slapstick. But to his credit he did say he was a dick."], ["@yuanduoli7647", "Well. it is good to hear the voice from other side. But I would disagree with you when you recommend subscribing/following a youtuber ignore other argements and instite on passing potential misleading information"], ["@irvingirving6275", "If you view Russia by looking at Moscow or St Petersburg your a ignorant moron."], ["@alexgoncalves7512", "I so agree with the tough questions monologue . That will be especially true for Tucker . Imagine this will be one of Lex's most popular videos because of how controversial Tucker is right now ."], ["@jeffreygrimm2361", "Just note which side the people who are telling you not to interview him. might ask yourself if they are on the right side of other issues"], ["@sperry9968", "Muslims in Russia is way different to Muslims that move to countries of not their origin- until they have numbers they will play the line- or as Muhammad would say-play the lie,taqiya"], ["@blahblah6497", "There is Power in Perspective...the more one opens themselves up and listens to as many different perspectives that they possibly can, the better and more clear the picture becomes and the better their chance of making the best and most beneficial choices or decisions they will have. \n\nEntertaining a different perspective is not the same as adopting it. And people should not be afraid of finding out that were wrong about something. For it is the only way to learn and grow and evolve as an individual"], ["@JestRLee", "\"The only reason any man would agree to relinquish even a modicum of his God given Rights to that of a governing body, is if the purpose of that government was to secure the Rights of every individual citizen.\"... Robert James Morgan"], ["@daikyosenshi", "59:35 You should be surprised. In fact Ukraine is constantly implying Russia's actively genociding it. It says it's at war. And yet Lex is talking about how great restaraunts are in Kiev. Don't you feel like there's something strange about it? And again. Why don't you guys pack your shit and come to sample eastern Ukraine quisine? Donetsk's got restaraunts too. Fucking hypocrites.\n\nAnd to Tucker specifically. Dude, I'm glad you found time to rack up those views by visiting Moscow. Hype. Style. Yes. But can you truly speak about russia if Moscow is the only place you visited? How come you skipped Belgorod for example? Belgorod is much more interesting storywise. There sure as hell isn't a beautiful underground railway system. But there are places that keep getting shelled by ukraine. Like you know. Places. Where there's no millitary targets whatsoever."], ["@cjparsons1000", "Absolutely love your opening statement, Lex. Good for you man, stick to your beliefs. Some will follow and some won’t, all good. Much love!"], ["@nicofit3656", "Nazis don't have power in Ukraine but can be used to destabilise."], ["@antoineroccamora", "“I know i’m a Dick” -Tucker Carlson"], ["@frodesonerud2789", "In Ukrain Neo nazism is verry  much mixed into their culture. They even have nazi criminals as national heroes raising statues of them even.."], ["@n1ckyh1ck9y", "God bless you lex"], ["@francisdelacruz6439", "If Ukraine falls then so does EU falls as well. Would peace in Gaza stop this War? Hmmm"], ["@seanla879", "Prefect intro"], ["@Flavius-Timasius", "So he is Nash slon?\nAlways was"], ["@andrii5555e7w", "Woooowwww. I loved it. Tucker Carlson did exactly what Putin did in his interview. Moan and complain. Stated some fucked up data and information. They care about their feelings and ego. Lex did okah. He didn't play Tucker's game, and Tuicker hated it😆😆😆 \nI am also shocked that US citizens listen to the people who are cheering for Putin and Russia. Trust me, you don't want to be even close to that level of corruption, poverty, and censorship. All that Tucker said about Moscov etd. is the scene from the \"Interview\" movie. People in most areas in Russia don't have running water"], ["@askold5611", "Listen to Bennett, former PM of Israel how Zelensky didn't even get out of the bunker he's hiding the first weeks of the war, until Bennet who flew to Moscow and obtained Putin's word of honor to not kill Zelensky. Every time Western leaders visit Kyiv, they obtained permission from Putin for their safety."], ["@gtx332", "You have a great show Lex, but the fact that you have to put this disclaimer before the interview shows what a sad state the western world is in"], ["@kenedwards7013", "The internet is a destructive creation to society."], ["@beatingusilli", "“NATO is an attack on US sovereignty.”"], ["@rickshawwheelchair", "Keep up the good work and longform conversations. Thank you for talking to everyone, and more so, listening to everyone."], ["@markwhelan6511", "One of the best interviews i have heard, thank u both"], ["@michaelutech4786", "\"The economic engine that keeps the country afloat\"\n\nDid you ever actually think about what or who really keeps the country afloat?\n\nOnce you peel off layer after layer of abstraction, management, accounting and governance, you will eventually end up looking at people carrying stuff around, digging holes, turning burgers, feeding, milking and slaughtering cows. There are machines making this more efficient and they need research, development and manufacturing. A lot of that is done by individuals before it transforms into corporate work flows.\n\nNone of these entities that you see buzzing about are what you call the economic engine. Your economic engine are the layers that we needed to remove to see what's actually happening."], ["@cabelas777", "People are saying you were too soft on Tucker? You held your own opinion the whole interview and a lot of the times it didn't line up with his."], ["@putinwillhanginthemiddleof4866", "What a M oR O N ‼️🤦🏻‍♂️"], ["@daikyosenshi", "58:15 Lex, sweetie. People like you make me sick. \"I've visited Ukraine\". Which part? You keep on blabbering about your freedoms, how come you never got to visit Donetsk? Lugansk? Gorlivka? Huh? What happened? Maybe go visit Mariupol? No? Is it because you don't want to go there as a free person? Or rather maybe you know that you're pretty much done if you dare do something like this?) Talk about censorship. Land of the free my ass."], ["@Zukunftsstark", "Talking to everybody is great! Thanks a lot for all these interesting interviews."], ["@andreasn1130", "\"If you have too much spyware on the phone it recks your battery\" 35:08 😂"], ["@ZinebFakir", "First time listening to Tucker talk, ever.Very disappointed, i somehow  expected him to be smarter. He has a very basic and reductionist analysis of things.\nAnyway, thank you Lex for inviting everyone to talk."], ["@krux02", "1:21:50 when tucker talks about sovereign countries. I would push and ask him how much sovereign countries should be. Should the USA be dismantled back into 50 sovereign countries?"], ["@julianciahaconsulting8663", "as a canadian i must state that i very much disliked Tucker Carlson for a number of years when i first became aware of him...but he has really undergone a transformation that one rarely sees in a well known media personality...his evolution has been fascinating to watch and now I consider him to be easily one of the best real journalists in the USA well ahead of the propagandists of the US Mainstream Media."], ["@tomdonahue4224", "Refreshing!  Glad to hear a perspective other than White Hats vs Black Hats regarding Ukraine.  Thank you Tucker for pointing out the dirt under the fingernails of US Intelligence Agencies.  I would also like to add that American needs to beware of Woke, Liberal politicians saber rattling for war with Russia.  Do you think for a second Pelosi, Schumer, Biden, Swallell  etc., are going to be sending their little pampered Social Justice Warriors to the Russian Front?  Nope, it will be you and your children, of Flyover Country that will be sent to fight their war to continue the Donbas Money Laundering Operation."], ["@IvanRakilovsky", "So he thought he might get arrested in the USA but he never considered for a second he might get arrested in Russia? 🤣  Oh well...\n\nWho lies more, Tucker or Putin? I guess the metric has to be lies per minute not total count..."], ["@LegendofNelda", "Will you talk to anybody? What about Nick Fuentes"], ["@zaq9339", "I like Lex and don't mind him talking to Carlson but his guest surely is opinionated and very self righteous for someone who at the same time claims to know so little about the nature of things. He's a useful idiot (or just plays dumb which would be worse) and this interview didn't really change my opinion. I don't like him any more than I did before. His existence is a net negative to society (in my opinion). \n\nI appreciate the idealism of the honest conversation approach but it's thumbs down for me for platforming this joke of a journalist who combines willful ignorance and moral posturing."], ["@crowcopper4369", "TC, when you say no graffiti and  clean its just you stereotyping cities in the west that are mostly multicultural. We all know what you think of multiculturalism........\" Making our country dirtier\" your words."]]