[["@charlesa5333", "Alexei Navalny: another victim of the covid vaccine."], ["@djgonpet", "Russian opposition isn't real opposition if they don't claim for weapons for Ukraine. Navalny was brave af. Rest in peace..."], ["@Kylepersonal", "He poisoned himself to make Putin look bad... LOL"], ["@Michelle-Williams-Melbournite", "So sad. My heart is broken Putin is a Cold blooded criminal. God Bless Your family & God Bless🙏 Ukrainian 🇺🇦 people. May Putin Be Alone in a dark alley."], ["@AZhooligansgaming", "what a brave man"], ["@koblongata", "We will fulfill your dream"], ["@VH-gw3qi", "Alexei Navalny you’ll be dearly missed, your courage will never be forgotten ! I feel very sad for your family, I’m so sorry for their loss 💕"], ["@mirkopopov7018", "Guys, i want to know cause i dont know, honestly im putin supporter but on this interview navalny sounds so innocent, why is he killed, any reasons behind it ?"], ["@weedy1718", "R.I.P 😢"], ["@theperfectdrugmakeup", "puppet from the west"], ["@ElenaMerkulova-wr8ov", "Слепили из того что было, убереги Россию от таких горе лидеров. Приведут к трагедии, что западу и надо."], ["@julesgrayson6222", "That ended well…"], ["@juliocean1331", "❤ RIP Alexei Navalny. Condolences to your Wife, Children, Mother, Family, Loves Ones and Supporters.❤🙏"], ["@ParkSeoHamStar", "Praying for ALEXEY NAVALNY. ✨🙏"], ["@romanarmendariz4351", "We are allowed to speak out agaisnt any form of hatred and abuse in the free world.\nHe's an example of courage and valenty against oppression. May God bless his family and his cause."], ["@OscarWarbrandt", "More Russians need to be like this guy."], ["@raynoorlepcha8444", "He was so brave man and standing for the truth, fought for truth and leave for the truth. Solute his braveness and sacrifices for the truth."], ["@willbygosh4887", "Prayers to Vladimir Kara- Murza that he will not suffer the same fate that Navalny did."], ["@arianeschiller5471", "Ein Held, er war ein tapferer, mutiger Mann /Mensch, ich bin sehr traurig"], ["@misterclean7570", "A True Patriot. Hats Off. RIP."], ["@servus2634", "He was a CIA and Mossad agent who got what he asked for. Why should I care about him when he tried to sow discontent within Russia and was given millions of dollars by the CIA to do so?"], ["@alexvidakovic", "It's more likely the work of western agents to push Navalny over the edge and make him even more vocal against Putin, which is exactly what's happening here."], ["@rjjacks9303", "Very handsome man."], ["@tothgabor7188", "Why do you people only pay for who you are afraid or attracted for? Expect when nobody tells you about that you had to pay, and told only after by checks."], ["@tothgabor7188", "It was not about drug addiction which is used as a scapegoat..."], ["@jordanvannortwick9426", "He has been martyred. He is now immortal."], ["@andreasinger555", "Malo ima tako velikih hrabrih ljudi, najveca vecina suti, pokorava se, samo da prezivi bez posljedica"], ["@e.d.3729", "we love you! godspeed!"], ["@Mike-01234", "He speaks great English terrible what happened to him."], ["@user-fu5xn6iu1s", "It’s very interesting when millions of people in the USA, Great Britain, Japan, Australia and Israel, who don’t even know who Putin is and who Navalny is, suddenly whined in unison - “Oh, what a bad Putin! Oh, what a good Navalny!”\nDon't they have other things to do?\nIs everything going well in their countries?"], ["@katjakittenland9689", "This man has earned his name to be in the history books, what a hero! Rest in peace, Aleksej...🙏"], ["@bowerbird7463", "Apparently  the US & UK, have the recipe for this drug, ever since strange ‘Russian poisonings’ started to hit the airwaves. Putin would not have allowed the trip to Germany, if his own govt was involved. It was prob self inflicted, just a little dose. Apparently very effective, in small doses anyway Navalny had long association with US, in his studies with US university & business 🤨"], ["@jimmyxmx", "The russian people have failed him and they failed to rise up and choose a better life for themselvs. What a great loss for the whole world, condoleances to his family."], ["@ForeverBennett", "He seems on the level to me. I'd trust him before I ever trusted Putin."], ["@sousannachtchian8511", "Գյոօբագյոռ եղավ, տարոսը նիքոլին"], ["@user-zt7kk3uo1u", "RIP ….. forever hero \n\n:   ("], ["@colski3333", "I lived in communist system. World has no clue how it really is. It’s insane."], ["@JustIdeas000", "Putin has elevated Navalny to hero status because he first persecuted and now has executed him."], ["@spoders92", "What an amazing man. RIP Navalny—you’re an inspiration to many around the world."], ["@Onecantundersrandit", "If yo need to discuss something and its a dangerous situation ensure your not  discussing it in that country and ensure your family are safe"], ["@zoezadeng", "You were a born leader and the world loves you for your courage"], ["@user-zy4nx9fd1r", "Tremendo espía de la CIA,😎"], ["@Qpidon", "Putin's time will come. No doubt."], ["@NikkiStixx86", "he should have stayed in Berlin"], ["@Blue_Lugia", "R.I.P Brave man!"], ["@KlMMl", "Navalny was brave and a gorgeous… man too.. those blue-grey eyes. I’ve never seen such eyes."], ["@avina3320", "🎭Patriots in 🔥🇷🇺🌎՝🥲…"], ["@lc4365", "Hero.  Condolences to his family and loved ones."], ["@NPC_YouTube", "he died as a martyr that putin feared he'd be."], ["@MrBernt1968", "Rest in peace❤"], ["@_Svetlaya", "Gonzalo Lira 🙌tortured in the dungeons of a Ukrainian prison. Where were you USA why didn't you release him?"], ["@droxklamzquis7113", "RIP sir❤"], ["@Darkest_Soul87", "Russia would be a completely different country if he was in charge. It would flourish and could build good relations with the west."], ["@sivakumarveeraiya8730", "❤️❤️❤️❤️"], ["@TheJimbo1791", "Actually I disagree with him about that it was a good choice that he went back to Russia. He could have helped us here in Europe during these horrible times."], ["@egonkl3in212", "Hero's never die!❤"], ["@mackiereyes7574", "Brave man. Lets hope his legacy inspires new protestors and fighters"], ["@phuabtsabchannel202", "Corrupted hearts are destined for hell to get back for whatever they had done on earth, what a fearful fate waiting for those evil people."], ["@orbeadone6757", "Have you seen the cockroach video? 🤔"], ["@oluwatobilobaayofe6303", "When you provided security for him in Germany out of fear of being assassinated or poisoned, then what is the rationale of allowing him to travel back to Russia?"], ["@zipporahvv", "5:00 He Knows😢"], ["@spurgeontwist7117", "I wonder why he went back Russia"], ["@simonrangel9522", "Very Brave Man!\nRest in Paradise 🏝️ 🙏….."], ["@ally8173", "Warum sind Sie zurück???  You've got a 2cond chance but you've missed it"], ["@toneshop", "he was indeed a fearless hero.  In a perfect world, he would have replaced Puitin.  I still cant believe that Trump actually compared himself to this great man."], ["@user-cp7ji5nu3s", "Edsa Revolution Remake but in Russia."], ["@Zulu369", "He had such a beautiful smile!   May his soul rest in a beautiful peace.\nPutin, God is patiently waiting for you."], ["@mamadytraore5797", "The fact tha he speak English is suspicious."], ["@gorandjukic5842", "Imagine if USA and UK were allowed to have more than 2 political parties! Why not? It's not allowed...Why??? It has been proven in the Balkans... When the rulers overdo it, the people destroy them... No hereditary privileges...gentlemen... Power to the people"], ["@geograficarka007", "Navaljni.... MI6"], ["@charmcshane3517", "Is it better to be dead and no longer be able to fight \"The EVIL\"? OR stay alive and fight \"The GOOD FIGHT\"? He was incredibly incredibly lucky to SURVIVE the poison. Shame, he didn't understand what the Universe was telling him; stay out of Russia 🙏😪."], ["@danicacosic909", "This fine man will judge Putin when they meet.\nThat is my opinion."], ["@Saber.X", "I feel bad for his Death, he lived a life in which he had virtually the world against him, and stayed true to his ideals"], ["@knuffelmaus7175", "so sad :("], ["@timothyhilton3408", "One day a human being will be the leader of Russia.  Til then….evil reigns.  RIP Alexi."], ["@rowexiao", "He is paid by  CIA, what about Gonzalo Lira"], ["@VJaninka", "I endlessly admire the strength, bravery, vitality, humor, passion of this man after everything he´s been through. I must say that I am quite surprised how much I feel touched now by his dead. He wasn´t my relative, my friend, I have never seen him personaly. But I feel something special when I see him talking, something in his eyes, in his voice what makes him special, extraordinary man although he surely wasn´t perfect man. I am terribly sorry for this loss, loss for his family but also loss for all of us who has the same or similar ideals he had. I hope that his loss wasn´t useless, that although Navalny with his uniqueness could hardly be replaced, someday there will be someone who will make it and we will win ideals represented by Navalny over the evil represented by Putin and others around him. All of us could take an example of this bravery beautiful man and try to use it in our ordinary life. Every bit counts."], ["@kindnesslove5482", "This guy will go down in history as one of Russias greatest men. And Putin will go down in history as one of Russias greatest rats."], ["@DEBNHEIRS2011", "You just need wipes to clean it though"], ["@bernie4268", "If We had half the guts of Alexey our world would be Vastly different."], ["@PatrickSiamol-zv1dd", "Putin the Russian President need be Arreste by USA Army  with the help of the of Israel Army, Great Britain Army and G7 nations and locked up in Jail because he is killing innocent people and a good Leader need to replace him and the war in Ukraine and Russia can stop."], ["@TheFilipinoChannelinU.S", "Navalny should be the president of Russia! He’s a great man with high moral dignity and honor and most importantly the love of his country and Russian people!"], ["@user-gw3gl9hz4w", "Либерасты как вам идея захоронения Навального в Брюсселе"], ["@harris8401", "Rest in Piece"], ["@ikaros2006", "I will never get why he returned to Russia after they tried to poison him"], ["@susanna8612", "His only mistake was to return to Russia. He thought the world wide publicity will protect him and he can just continue his campaign. \nBut Putin will eliminate everyone he dont like and in Russia he is above the law. True sociopath. It was pretty lonely fight for Navalnya and few of his partners abd supporters, rest of Russian  does nothing.\nAnd understandble they fear for their lives and thats why remain quiet."], ["@prafullachaulia5388", "Hail to hero Navalny."], ["@scathachmuirisc7149", "This report is full of inaccuracies.  Disappointed in you 60 minutes. I thought you were more serious journalists than this...\nSounds a bit like the US too.. corruption..."], ["@scathachmuirisc7149", "Yulia could have written a letter to Biden too for Stella Assange....'Free my husband...'"], ["@karthiksheshadri6600", "He was a man, taken for all in all, I shall not look upon his like again."], ["@cm9859", "He was so courageous. RIP 2024."], ["@user-ow3tv9gy7r", "A true hero wouldnt let foreign media in on anytging. Its his country, he should fight for his country in his own way. Reaching out to west and media is already a big red flag, because nothing is without strings attached. Change in government should be sparked from the inside, not the outside.  You have issues at home, you dont have other home in on it."], ["@user-ow3tv9gy7r", "The question is, why does the west care about him so much?"], ["@DD-lv4tb", "Daniel 2:44, Revelation 21:3-5"], ["@JENNIFERAOKECH", "Very sad, 😭 rest well Alexei Navalny. May your sacrifice not be in vain. God comfort your grieving family and friends"], ["@steveenczi8967", "Putin threatening nukes America discovered the nukes we could of ruled the world but we helped the world"], ["@steveenczi8967", "BRAVE,Strong rest in power"], ["@steveenczi8967", "Rest in POWER!!!!!!!!"], ["@anniehiggins3884", "Saw his daughter giving a Ted Talk and she is so like her brave father. What a fantastic family ❤"], ["@sadiqali41", "Very bravery and hope his family stay safe"], ["@lifesshorttt", "A true hero. The man. The Legend."], ["@jesus_is_life_love2932", "Angel you are Alive. God will raise you up on judgement day"], ["@rowenr2813", "such a tragic loss, it's hard to believe he is really gone, even though it seemed inevitable 💔  he truly made a mark and will live on in memory. hopefully there will be justice. it would have been better if he hadn't gone back to Russia when he did, he could have done more for his country from outside of it than imprisoned and suffering within it. even so, a fiercely brave soul. i'm sure most of us can never truly understand all he went through. RIP Alexei Navalny 💔☮️"], ["@marisa4883", "He was so brave😢"], ["@serenityshalom7387", "Hero same Jesus was crucified ❤"], ["@SkylerCleary", "Putin until 2035 smh 😞"], ["@mcgoldyn", "Willing tools are dangerous"], ["@instantparty8856", "Putins enamy but not a friend of Ukraine, so no great loss"], ["@godsdice473", "R.i.P."], ["@vinnybrig569", "Amazing Soul.."], ["@user-mk2ik5zn5w", "Who is this guy anyway, why do we need him?! We have a huge mountain of our own problems in the USA!!! My kids don't feel safe in the USA today!!! We have people being killed right on the streets, drug addicts walking the streets, millions of homeless people in the states, garbage, dirt on the streets......."], ["@rodicahelen", "I'm very sad ! he had a great courage 😥😢😥"], ["@deludedrussian", "Thank you. I would like to give you an interview."], ["@d-rzarkocubrinoski", "USA are war mongers."], ["@maxuser1221", "windows and poisons run democracy in russia"], ["@AliensMatrix", "Lesson number one don’t make mistakes, lesson number two don’t make enemies, lesson three don’t repeat the mistakes of others, lesson four follow the logics. Lesson five don’t put yourself in the hands of your enemies and if you do it, do not complain about the consequences."], ["@myrawest", "What a brave, strong man. Horrible horrible what they did to him. His wife is so brave too."], ["@lindavanrooyen2323", "Wow.  Why on earth would Putin ice Navalny Exactly when he was 'riding high' on a wave of, if not approval, mostly positive piqued interest from the west ?   Sounds like another inside job.  Maybe the same ones involved in Nordstrom?"], ["@vladlenafridman8085", "How can the west be silent about his death? how can we tolerate all this??"], ["@yukil7", "Putin is jealous of him as he is such a charismatic person. He is superior to Putin in every aspect, including appearance, wisdom, integrity, beautiful and loyal wife and children. So Putin killed him"], ["@robotube7361", "notice how he offers 0% evidence about his claims. if one is to be skeptical - that's it. You have to believe those pictures he showed you were really the yachts and houses of Putin."], ["@robotube7361", "This guy claimed falsely Putin had a villa. turns out that villa was somoene else's. \n\nWestoids are so fast to trust any BS when it comes to Putin. This guy lied once and made a career of that false YT video."], ["@ionutcampean", "another confirmation that trump is a Russian asset. god bless your soul, Alexey!"], ["@sacuki2151", "Unfortunately, he didn't survive 07:22"], ["@jan-martinulvag1953", "He was CIA."], ["@janem5900", "An amazingly courageous and lovely man who fought against a corrupt coward. A terrible loss for his family and Russia."], ["@vova47", "Navalny, schmavalny, what about Gonzalo Lira or Julian Assange? Planning a segment about them, 60 Minutes?........"], ["@donovanbeersingh6078", "Our countries needs men and women like the NAVALDYS FAMILY."], ["@helenheeney2284", "Gosh qhat a world  that this could happen Putin  pure evil but your day will come only a river goes on forever"], ["@GD-cr5um", "This guy was so brave and died by his words unlike our politicians.  The beauty of this man is hes always so cool, and laughing ...he knew he was going to die. Its so sad."], ["@GD-cr5um", "Putin is such a coward but i blame the Russian people who r not strong and united like Navalny"], ["@AnaZia-nn3ug", "He wasn’t any threat to Putin.   Putin has more than 80% approval in Russia.    He was not killed by his government, doesn’t make any sense."], ["@stuartbritton4811", "Old Trumpy is just as appaled as everyone else by Putin's madness. Dont forget that."], ["@chinysukainepyobytt4506", "NAVALNY was a CIA asset period if he loved west so much he should move to one of West Countries and leave Russia.😂😂😂😂"], ["@adhardino9781", "He come across as very charismatic, no wonder the timid Putin felt threatened by Nawalny..."], ["@hunterfalck235", "I'm glad he's gone. What exactly were his ideas on ruling Russia? he had none"], ["@dropoutandretireearly1781", "SURELY A MAN THAT IS THIS GOOD OF A MAN HE IS WITH JESUS AND GOD NOW."], ["@Lovilight", "Alexey 💔💔💔💔 I can’t stop crying. Such a noble man! Putin is bloody killer and should be in prison."], ["@juliepeterson6639", "I am just heartbroken. I’ve seen the documentaries, and loved to see his strength for his family. Wow, he died of natural causes at 47 years of age? I will pray for all of his loved ones. Just sick."], ["@harddgril546", "All world save you name elexei navalny"], ["@Alan97131", "I will make this simple: the less you fight for your freedom, the more your future generations will have to suffer from oppression."], ["@KolanceMeer", "Here's to you, Navalny brat\nRest forever here in our heart \nThe last and final moment is yours \nThe agony is your triumph"], ["@jermyjerm6562", "Truly courageous human being.  Rest in peace Navalny."], ["@tracyj2154", "Navalny, wherever you are resting right now, we here are thinking of you and your family. Your words and deeds have not been lost or forgotten. You are a brilliant star in the universe."], ["@kaseyainsworth8625", "True national hero - Putin is a little nothing grifter"], ["@henningandersen9027", "How could he go back to Russia after this?"], ["@user-lk7qt8mg5s", "Why he so many in jail what reason for?"], ["@bretts5571", "He never should have returned to Russia in 2021."], ["@livingfordying", "His death even more confirms that Putin is a murderer in a suit and a tie."], ["@Borakization", "RIP Sir. Thanks for your fight for what’s right for the world and more importantly Russia."], ["@maloudelosreyes661", "A hero who truly loved his people and his country.. He fought for their freedom and for peace.. He is now in heaven🙏 and will continue to watch over his beloved Russia.. his loving wife and children."], ["@niallp342", "SPOT THE LIAR \nIN THE ROOM...🤡... \nREMEMBER THE MINSK ACCORDS.!!"], ["@vivouk1514", "The bravery of this man is heroic which is something only we see in movies or find in history, Now his legacy remains for future 🙏😢"], ["@loulew07", "When  Robert Kennedy was killed in June of 1968 it ripped my heart out in the hope for something better for my country. Feb 16 , 2024 I can only think of how much worse it is for Russia to lose so much what if ? Small planet and we all have the same thing in common. 1 life to live. Sad when good people get cut down with so much more life to live and to give more than they take . Such is the life of Alexey Navalny , words of his death do no honor to such a a person with courage that he can give up that one life to go back to Russia . Hope Russians will rise up like those who shouted  I'M SPARTACUS , NO I'M SPARTACUS . Hope is death is not in vain ."], ["@mgariepy42", "Navalny will live in hearts around the world. Russians, with thousands of war dead, massive corruption in your government, RISE UP!"], ["@malinericson4065", "Puthler could break his body! But Puthler could NEVER break his SPIRIT or SOUL!!!😢💪🏼❤️ Aleksej was a truthful, sincere, righteous and very, very brave man. His fightingspirit was one of a kind!💪🏼🫶🏼 Dear Aleksej, now your are finaly free and Puthler can’t hurt you anymore.🕊️ Keep shining your light from heaven and watch over Yulia and your two precious children. May the memory of you be bright, loving and an inspiration for standing up against narcissistic dictators and powerhungry, deceiving bullies!// Love and light from Sweden 🙏🏼❤️🕊️🕯️🇸🇪"], ["@humanbeing5300", "I really didnt know much about this guy until his death.  I can see here that he is just a normal Russian guy -- no real threat -- in anything other than he had the balls to publicly denounce Putin and devote his life to influencing the Russian public."], ["@PisaPis-bc9up", "A statue of Navalny should be made in every capital in Europe. I donate 50 euros.\r\nСтатуя Навального должна быть поставлена ​​в каждой столице Европы.Я жертвую 50 евро."], ["@RVAN-rj4ec", "ALEXEI NEVALNY RIP. ❤❤❤❤"], ["@fergiemascha1685", "Путин боится цветов. его режим настолько силен, что он убивает всех своих соперников. Где это показывает истинную силу?"], ["@fergiemascha1685", "After his documentary „Nawalny“ everything is clear. He was poisoned and we Germans found out thanks to the fantastic work of our doctors. We also know now that Putin murdered him and is now afraid of people laying down flowers for alexej. Putin fights against his own people because  he’s paranoid and he needs to be stopped."], ["@JuanGutierrez-xp5jv", "HERO"], ["@MrBucitis", "Navalny is proof, that there is no democracy left in Russia...just Putin."], ["@tak_tak62", "So sad. I feel so bad for his wife. May she find peace."], ["@GA_ME", "MI6 agent\n\nYou cant recover from novichok btw,"], ["@masaacc-cr9uo", "True leader of Russia. Putin  didn't like russians loved Navalnyi more than him...."], ["@stellastella4597", "He was soo brave, strong and very intelligent politician."], ["@jennyferrios245", "Braveheart!😔"], ["@freedom2noisemedia", "👇🏼👇🏽\r\nEp. 198 Intro: Navalny’s Death - Everything You Need to Know - Viva & Barnes Sunday\r\n\r\nGonzalo Lira (1968–2024) RIP 💐💐\r\n\r\n-"], ["@avs_prasad", "So sad.... Like Julian Assange."], ["@paaljankov38", "Where did Navalny Get his million of dollar?"], ["@pmajudge", "R.I.P. TO MR. ALEXEY NAVALNY.      A Brave Man Indeed .   From, U.K. (2024)."], ["@sanagirlqueen", "Rip sir"], ["@sanagirlqueen", "Journalist bro wear pant"], ["@alimay967", "This didn’t age well"], ["@jillneves531", "Incredible courage 😮"], ["@girlnextdoor7", "Remarkable man. Such a loss for his family and for Russia as well. It‘s not every day somebody with his character and bravery comes along."], ["@lw6001", "Alexy Navalny is the Nelson Mandela of Russia. Putin is directly responsible."], ["@imochiexe5056", "RIP❤🙏"], ["@jah1poland", "Nawalny nie był demokratą! Był Wielkorusem, rosyjskim nacjonalistą, który byłby dla Zachodu \"wymarzonym\" następcą Putina. Przypomnę, że Zachód nawet Putina uważał swego czasu za demokratę i zwolennika wolnego rynku, a było to w czasie, gdy w Czeczenii miały miejsce dantejskie sceny. Stawiając pomniki takim ludziom jak Nawalny, Zachód kolejny raz udowadnia swoją głupotę i całkowitą nieznajomość Rosji."], ["@Melissa-h", "😥😥😥😥"], ["@jwd0808", "How dare Trump compare himself to this brave man!!"], ["@user-wm7cw8zk5p", "Trained and financed by the CIA. He was another Zelensky in the making. This is what the US is known to do."], ["@theintelectualdragon2310", "he didnt survive the last one"], ["@GeoffreyMureithi", "Don't give up."], ["@balandr2544", "The west,s Navalny project also now failed. Sad for taxpayers."], ["@JulentesDing", "Lesley - wow, what a woman"], ["@JulentesDing", "Strong interview. Of course, he has not only been a very attractive fighter, but also not without controversy. It has also not always developed positively over the years and is also more likely to be attributed to the right-wing corner. Nevertheless, Putin made a huge mistake, either deliberately letting him die or even killing him. Both have made Navalny stronger, and you can't control a dead man"], ["@antonebeach3609", "Sad man…fighting for liberty and truth.\nShame on the Russian people for not standing up and demanding accountability.\nPuppets."], ["@PeppermintPatties", "Amazing. Something Putin the Poisoner will never be."], ["@EsTher-re9uy", "SO SAD❤ RIP❤❤"], ["@user-sp5eu9cr1d", "Чем больше смотрю на него ,тем больше  вижу  предателя России ,и западного агента"], ["@bilal4067", "\"pure speculation\" his word"], ["@trebell885", "Love the dream team. Long live Navalny & the A team🎗️"], ["@Riververchi", "You were murdered by the coward. And no matter what  Putin does, THIS what shall remain in history: \nPutin is a coward.\nNavalny is a LEGEND.\nМы тебя не забудем Лёха.\n🕊"], ["@karenarcher8143", "How sad to watch this now ,knowing Putin finally managed to end Navalny life...😢"], ["@jankaapstad9595", "Lots of charisma. RIP fighter."], ["@janetludwig9948", "I want to share my sympathy for the family of Mr. Navalny, while I also share my admiration of a person who was following the same path for many of the same reasons as Jesus, the Rev. Martin Luther King, Jr., Bishop Oscar Romero, and others working to bring justice for victims of oppression, working against those \nwho hold undeserved and violent power.\nMay his soul rest in peace and may his work continue."], ["@SainJust-1789", "he is dead no speculations bring him back. Finito"], ["@SainJust-1789", "Arte und ARD  Mediathek TV...da erfährt man ANDERES"], ["@charmainepriestman915", "Rest in power, Alexi Nevalney\nThinking of your family and all in Russia who continue to fight against this evil regime"], ["@kzd8988", "🙏May God Bless your beautiful soul! ❤️🙇‍♀️🙇‍♀️🙇‍♀️👏👏👏"], ["@lymerance", "This guy should be run run for power in Russia. This man’s win is enemy’s win"], ["@valentinoromelio5414", "Trumps mind is just sick"], ["@ayeshaquresshi3046", "hahahah puppet even this lady is also mocked by Trump and she is second standard lady"], ["@Yelladog78", "He died for nothing, Putin won't ever face justice for this & he'll be forgotten about by most of society in short order"], ["@annsmith7207", "Of course Donald Trump would not speak against Putin -- Putin got Trump into the White House. Rest in peace, Alexey !"], ["@ladybeetle245", "Poison is a coward's weapon."], ["@user-jd1jf7by3u", "Seems like a CIA Agent"], ["@bichhuonglove70", "He already dead😂"], ["@Dan-xx5jq", "So sad. The world lost a great leader. \nSo much Evil in this world!!"], ["@Dan-xx5jq", "He is the MARTYR of our generation!! RIP."], ["@linjay08", "Feel pity that Russian people couldn’t be governed by this wonderful personality"], ["@A1FXLive", "Another man of courage and dignity gone.Evil prevails temporarily."], ["@RoxanneM-", "Putin and all his men are billionaires. Fighting for corruption for Putin “means fighting me.” — Alexei Navalny.  The same with Trump. When Trumpf talks about cleaning the swamp he means cleaning the country of the rule of law."], ["@o0opsa", "❤❤😢"], ["@anic5805", "May Navalny rest in peace after living through so much uncertainty and unrest, time and again putting his life on the line🙏💐"], ["@sukhmaidickoff", "Ohh so all the European leaders signed on to the Sanctions agreement, but Trump did not? This just shows once more how closely connected Trump is to Putin. Not the least financially."], ["@yven0305", "Brilliant soul! May he rest in peace 🙏🏽 \nMy heart is broken for him, family and supporters."], ["@buimiguel7281", "Very interesting interview of Mr Nalvany.  What a courage! Before he died"], ["@SebastianMaier-fm5gl", "All i can say. ..JUSTICE \nReally sorry for the family \nCondolences"], ["@mantoz9089", "May he rest in peace"], ["@ep4no", "He probably poisoned himself"], ["@alexeitchernov9665", "Traitor:). Paid  foreign agent."], ["@davec1704", "Rip Alexey Navalny Russian Braveheart"], ["@miadebrecin1071", "If he only stayed in Germany. R.I.P.😔😔😔"], ["@dsebbebridge2674", "Rest in peace Navalny <3"], ["@marianlynch4829", "Why on earth did he go back to Russia?  Something doesn't add up."], ["@kimberlyaccurso1921", "Great interview Lesley Stahl!   It should air again!!   Interesting how Trump was mentioned!   🙏🏻 for the Navalny family 🙏🏻"], ["@ktime2037", "He survived poisoning, once. 😢"], ["@Nedvio", "RIP"], ["@maryjohnson1890", "The Russians (Putin) are even afraid of him in death.   They won't let his mother or wife have his body saying they will hold it for 14 days.  They are even afraid of him in death.  Who is he?  Some supernatural being?  Ridiculous!  If they poisoned him, they poisoned him.  What are we all going to do now?  Nothing!  Release his body to the family.  You won!  They're probably looking for money to release him.  I bet they have a price!!"], ["@madhavsaxena2731", "RIP"], ["@Haegten", "what a great man of people 🙏🏽☺️🪔🪔🪔🤍🤍🤍"], ["@alejandrasarmiento3317", "His death is not only Putin’s fault… It is also on the Russians, they are responsib for not standing up and looking the other way"], ["@starlitewishes7941", "An Honurable Man, a man of vision, a man of dignity, and also a man of integrity ❤"], ["@Cherish1056", "This is very sad. May his brave soul rest in peace 🙏 very courageous man"], ["@andrearenee7845", "Maybe this should run the airwaves all over the world...NOW..."], ["@theepiccreator2042", "I don't understand who interviews an opposition leader of another country with such excitement and joy? Has Russia interviewed any US opposition leader like this? Russia has not even interviewed Donald Trump whom US accuses of being a \"Putin Puppet\". Why?"], ["@barbarakerns3914", "Rip Alexis your work for democracy and freedom of the Russian people will go down in history as the hero he was❤"], ["@luisdaniel7027", "RIP 🙏🏽"], ["@itsomethingreat", "The fact that he has been killed it’s absolutely infuriating."], ["@kennyburchett4634", "Rest in Power, Navalny."], ["@kapneanimation", "I admired his bravery and commitment. I respect his decision to return to Russia, nevertheless, I believe he would have been more useful and effective working abroad. His return was a death sentence, it was a question of when would be convenient for Putin and his gov to make it happen or simply allow to happen. Still, as Assange, his spirit and work must be kept alive as both make the world of all corrupted shake. One person (with billions behind) made an entire empire tremble, let´s not forget this."], ["@julia455", "RIP"], ["@andreimax6624", "Der Westen hat sein Märtyrer.  Ruhe im Frieden 😢"], ["@srikrishnabera6740", "Inclub"], ["@akhilat", "Why did he return to Russia?"], ["@jennywolff2120", "It is not easy to talk about Nawalny without having hater comments all around. I really wish people would stop hating one another so much, so that they wish death to their enemies or even to people who have a different opinions. \nThis is what worries me most. Let this man rest in peace now. He fought for justice. He had big opponents. He lost. \nNow let him have his peace. 🕊🕊🌹🌹🌹"], ["@walkabouttrek6718", "What a brave man. Courage personified. I have no doubt that your Statue will one day be in downtown Moscow. Though it may take a very long time for that. Rest in Peace."], ["@jakoflynn2560", "Killers in the hall"], ["@jakoflynn2560", "Brave Julia"], ["@thanatiforoxtipima1646", "RUSSIA HAS PRESIDENT THE MAN WHO IS BORN LEADER A REAL PATRIOT WHO MADE RUSSIA THE SUPER POWER OF THE PLANET  VLADIMIR PUTIN.  WE DO NOT WANT ANY FAKE LEADERS FOR RUSSIA FROM ABROAD"], ["@clalmeida67", "🌾🌾🌾 NAVALNY ☮☮☮"], ["@helenangus1675", "Respect for this man."], ["@Thebutcher91", "RIP you brave man."], ["@woonvinithketkumnuan5687", "about posion many version of posion my posion is not only there everywhere using furnace through A/C or heating dusty turned to  posion. therefore better not using furnace of A/C or heating instead using air purifier is more safty for human breathing again automatically dusty turned to posion"], ["@CK-jo9im", "seems this guy has frustrated regime change objectives, hasn't he? CIA operative."], ["@Leeuwtje72", "May God bless your beautiful soul and may your people follow your footsteps and continue to spread the words and stand up against Putin"], ["@Hgf55465", "As a russian I admired and supported Navalny work for 12 years and win keep doing so."], ["@StillGods", "Here, they just run you off the road. Hence all the highway deaths rise. Everyone knows it.  We see it."], ["@marceliematadling2937", "A thousands of salute of this brave man. Rest in peace"], ["@proinseasokiellig4388", "Yeah, assassinated by the West for clickbait..\nOoops, must talk like bot..kumbaya"], ["@Thinkingisallowed", "Thank you for risking your life for freedom. May you rest in peace and may God bless and protect your family"], ["@malgorzatabukowska5028", "Szkoda rodziny😢"], ["@RobbieBlue", "He sounded like a police siren"], ["@Alterofada", "Condolences to his family! We lost a true hero. May his wishes come true!"], ["@user-kk7zo9sw2p", "Navalny will haunt Putin while he sleeps every night. Pull him out if bed by his feet. He will never be rid if Navalny, not even in death !"], ["@ClarkSpark7", "Hey, do you know US journalist Gonzalo Lira ?  He was murdered in Ukrainian jail few weeks ago. Navalny was a racist xenophobe, didn't you know that? \n\nIn a clip for the Russian National Liberation Movement in 2007, Alexeï Navalny dressed in a white coat in a dentist's office speaks with racist and xenophobic remarks on the subject of immigration. In the video in question, we can observe images of migrants interspersed with x-rays of dental caries. Alexeï Navalny then speaks: \"in these cases, he says on camera, I recommend complete disinfection. 😮 Everything that is on our path must be eliminated by deportation.\" SAKHAROV PRIZE AWARDED BY THE EUROPEAN UNION!!!"], ["@ndnmmedford9037", "RIP"], ["@mattcero1", "10:02 = PHOTOSHOP!"], ["@mattcero1", "6:50 , Putin's inner circle is accumulating wealth? Obama accumulated way too much wealth and is worth WAY WAY WAY more than he should be. Do a story on that!"], ["@mattcero1", "There are two sides to every story. I'd suggest not listening to 60 minutes for either side."], ["@MrDastardly", "A brave man, he will never be forgotton."], ["@user-nq6mf2gu7z", "A real man ."], ["@alberttrinidad1750", "For  russian he dressed wry well. He loved his clothez"], ["@romanos3963", "Top Men, your Soul with me also."], ["@wuodbonde", "The more interviews I see of Navalny the more I am impressed by his character and bravery. What an extraordinary man."], ["@WESSERPARAQUAT", "should have stayed in Germany absolute suicide to return to Russia not a smart move"], ["@mikeycc10", "Rip Navalny - You were a man the 🌍 was proud of and should have been 🇷🇺’s leader"], ["@vee8213", "What a guy. He would have been an amazing leader"], ["@victorinyang196", "This guy never actually hated Putin. Sometimes he laughs when he talks about him when he talks about the things, Putin does to annoy people."], ["@ExcitedAnacondaSnake-hg8ec", "I can’t watch this without sobbing"], ["@dakogitlog", "US, UE, Canada, UK  and Asian countries are afraid of  the Russian dictator"], ["@user-jo3pv3yt3q", "ГЕРОЙ ОТДАЛ СВОЮ ЖИЗНЬ ПСИХУ"], ["@cinziasevignani5313", "I am so impressed by this interview. Powerful and touching at the same time."], ["@ivanvenema5052", "https://www.youtube.com/watch?v=Yba-LJ8clgc&t=47s"], ["@antekobac3472", "samo tari gamad izdajničku vrhovniče"], ["@ecoeditor", "I am heartbroken for Dasha and her family, for Russia, and for the world. Navalny will live on in his words: \"Don't give up.\""], ["@felicidad144", "Who paid for his security at that moment?"], ["@Crvenaaaful", "Ubiše ga, zaista ga ubiše! Nešto kao Đinđića u Srbiji."], ["@fantasip", "It was heartbreaking news, very sad news💔. Condolences to Aleksei Navalnyis son, daughter and wife. I see his wife as the next president in Russia 🇷🇺"], ["@user-ps3du1tp9t", "in the end, it's only possible to complete his will and thoughts by russian citizens in russia.\nif not, who else can change?\ni am wishing the russian people won't waste his sacrifice.\n\nand the rest of the world should remember well once again what putin is capable,and what his goal could be.\nI will remember Navalny's passion and bravery until the end of my life."], ["@rainofstars1", "RIP  Mr. NAVALNY    ⚡️✊️⚡️"], ["@rodinmazaheri6590", "Rest in peace 💔"], ["@JestersDeadUK", "Brave brave man, RIP #PuckFutin"], ["@Woot-Zee", "Lider of what?"], ["@ParkSeoHamStar", "😭🙏💔"], ["@ParkSeoHamStar", "Rest in Peace✨🤍🫶"], ["@ParkSeoHamStar", "ALEXEI NAVALNY RIP 😭💔 RESPECT 🙏💔"], ["@vladimircurkoski1455", "Nord stream 2"], ["@epicfreakshow", "💔🕊️"], ["@TheTianamen", "Great man"], ["@dejanrakic77", "RIP."], ["@EnergeticNerd487", "A true hero."], ["@johnryan7616", "may your memory be a blessing, Alexei"], ["@MTXEmmanuel85", "Looks like a u.s puppet! Clear in the game of Russian politics that will never stand!"], ["@maryalicemckeen1758", "I am very sad.  I am in mourning.  I feel like a member of my family has died.  I am surprised I feel so badly."], ["@rebeccachamberlain6318", "A brave, brilliant, leader who dedicated his life to integrity, love, people, the planet, and the future. He IS the FUTURE. Godspeed. He spoke truth to power.  Thank you for your unstoppable courage and inspiration."], ["@Giovannixx714", "We know the Truth not only with reason, but also with the heart. The heart has its reasons, which reason does not know: it can be observed in a thousand things. B. Pascal, Thoughts."], ["@marisaelenenadiejamusiccom3974", "RIP 😢"], ["@MrJawstherevenge87", "A life of true courage"], ["@itsrobin4775", "R.I.P brave heart and amzing human"], ["@thusomoesi5243", "How sad😢...RIP Navalny.🕊️🕊️"], ["@thememepitstop6974", "But Putin won the election..\nWhy protest???? \nWork it out in the next election!!!\nEvery country has wealthy people, again why protest?\nIf you want money just work hard!!!"], ["@cathworksout7482", "My heart breaks for your family, like-minded countrymen, and really, the world.  The terrible loss of such a courageous, brilliant person tears at one's soul."], ["@aigillberg979", "Ukraine has the greatest interest in seeing the death of Alexei Navalny.  Also Sweden.  Everyone thinks it was Russia.  It speaks for suicide.  The whole western world loves to hate Russia now.  Putin is, of course, accused of typical democracies"], ["@nsanenthembrane", "Why did he have to die 😢so sad"], ["@daddydaveshowshow7945", "What a fighter , you deserved better navalny, what a hero."], ["@catarinacatarina7123", "🙏🙏🙏"], ["@XX-rz5si", "A true hero died today, but a legend is born. Alexei to me will always be example of what it means to have balls of steel, vision and clear goal in life. Rest in peace Ljosha"], ["@crystalheart1186", "Rest in peace... humanity lost a very brave and wonderful man. You will never be forgotten, we cannot let Putin get away with this... surely.."], ["@jesus_is_life_love2932", "Heights of courage"], ["@elusiveglasslizard", "RIP <3"], ["@Notrocketscience101", "More stupidity from Putin. His death fuels the wests desire to push back on Putin. Any good will Putin has was thrown away."], ["@dougbixler7577", "And now he is dead as of this morning.... :(\nHow does the world allow Putin to stay in power?"], ["@Matrabhumindia", "Today 16 feb 2024 , he is dead/ murdered  in prison 😢"], ["@dariabalsen6383", "😢 rest in peace\nYou have been a great human ❤"], ["@rosananeves5094", "😢Dio possa dare pace e sopporto alla sua famiglia e sappiate che Dio L’unico Giusto Giudice Giudicherà chi ha portato Navalny alla morte!"], ["@adike5", "Russians need to call out Putin and stop the mess."], ["@tylertylertyler555", "God bless his brave soul, RIP!!!"], ["@obinator9065", "rip"], ["@shivanidogra4440", "RIP. Brave Soul"], ["@ghrocker99661", "RIP brave soul"], ["@Filip333ify", "Saw him once in Bali. It was around 2017, he had rented white little Suzuki and stick NAVALNY 2018 at the back window. He was about to run for president. He was there with his little son, standing in Indomaret and buying him some sweets. \nSad, very sad."], ["@wheretheavocadosat7276", "Rip Putin such a coward"], ["@bogdy29", "He should stay in Germany"], ["@realitychampion8022", "Rest in Peace...Another victim of murderous Putin.."], ["@MsRinaSh", "Putin killed him today 😢RIP"], ["@emvrs", "well RIP 😅"], ["@jimv77", "Wow, what a shocker!  None of us saw this coming.  Just like the accidental plane crash of Wagner Group leader marching towards Moscow. /s"], ["@AnitaSuman-ji6ob", "Mam they gave him poison for years...and finally he died...poison in untraceable"], ["@watersandblue6001", "RIP can't believe he is really gone now."], ["@GeaGea616", "We all know who killed him and why. Terrible, sad, disgusting! Wake up honest and good Russians? Where are you?   Come on, please be on the rigth side. Open your eyes"], ["@kountrygunz2032", "RIP Navalny. You are a hero. This is reason enough to support UA."], ["@aparnarajesh", "Rip Alexai"], ["@cba4389", "RIP Navalny. He died today while tucker carlson provides a distraction for putin."], ["@DividedKingdom", "Rest in peace."], ["@blazept567", "I can't believe he's gone now..."], ["@tamzidmohsinkhan3333", "Putin secretly killed Navalry\nRIP"], ["@Alexander_Moreau", "Just got announced that Navalny died, R.I.P. 🕊️ He was one of the few who spoke against Putin’s corrupt government and dictatorship."], ["@Sovjetski-", "Aleksej Navalnyj R.I.P"], ["@jklsdf5885", "Yet Tucker Carlson still portrays Putin is a perfectly normal world leader"], ["@roniefranken2022", "R.I.P, in name of worldpeace😢"], ["@DelFlo", "\"Ironically, I became more human after facing death..\" Interesting, would he say the same now that they've sent him off to Siberia? \"The further they exile me, the more human I become..\"?\n\nEdit: RIP Alexei Navalny 🙏😢"], ["@jmartinez562", "This Poor Guy"], ["@11Conet", "Horrible. Praying for his speedy recovery."], ["@MichaelBrown-be7vn", "He also supported the invasion and annexation of Crimea and the proxy wars in the Donbass.... sadly a right wing nationalist is the only option previously in Russia... nevertheless I hope he survives...."], ["@AudriusMikalajunas", "That's a clown  Google: \"triunebraintheory\" and \"backwardsevolution\" 📱💻"], ["@Wizardof", "Mates, there are rumours that say this feller actually wanted the war in Ukraine to go forward and not \"stupidly\" and Georgians are low class but do your research and don't listen to Putin Comment Bots hither.  He might be after but this is a case of two fast food joints.  Which one has less grease in the food?"], ["@astrologywhore", "He’s never gonna leave the Siberian penal colony alive"], ["@cgk369", "Why is he speaking in English?"], ["@triskelion5pillars", "This guy aint scared he bravest of all whistleblowers who hate corrupt politicians"], ["@bjornhendriks1987", "If you winning its the treu. But you don't winning. Stop if you smart enough.\n\nLook at the world you in living. Dont critical the          government. They are winning i see.\n\nMake a computer that reaches Singularity.\n Be the Richie's 😂\n\nMake your own place. 🌎\n\nFighting over nothing humanity.😊\n\nIf god is real then the biggest city to."], ["@paheem1", "He sounds like Zelensky."], ["@krtajalim", "God, bless this heroic man!"], ["@ElSAVALDORfunes", "Free Palestine"], ["@user-sr6dt4xp2g", "There could be also some Russian mafia did!!bcoz he was criticised all rich oligarchs"], ["@seattlejayde", "This Brave Man is my HERO!"], ["@kimf8635", "So, so brave! She’s just as brave and I pray for his safe return. I hope he escaped."], ["@GeaGea616", "OMG where is he? It is horrible. Where is justice! All the best Mr. Navalny, greetings from Zagreb , you are hero! ❤"], ["@waynewhite1295", "When it comes to putins rivals dying  or poisoned either no investigation by putin or he in charge of investigation and the outcome of the verdict personally."], ["@amandapeluso4217", "Another US Puppet. The US should stop interfering in Russian elections as we have done enough damage worldwide with our installed puppets,  CIA coups and State Dept funded NGOs. Good he should stay in prison longer than his 19 years.  God Bless President Putin and Russia!"], ["@karllaur3866", "He had a choice - live freely in the west or willingly return to Russia to serve in one of their prisons just to prove how principled you are, like a messiah complex. Knowing everything he did, serving in a Russian prison was literally his own choice."], ["@UTubeisSHIT523441", "And WHAT a Smile.... .."], ["@UTubeisSHIT523441", "Just Let me out of Here I would say.... Out of the Country.... No?? Navalny????"], ["@itonman5837", "A lousy slander."], ["@GOGOGONTA8888", "Is Nawarinui justified?Cult?\nBecause you can't count on western propaganda."], ["@genaZnahar", "Выходите  и   проголосуйте  хотя  бы   устно  за   мир  !"], ["@jeffjewett481", "Thank you CNN for giving this video a focus on tv.👏🏻👏🏻👏🏻👏🏻👏🏻"], ["@jamessamaroo4729", "Alexey Navalny persecution by Putin parallels the same persecution for President Trump!  Where Putin controls Russia's Justice System!  And where Biden and his loyal followers WEAPONIZED America's Justice System to persecute Trump!  So we can analyze and say Biden's justice system is a copy of Russia's justice system!"], ["@rmazzella5303", "I can’t help but wonder if Alexei Navalny is a tyrant in waiting; Russia, after all, has a history full of them—Ivan the Terrible, Joseph Stalin, Vladimir Putin, etc.."], ["@Boomhauersdad", "My soul is crying seeing a man being persecuted on television for the whole world to see but nothing is being done. What a legend"], ["@MissSpaz", "I wish they had mentioned that Navalny called up the man he suspected administratored the novochok, pretended to be his superior and asked him about it and got a confirmation of who poisoned him and who ordered it (Putin)"], ["@diogenes.", "Who is this guy, why did they let him back? Why is he in prison, i mean do ppl really believe this sh-t?"], ["@thosethatcan", "9:04"], ["@thosethatcan", "Fing insane story..."], ["@targe4070", "He is in Siberia, making soldier clothes for the motherland right now 💪😎🇷🇺"], ["@jappiehogenberg1656", "Putin is a very dangerous hiding person."], ["@Ketofit62", "Did you know Everything respect all these years?"], ["@TravisBerthelot", "May the vodka drinking Russians rise up and support Navalny or anyone that support real elections."], ["@JeffZuccMusk", "GOAT"], ["@ambition112", "0:46: 💥 A prominent opposition figure in Russia survived an assassination attempt by poisoning and was later allowed to travel to Germany for treatment.\n3:56: 🔍 Speculation about the use of a highly toxic nerve agent in an alleged poisoning incident and the denial of involvement by a specific individual.\n7:25: 🔍 The speaker discusses the aftermath of a poisoning incident and the lack of a criminal investigation.\n10:59: 🔒 The speaker discusses their experience of being targeted and the impact on their family, as well as their determination to continue their work.\nRecap by Tammy AI"], ["@phillipaclemons7261", "Tall, handsome man with a courage of his conviction, possessed by very few."], ["@sebastianwrites", "Oh come on 60 mins, when the plane landed the ambulance must have known this wasn't about a drug overdose!"], ["@sergiyrospysdiyenko6224", "Wish strength to Navalny and wisdom. Hope he changed his imperialistic views and doesn't support russian annexation of Crimea anymore"], ["@Smoothie--oy8ri", "I respect Navalny, but for his own protection he should have stayed in Germany. After this interview, in January 2021, he flew back to Russia where he was immediately arrested. He has been in custody for the last two and a half years. He has been convicted of bogus charges in a kangaroo court and is sentenced to over 28 years in prison. He will likely die in prison and become a martyr for speaking out against Vladimir Putin's criminal enterprise. His only real hope now is a full blown revolution, and who knows if that will ever succeed."], ["@760HorsePower", "This is what happens to nazis in Russia, they rot in prison for the rest of their sorry life.\nGLORY TO THE GREAT PUTIN"], ["@neilefc877", "I am praying for you today, Mr. Navalny xx"], ["@Gertieness", "Unfortunately,the man is never going to leave Russian prison vertically"]]