[["@sitanshuchaulia9426", "#🇷🇺🙏"], ["@huntwind5207", "It's a high bar .. Perhaps Trump may be the only one able to deliver the quality of results to Americans that Putin so successfully delivers to his people. \nWho is America to lecture him on the quality of his democracy? Prosecution of political rivals is what a thug like Biden does ... and he's accusing Putin of the same? Navalny would vouch  for Putin's fairness to his opposition candidates. Ask Navalny  .. if you can .. and you'll better understand  why Putin is so worthy of Trump respect and admiration."], ["@user-xv3er7dg7u", "بوتين ✍🏻🗒️💌"], ["@beastsquad3227", "When putin say evil people in the west hes talking about the democrats cause they want to push there theories around the word like Mutilate in your kids. And all the the evil stuff going on in the west So it's ingenuous to make it as if he's lying that there really isn't evil people in the West. You guys are constantly talking about it on your own network. Why don't you just give us the 100% facts? Without your twist on stuff. All media does this doesn't matter the company. So you know your viewers like me can see this and it pushes us farther away from you. I'm about to unsubscribe here fairly soon. If you guys keep the s*** up. We need the facts with no emotion thank you.We can think our selfs i you should know im mean look at your numbers of viewers drop the last few years your not vary good at business your just as bad with the fact new the way you guy try to frame and twist the truth.  ! GO TRUMP! 2024 ❤🎉"], ["@stevem6393", "In the symphony of global empathy, Ukraine is the conductor, orchestrating a harmonious response to adversity."], ["@ctcole77", "Just say No to Putin"], ["@denisetefft1638", "Hope to God he loses, but I’m sure he’ll fix the votes."], ["@JohnGuyu", "🌞  RESIGN 🚀 🇷🇺"], ["@Thot_Patrol_USA", "schizo ahh comment section"], ["@Thot_Patrol_USA", "why bother? might as well call him tsar putin lol \ni wonder who is going to win next year???????? hmmmmm"], ["@jamesmustin7289", "Putin will run for President and is expected to win with 90% with competitors or electorate.   The Russian Church declare him a Saint\nFor this miracle"], ["@OrtizJuan-st4co", "Con tanta riqueza y no disfrutar la vida que triste"], ["@Paulettedddd", "Trump’s friend - what an awful life we live in."], ["@DAWOL2025-fs1ve", "Is he the only one on the Ballot?\nThat's how Saddam Hussein worked his joke democracy, Communist dictatorship, product of allowing any human to have too much power."], ["@backcountrylifemagazine6912", "Russian “elections”… not very different from American “elections” now."], ["@alexeipereligin", "VIVA PUTIN!!!!!!"], ["@AlienIsolationist", "2:07 Putin has only served 2 terms as President"], ["@AlienIsolationist", "Thats not true, president Medvedev was a thing"], ["@stratfordbaby", "Russia has already won the war Bob. And the Ukrainians have been committing cultural GENOCIDE for at least 15 years."], ["@user-wt2yn4bh8z", "Ya, all need to learn to speak slower. Awesome info! But slow Dowm!"], ["@derrickjoe1872", "Russia is officially more democratic than Ukraine which called off elections and banned all opposition."], ["@aidenfisher5679", "Fake"], ["@A_citizen_of_Russia", "You dirty lying bastards, I'm voting for Putin because he's against you, devils."], ["@aymenbecit283", "يعيش بوتين"], ["@artman40", "A person who is responsible for hundreds of thousands of deaths and tens of millions of ruined lives."], ["@BDRioga", "A true leader, people love him in Russia."], ["@user-mj7fk6gg7s", "No true elections but special arrangements.  Most if not all opponents in prison or dead. Where is fairness and true  democracy."], ["@mauretteeric2806", "That's a good news. Mr Putin is a wise president widely respected (not like Genocide Joe)."], ["@razz-8031", "Who in their right mind would not vote for Putin. They'd disappear pretty quickly."], ["@THINBLUELINE.K9-OFFICER-5558", "Can't defeat NATO? That's laughably funny 😂!!!\nIf it wasn't for NATO we would never be involved in this MESS. \nDon't start crap you can't win - NATO."], ["@adriancarmona7416", "Who is he running against? Lol his name will be the only one on the ballot"], ["@rmviv4rmviv443", "Analytical literal translation by Gary f zeolla. Genesis apologetics app, YouTube Christian prophecy being fulfilled, all christians activate spiritual warfare put on the armor of god. Stop being spiritual infants drink the milk become spiritual toddlers. Leaving the trail for you to follow.... Spiritual warfare -fasting teams,prayer teams,breaking curses etc"], ["@ed.miles.5029", "Putin is hoping that his Puppet  Trump going to win again ))😂"], ["@naziukraine607", "푸틴 대통령 사랑합니다 💜"], ["@arina7444", "Putin always says that he is ready to negotiate.  It was Zelensky who refused negotiations in the spring of 2022.  It was Zelensky who wrote the law prohibiting negotiations with Russia."], ["@monikaflisnik6627", "\" Noc żywych trupów \" 😅 Biden jak otwiera drzwi to już straszy 🤣🤣🤣🤣🤣🤣 Putin straszy jak wstaje z łóżka i powłóczy nogą 🤣🤣🤣🤣🤣🤣"], ["@monikaflisnik6627", "\"Putin wiecznie żywy\" 🤣🤣🤣🤣🤣🤣 Za chwilę \" wypierdoli \" Lenina z mauzoleum 🤣🤣🤣🤣🤣🤣"], ["@peterpoprafsky7353", "Putin Needs to Be Arrested For all His War Crimes. Where is The U.N on this Issue and Further More Russia.Should be Sanctioned From the U.N Until they Hand over Putin For His Crimes."], ["@aug2890", "Bla bla bla"], ["@Orbity38", "Why on Earth should anyone vote for yhis guy again? If they elect him president again, they have to be prepared to accept the deaths of more of their children with reckless and useless wars. Serial killer Putin needs to be voted out asap. If he is elected president again, don't ever feel sorry for Russian 🪆 people no matter what."], ["@jarek1370", "putin's best ally in US is d.trump"], ["@michael13328", "He promises to Make America Great Again"], ["@sofiyagrober2180", "Most important here is Putin controls oligarchs. Something that US gov failed to do. So Russian people are represented while American are not. \nAll that \"russian mothers\" talk is brainwashing. Think about americam mothers"], ["@sofiyagrober2180", "2024 - 2000 = 24 - 4 = 20. +6, he still not getting to Stalin's 29 years"], ["@sgt4370", "Putin 2024 🇷🇺"], ["@soulsurvivor4499", "I didn't know they had elections!"], ["@wn8022", "Re-Election. 😂😂😂"], ["@amlesomgawed1929", "The world needs Putin and Russia! Stop lying"], ["@kevfry3738", "Lmfao election?? lol yea right"], ["@michaeldee7921", "Like they actually have a real election 🤣🤣🤣🤣"], ["@torablack", "I hope for the best"], ["@VsevolodSidorenko", "lol according to russian constitution no one can be president for more than 3 times, vladolf poopin want to be 5th time"], ["@MJM1309", "trumps favorite dictator I hear putin is going to ask trump to come to russia  and be his Vice Dictator"], ["@avawilliams4227", "Go Pooty Poot"], ["@richardgillette5759", "Biden should praise Putin like Trump did and summon him by saying “Russia if you’re listening…”"], ["@user-jw9lq5ib6g", "the BaldGangsterDwarf in kremlin... paying for fox-sewage-news lies and hate for America"], ["@lasersbee", "Cavuto... The Democrat/CNN Shill..... Needs to go the way of Chris Wallace."], ["@fallenkeith5885", "Putin for US president 2024!\n\nI mean, can it be any worse than our last 2 presidents?"], ["@user-zk5nu5fh6l", "Long live Palestine"], ["@jrculbertson7463", "I find it mind blowing that everyday Russian citizens are not fed up yet with their LITTLE TYRANT...."], ["@RobertJackson437", "Well respected leader, Russians should be proud of him"], ["@migy5031", "When I saw the video title, I thought it was a piece from Babylon Bee! 😆"], ["@stevenwendellnelson8861", "\"Lord Jesus Christ, Son of GOD, have mercy on me, a sinner\"\n\nPlease pray these words now 🙏 and please consider beginnning daily prayer, it is a good habit that will help you if you actually do it and continue to do it\n🙏🙏🙏🙏🙏\nMatthew 5:9\n\"Blessed are the peacemakers, for they will be called the children of GOD\""], ["@user-rj4yk3ib8x", "I think hes going to win 🤔"], ["@lemontadams3029", "Zelensky’s wife pleads for more US cash\n\nUkraine is in “mortal danger” without billions more dollars from Washington, Elena Zelenskaya told the BBC"], ["@vv88816", "Of course the US wants some fool to be elected president of Russia so that the Russian state becomes weak and collapses. That's not gonna happen. Putin knows how to strengthen Russia. And the fact that he has been president of Russia for more than 2 terms, it doesn't bother most Russians. In the U.S., they don't change Ilon Musk, who makes good electric cars. Read less political science. Reality is very different from what is written in university textbooks on political science."], ["@MegaTri4", "Just in time to meet Trump"], ["@abubetts1846", "Best leader for Russia"], ["@masonhunter2921", "There goes any chance of having Putin for Trump’s VP, or vice versa. Guess it’s back to Santos, brought onto the Trump campaign for credibility."], ["@marcusm975", "😂😂😂"], ["@joshuaholsti", "You morons cannot pass up one story to bring up President Trump. I feel sorry for you all at this point. It’s a level of mass mental illness I have never seen before in my life."], ["@joshuaholsti", "As if we believe they have elections"], ["@user-sj5lq8uz5j", "Gee! Do you think he will win????"], ["@MachiavellisThePrince", "Does anyone think Putain's war crimes will hurt his chances in his latest sham election as dictator?!?"], ["@KK-gr9df", "Trump and Putin 2024 😂"], ["@emilypine", "Long live Putin ❤"], ["@Blackblackblack123", "President of poison!"], ["@zoom777", "King Putin the best president"], ["@daviddiaz3608", "There's election in Russia 😅That's a good one 😅"], ["@jzarling", "LoL 😂"], ["@ed3432", "Idi Amin would be proud. Dictator for life😂"], ["@myvicval7506", "He should be there!"], ["@fredm2791", "Soooo....anyone who votes for Putin is actually a Trump agent, right?"], ["@StarwaterCWS", "Я только что съел пиццу с пепперони и сыром, и она была великолепной на вкус!"], ["@chashue6032", "Trump approves."], ["@maxinewest2191", "Very informative news coverage and comments."], ["@youngdoan3465", "F..k he’s a dictator. Dare any one stop him.  Stop this Devil or he’ll become another Hitter."], ["@bobwoods1302", "How's Putin's \"3 day military operation\" in Ukraine going? 😂🤣"], ["@user-tn3uq4tm7p", "Putin is the real OG.\nHe's being President they all comes and go, he will still be President Biden go and Trump comes again and go and all the weak EU leaders now and future including zelenski."], ["@Thomlistentoslayer", "Why announce😅🤣😂 He already won😋this is silly."], ["@lindseystarr6658", "Honestly who the heck is gonna vote against Putin knowing that they will just become targets?"], ["@mssv19123", "Zelensky just announces he will be new dictator of Ukraine.....no election"], ["@seekstruth5968", "The biden administration has learned all of its corruption methods from overseas entities.  Interesting."], ["@markhughes7273", "Wonder if he gets more votes than Biden got ."], ["@backlash1258", "I wish US had a sober government that knew right from wrong."], ["@EP-ko2yi", "Putin's elections are farcical.  They are what Trump would turn ours into."], ["@maxsmart8954", "He’s got Trumps vote!!"], ["@user-ep4nu9tu9g", "\"And suddenly there was with the angel a multitude of the heavenly host praising God and saying: \"Glory to God in the highest, and on earth, peace among those with whom He is pleased!\" When the angels went away from them into heaven, the shepherds said to one another, \"Let us go over to Bethlehem and see this thing that has happened, which  the LORD has made known to us,:\" And they went with haste and found Mary and Joseph, and the baby lying in a manger. And when they saw it, they made known the saying that had been told them concerning this child. And all who heard it wondered at what the shepherds told them.  But Mary treasured up all these things, pondering them in her heart. And the shepherds returned, glorifying and praising God for all they had heard and seen, as it had been told them. And at the end of eight days, when He was circumcised, He was called Jesus,the name given by the angel before He was conceived in the womb.\"  ( Luke 2:13-21  E S V  Bible)🙏🙏🙏  \"For unto us a child is born, unto us a Son is given: and the government shall be upon His shoulder: and His name shall be called Wonderful, Counselor, The mighty God, The everlasting Father, The Prince of Peace.\"  ( Isaiah  9:6  K J V  Bible )🙏🙏🙏  \"For God so loved the world that He gave His One and only Son that whoever believes in him shall not perish, but have eternal life. For God did not send His Son into the world to condemn the world, but to save the world through him.\"  (John 3:16-17  N I V  Bible ) 🙏🙏🙏"], ["@MakePoint-or9sr", "Zelenshy is a PIMPle"], ["@MakePoint-or9sr", "Power to PUTIN. \nAmericans Love Putin.\nPoor guy get blamed for everything by the rotten dems.\nPOWER TO PUTIN."], ["@bruconicinfernon4noplatoon317", "2018 Donny personally called Vlad to congratulate him on a successful re-election, for two hours."], ["@user-wk2my9hu8u", "Trump= poutine= xi= pyong= dictator!"], ["@gabrieladickson2826", "I thought he passed away. A miracle has occurred. He is alive. Well. That’s a shame."], ["@DZ-zc3gi", "You would be surprised but 80% of russian population totally support him. He must be doing something right. How is Biden doing?"], ["@generalacehorn4059", "Normal thinking Americans h8 DonnyDictators guts...!"], ["@vcastik", "Just wondering, isn't it American people too endangered with 2024 election for Trump mafia family comeback surprise as before! 😂"], ["@camlynn50", "This should be the Republican ticket for 2024, Trump, Putin. Fascism first. Two dictators for the price of one. Make America Russia."], ["@danee9647", "Putin will  win  without even trying. Or as we call it in america,  \"pulling a Biden\"."], ["@runstrumshoot7869", "I think their electorial system is the same as ours has become.  Biden is running again who will win?"], ["@Ricky-wc6zx", "Well most of the other candidates too be elected end up Iver in prison or poison how weard is that but of course putin elections are fair when there no other too run against him and if anyone does win there only holding spot"], ["@star.l0rd", "Putin is my kind of president."], ["@darrenleslie7264", "Putin isn’t doing anything new he’s just doing what Biden and democrats are doing to Trump"], ["@georgehenderson7783", "Hasn't Putin been in power long enough?  Can't Zelensky take him out using the $140B we've given in weapons and money?\nOh wait, I forgot, Ukraine lost."], ["@goelnuma6527", "America needs a Putin, democracy does not help ordinary people. Politics just wastes money and effort. We wouldn't need to waste money on elections or have stupid and meaningless debates"], ["@rblauson", "Scumbag murderer. He’ll pay eventually."], ["@perfectionist724", "I thought he was a dictator.  He announces hes going to reelect himself"], ["@devorahdash2565", "Given that he has killed or imprisoned all political opposition a sure winner , something that the jackass Biden wants to do ."], ["@charlesvickers9396", "Putin The Killer."], ["@rickybaldner5142", "Id take Putin over just about anyone accept Trump! Putin 2028????"], ["@emenyiris121", "I’m writing in Putin for 2024. 😮"], ["@jamesjarvis-bx3qi", "I am the President if Internal Affairs. I know what i am doing to you."], ["@jamesjarvis-bx3qi", "West Virginia, i am codename: Cobra. That means im Internal Affairs. My spy is on you."], ["@pinheadlarry9495", "I'd vote for him. He's accomplished so much good for Russia. More good than anyone in Washington now has done for Americans. \n🎉 Putin 2024 🎉"], ["@ernestayo6131", "Any odds  Putin loses?"], ["@mikeclayton6955", "Trump threatened people on Day one.  Dictator s never leave."], ["@jamesjarvis-bx3qi", "Its happening right now as we speak."], ["@jamesjarvis-bx3qi", "Tens of ten thousands aid me."], ["@michaelplowman2396", "what a joke, this despot has no opposition to stand against him if he had he would have him murdered and have his money taken away and put in his own account and it surprises me that no one has taken him out by now and  when someone decides to do it they can go over to China , North Korea ,Syria, Belarus and all the other countries ruled by despots"], ["@jamesjarvis-bx3qi", "That was Classified D Report"], ["@jamesjarvis-bx3qi", "Thats when i built the mosques, and it eas because i assumed they committed the abomination of desolation inside my church. Did it happen?"], ["@dennislawrence8501", "Over 1000 Companies say they won't do Business in Russia, after Pootin stole over $50 Billion of their Assets.\nOn Google.\nIs Pootin still your man?."], ["@jamesjarvis-bx3qi", "That happened in Knoxville. The head was seen by me in vision."], ["@vlad-hw6tk5zi4n", "Байден из-за своей тупости проигрывает войну Путину руками Украины и сейчас он свои неудачи хочет спихнуть на республиканцев что якобы они заблокировали бюджет помощи Украины из-за них Украина проиграла хотя на самом деле всё просрал сам старый дурак байден и Обама стоящей за ним"], ["@darknessfadestolight4312", "Putin 2024 !!!!!❤"], ["@amadeogarcia1138", "Trump wants to be another Putin."], ["@ourlovehowerica", "😂 Putin is gonna be as always democratically elected"], ["@jamesjarvis-bx3qi", "The satanic synagogue is not forgotten"], ["@marybuford9591", "I know it'll be a fair and honest election."], ["@jamesjarvis-bx3qi", "There was Gods church, Christs church, and the mosque. The mosque may not have did a good thing, but who is exciting enought to discover that no evil was and is in me?"], ["@betweenyellowan_dred", "I think Putin has a good chance of winning in the next democratic election"], ["@jonesy4588", "they give you a ballot that's already been marked who you voted for"], ["@humorous8716", "You know what I find hilarious and no one seems to notice. A handful of old ladies women children men not an army. Was able to defy one of the worlds superpowers. That's right folks That's who's fighting Russia. Women children old people and men that are not in the military. And they have stood strong against a massive force of ignorance and stupidity. What does that tell you about America. Maybe Americans should be more like the Ukraine. And stand up for what's theirs instead of what is someone else's belief that's theirs. Bunch of ignorant people"], ["@humorous8716", "No one is allowed to vote against him. Don't you people really know what you're talking about. Vladimir Putin made him dictate her of Russia years and years ago and no one can dispute that fact without being murdered. Are you people all insane or is it just a handful of you"], ["@jamesjarvis-bx3qi", "I am Ghost. Can you see me longing for you firever and ever? Im Amen. Thank you. Im Obsma. Its exciting."], ["@jamesjarvis-bx3qi", "Its not qualified as top secret now."], ["@jamesjarvis-bx3qi", "That means i told you top secret intel."], ["@marionwoodward5186", "Who would you vote for? Joe Biden or Putin? I think I take Putin😂"], ["@jamesjarvis-bx3qi", "War Games: Top Secret\n\nIf you choose to be alrming with innocent shouts against crime, you made an impact. Top Secret information disqualified."], ["@bestman29307", "Trump wants to be just like Putin!His words not mine."], ["@jamesjarvis-bx3qi", "A king is chosen to be a servant of his people. If you serve trash to your people, you get national dishrace and no freedom."], ["@kensnedegar5925", "Why not look at sleepy Joe Biden that destroyed the USA why shouldn't he run Joe Biden even razor inflation rate up to 18% on our food and everything we buy and that crazy fool is running"], ["@jamesjarvis-bx3qi", "Who is the outlaw? The man who stole the horses, or the boy born Sheriff who tried to take him down? Outlaw is not law, and the government said, Share it. They want an outlaw sociecty instead of Law and Order."], ["@richardbennett9045", "Gee i wonder who will win that election im sure there government is as honest as ours lol"], ["@stephentresca3536", "He's a dictator. What running is he doing? But he's a genius according to the Orange Jesus 😅"], ["@Nute1985", "You mean installed like a toilet!  The man is a pic of crap 💩!!"], ["@NickDrinksWater", "Thats what I dont get, why in america theres two term limits for presidency, but anyone in congress can stay indefinitely?"], ["@tannehill91", "Rather have Purin than Biden"], ["@Steve-nt9tx", "He and biden are the bobsey twins ."], ["@warriormonk3062", "He’s going to win 100% of the votes like the last election 😂"], ["@AndyTempleman-ot6lu", "Trump would love to have Putins power and ability to just be President forever! BE careful America. NO to Trump!"], ["@PerceivedREALITY999", "When Putin speaks I listen, when biden speaks I laugh. When biden stumbles up the stairs I laugh some more. When zelensky speaks I hide my wallet."], ["@diannethomas7057", "He and Biden like to play pretend that they are running but acually going to just take it."], ["@dennislawrence8501", "Pootin has siezed over a dozen of the World Corporations Assets in Russia, costing over $50 Billion. \nCorporations will no longer do Business in Russia."], ["@dangomes4855", "Why is he bothering with the charade of a supposed “democratic” election when he has already elected himself, with any possible, alternative candidates either in prison or dead?"], ["@Apetape375", "Oh Lord, we pray for the Russian president's continued good health and we also pray for our brothers in Palestine 🇵🇸 Make their feet firm and make the earth shake under the feet of the oppressors, oh God."], ["@jamesjarvis-bx3qi", "The cartoons where the persons are running, individually, cameras faced towards their front, are important medicine. They are on action beat, no police, no soldier, just a person with a heartbeat and misiion that seems important. I got to run. Thank you. I am the President."], ["@user-ze7sj4zv3j", "I like Putin, he’s been in office as long as I’ve been alive."], ["@JimJones-fy8ul", "His political opponents are 💀!"], ["@tupidcrashtestdummy", "Funniest thing I've ever heard. I'm sure he wants Fair elections."], ["@dennislawrence8501", "We all know Pootin rigs Elections. Trump learning from his Boss."], ["@jamesjarvis-bx3qi", "Im sorry, mommies who lost their children before birth."], ["@Lando_P1", "Fake election just for show."], ["@eddiemunster4094", "He probably wont be around in 4 years his failing health and popularity are diminishing 😅"], ["@nicholaswilliams3432", "Ahahhahahahahahaha this is a big joke."], ["@smithlinda4271", "You Stay Right in there Vladimir Putin ....."], ["@jamesjarvis-bx3qi", "Mary Antichristian is antichristian."], ["@jamesjarvis-bx3qi", "Insanity says Jesus Christ is antichristian. Thats the German police in trespassing on Israeli soil."], ["@maxmcgraw3571", "Will FOX ever get rid of this idiot?"], ["@debramiller7127", "CZAR PUTIN"], ["@takouhiminassian1866", "Very glad to hear that Mr.Putin will run for election.The interviewee expressed  anti-Putin opinion and the danger of \"communism\".All anti-russian propaganda goes also with \"communism\" excuses. Really??"], ["@debramiller7127", "Putin 2024"], ["@popscratchie3985", "Putins going to run for reelection,  well I never would’ve guessed"], ["@dennislawrence8501", "Fox, a breeding ground for Insurrectionists."], ["@dennislawrence8501", "So many Russki lovers here."], ["@asabovesobelow5683", "Putin is Dictator for life Xi is also. North Korea and Iran aswell."], ["@dennislawrence8501", "And Trump and Fox say, great news."], ["@drhjhulsebos", "See, Biden is delivering democracy around the world."], ["@jamesjarvis-bx3qi", "Redemption is not a crime. It is spelled out."], ["@jaymudd2817", "Here we go with all the Leftist comments linking him to Trump."], ["@jamesjarvis-bx3qi", "At my house."], ["@jamesjarvis-bx3qi", "This occurred in WV."], ["@MadSceintist", "I like Putin and he needs to stay. He's actually a steadfast force the world needs"], ["@jamesjarvis-bx3qi", "I was crucified, then i committed suicide, after that, i was hailed away on a straight jacket to hate the police."], ["@kimani34", "Trump's envious template."], ["@andrewherman5010", "fake, like US 'elections.'"], ["@jamesjarvis-bx3qi", "Well, i am the Third Reich of Christ. I was taught many things."], ["@ConservativeCE2", "This is exactly why the USA has 2, 4 year terms, to prevent Dictators like Putin from controlling the country for an endless amount of years."], ["@jamesjarvis-bx3qi", "The Germans kidnapped the Jewish children one day in the past. It was King Herod who said do it. It is hate to resist my fight."], ["@MarianneOz", "Had a good belly laugh - he is having a run in an election! Hysterically funny."], ["@jamesjarvis-bx3qi", "Alaska is rhe old Germany. They sre not allowed in Israel."], ["@johnribail7426", "Tell him we're willing to send Biden and kamala for vp as a bonus if he wins 🤣🤣 but he can have them now! Eventually Biden will take his son with him he'll have xi as neighbor😂"], ["@jamesjarvis-bx3qi", "No bail required."], ["@jamesjarvis-bx3qi", "They will pay for their sin, but not with my money."], ["@MoonlightXYZ", "Biden's best friend."], ["@johnribail7426", "Why is he running when there's no opponent"], ["@jamesjarvis-bx3qi", "This is a German conference that didnt go so well."], ["@JohnWick-el9yw", "People still think voting matters 🙃"], ["@fytghggyungf7601", "Putin-Trump 24 🙏🏼"], ["@edgartokman4898", "\"Our schools and university's must be modern and open to all advanced ideas.\" \n                               -Vladimir Putin"], ["@TheHood44", "Im not shocked by this at all."], ["@Trumpbusters", "Trump's trying to do it.\nThe burning question in my mind:.. will Vladimir Putin be able to make idiots out of 45% of Russia?..\nWill the Russian population forgive his lies which killed innocence?\nWill he refer to himself as Russia's \"favorite President\"?\nI guess I have more than one question about this world and its lying,egotistical,and soul-less wannabe\n \" leaders.\".🤔🇺🇸"], ["@PatootysManyMisadvetures", "It's weird to see all the people comment sayin No they don't want him anymore or how he makes sure he has no opposition or how its not even an election, yet those same people support Trump and that he is trying to end up doing that same thing."], ["@sashasavisha146", "C’mon Russia, this time vote for…. Oh wait, he suddenly died"], ["@Shining237", "Russia 🇷🇺 is very blessed to have this gentleman running for office again.  Mr. Putin did the right thing in stopping this \"Ethnic Cleansing War\" in the Donbass Region.  If Zelensky 🇺🇦 had taken the \"Peace Deal\" with Russia back in March of 2022 - none of this violence wouldn't have happened.  All these deaths are on his head."], ["@jackbooten2681", "Gee, I wonder who will win."], ["@davebergman5718", "The fake news has been telling us he has been terribly ill for years! Why is he still alive? Maybe we have been lied to."], ["@jamesjarvis-bx3qi", "Disarming Israeli Police is illegal and this is an illegal faction to the President, but this is my land and i am King of it, and i must now disarm US police in my nation of Israel."], ["@jamesjarvis-bx3qi", "There will be war if rhe people use guns against me. God said so last night, but i forgot to tell you. Its because the judge disarmed the King."], ["@jamesjarvis-bx3qi", "I sm a legar Private Investigator. I went out on my iwn as a police officer to work under me."], ["@user-jc7jb3bu5s", "Biggest joke since biden won by 81 million votes! "], ["@jamesjarvis-bx3qi", "I will pay no judge fines or court costs because i was not guilty of free speech."], ["@jamesjarvis-bx3qi", "Im Edward Snowden. A slanderer of the NSA and national court system because they set out my kids to be killed."], ["@JesusOrDestruction", "God bless President Trump and Putin 🇺🇸❤️🇷🇺 🙏"], ["@jamesjarvis-bx3qi", "Muggy"], ["@chrismaurina5260", "He’s a real leader Biden is a imbicile"], ["@nightowl1810", "Dominion machines."], ["@overcomer5608", "The reporter ,the gust facial expression and their weak voice tell us some things."], ["@jamesjarvis-bx3qi", "These cops arent sokdiers. I am."], ["@jamesjarvis-bx3qi", "War is handled when i say it has to. Thats what i said when they killed my wife and son."], ["@MrX-zz2vk", "Any would-be political opponents are either very brave or perhaps suicidal."], ["@jamesjarvis-bx3qi", "Cued"], ["@LoopHoleLeeRoy", "They need to fire the fox intern who posted this… it should read “Putin announces he won re-election”"], ["@average_savage9215", "Front runner 😂 hes literally the only option.Can somone plz explain to me how a dictator runs for election ? How in the world does that work? 🤔"], ["@jamesjarvis-bx3qi", "Im Barack Obama, and terror has become a new report. The Hrseradish issue the oolice have against me are proverbial trash insults, slaying needs by culbs and weapons, and theft of furniture. It is truth that a religion starts with a cause. But the police are not a caise when they trash the victim with oerjury rather than the guilty."], ["@andrewphelpsforcongress2026", "Oh look!  Putin wins unopposed!!"], ["@davidkoch1656", "He's running against Joe biden.😂😂"], ["@maternst1", "Reelection!? LOL!!!"], ["@deanjackson2125", "Don’t worry. We have 81 million Joe Biden supporters for Draft in case WW3 breaks out.."], ["@viktory-ru1vs", "Madame Zelenska buys jewelry at the expense of American taxpayers!! 😡😡😡"], ["@99cachorro", "Does he have any competition that could win?"], ["@geneholt8501", "Can you blame him for not wanting NATO surrounding his country"], ["@Freedom-dx7kq", "Do their votes matter there? 🙄"], ["@45TWBTNP47", "Reelection is a hilarious way to put it"], ["@bobcoulon2449", "It’s the same way we do it in our country don’t care yourselves"], ["@cutndry4165", "Re election?😅😅😅😅😅😅"], ["@Skeptical59", "Rumor has it that Putin says the only way to secure democracy is to make sure he's the only candidate! lol sound familiar?"], ["@johnmyers-ep8uk", "Vladamir Putin im a future candidate for president of the United States I would truly enjoy it if we could possibly meet some day and become good friends I have alot of great ideas that would benefit both of our Super Power Countries if you are interested please by all means have your people call my people!"], ["@colorforblind", "FakeNews and Hollywood have made us believe Putin is Evil.. same way they made Leftists believe Trump is Evil..\nyou get censored if you upload video where Putin expose the DeepState and the Globalist NewWorldOrder..🤔\nPutin hates Deepstate and Globalist, that's why they always lies about him.. the same why they lied about Trump..  wake up!"], ["@aleksey826", "Run??? This word is not applicable."], ["@jaysondzikowski2924", "😂😂😂😂😂 like anyone has a choice. He put his political oppnents in jail....or worse"], ["@SK1T20", "Putin and Biden for 2024. Both magically will win"], ["@Skeptical59", "What third world country has only 2 parties, one with a candidate for re election that cannot be challenged within his party and that is trying to imprison the leading candidate for the other party? That's right it is the good ole US of A!"], ["@user-ff7er1zu5n", "Dont guess Russia is woke, Don't grannie whine to deal with"], ["@FrankGallagherr", "Million times better president than Biden"], ["@Houndini", "I wonder who will win? lol."], ["@Struieboy", "The Russian Presidential Election will take place in March 2024. The results will be declared in January 2024."], ["@Weak_USA_CuckBIackedRaw_9234", "As part of the viewing public, let's acknowledge the substantial talent, time, and hard work involved. I want to extend my gratitude to the highly respected Baihumon rescue team for their outstanding efforts. Your dedication adds greater meaning, significance, and hope, and we genuinely appreciate your commitment. The professionalism and articulate reporting by credible and intelligent journalists provide the best coverage, delivering crucial, recent, and relevant information. Their fair and unbiased reports, objective analysis, and comprehensive reporting are truly admirable. The level of professionalism and immaculate reporting is beyond words."], ["@Weak_USA_CuckBIackedRaw_9234", "In the role of supporters, let's recognize the extensive talent, time, and effort invested in this project. This is an opportunity to express thanks to the esteemed Baihumon rescue team for their exceptional efforts. Your dedication adds greater meaning, significance, and hope, and we truly appreciate your commitment. The professionalism and articulate reporting by credible and intelligent journalists provide the best coverage, delivering crucial, recent, and relevant information. Their fair and unbiased reports, objective analysis, and comprehensive reporting are truly admirable. The level of professionalism and immaculate reporting is beyond words."], ["@Weak_USA_CuckBIackedRaw_9234", "As attendees, let's appreciate the significant talent, time, and hard work invested in this endeavor. I want to convey my gratitude to the highly respected Baihumon rescue team for their remarkable efforts. Your dedication adds greater meaning, significance, and hope, and we sincerely appreciate your commitment. The professionalism and articulate reporting by credible and intelligent journalists provide the best coverage, delivering crucial, recent, and relevant information. Their fair and unbiased reports, objective analysis, and comprehensive reporting are truly admirable. The level of professionalism and immaculate reporting is beyond words."], ["@richierich8081", "I don't ever bet....but I'll bet yep ten bucks Putin wins by lots.i know ten bucks ...hey I'm broke too...Richie Rich poor boy..."], ["@johnanelli5799", "He's in power thanks to Bill Clinton."], ["@yankee2666", "He's gonna run against Lenin, or Stalin. ...Stiff competition"], ["@bl4ckkn1g8t5", "At least he is Russian, meanwhile American politics is the uni party controlled by AIPAC a foreign lobby group"], ["@raybo34", "LOL... that is funny, but then again their election are probably fairer than ours"], ["@clintdaniel9260", "world is upside side down"], ["@voixdelaraison593", "Notice how Fox presents this as a legitimate election but Lies About Our Own REAL LEGITIMATE ELECTION."], ["@chriszenko3598", "Too bad the US  doesn’t have a Reagan type leader the new US republicans are helping Putin"], ["@QanonymousExposer", "LORD PLEASE DO NOT LET THIS HAPPEN AGAIN!"], ["@katiajordan4152", "If you could understand Russian and listen to Putin’s speech, you would like this guy."], ["@user-ef7wj7id6z", "It will be a \"close election\" for Vladimir 😅"], ["@joehernandez1765", "Putin 2024 lmao 🤣 wait I’m not Russian well good luck dude but on the Truth Trump 2024 make America Great again  that will be great to have normal life again come on back to the White House President Trump America is tired of the Treason of Joe biden  and his administration we need you to fix the mess bidens Treason is"], ["@lemontadams3029", "There is no path to victory for Ukraine, and the war has become a massive losing proposition. Nevertheless, Congress is in the process of giving Zelensky another $60 billion in taxpayer money."], ["@grizzlymartin1", "We are fortunate that he is their president. He wants to do business not war. All we want is hegemony and imperialism."], ["@usafirst1646", "He’s like Biden, he tries to get rid of his opponents. He doesn’t want free elections.  The Democrats Way. So unfortunate for the Russian people as well as US Citizens. The parallel is so Communist, right DNC?"], ["@winsomemartinez", "C'mon Russians, vote for Nadezhdin. \nHe wants to stop the \"special operations\""], ["@Miguelbamboo", "Putin the Great ❤"], ["@ange6580", "God bless the white zippered vinyl bags that the Russian sons are wearing back home to mama for Putin"], ["@eduardodelagarza4787", "I love when the anal lysts accuse other dictators of controlling the media when the US is doing far worse with our dictator, Joe Biden Semper Fi and Erin go Braugh"], ["@johnpapa1916", "Who is really running against him . He is a dictator.  And the Russian people dont have the balls to go against him the Russian people are being lied to and they are to stupid to know the truth"], ["@bea551", "JAJAAJJJAAJAJAJAJJAJAAJAJAJAJJAJAJAJAJAJAJAJAJAJAAJJAAJJAJAAJAJJAAJAJAJAJAJAJJAJAAJAJAJAJJAJAAJAJJAAJAJAJJAJAAJAJAJAJAJJAAJAJAJAJAJAJJAAJAJAJAJAJAJ.  SURE He is Communist Dictatorship and He ALWAYS IS GOING TO WIN THE PRESIDENCY OF RUSSIA. JAJAAJAJAJAJJAAJAJ"], ["@jakemiller7010", "Biden’s boss."], ["@ooooooooo11111fjt", "Trudeuas hero.dics stick together"], ["@ilikepinacoladasandgetting896", "In other news, water is wet."], ["@srb2006", "Just a reminder that the number 2 party is the communist party. Meaning putin will easily win"], ["@Slaphappy-_-", "Go Putin!!! Hopefully he shows us Nuke power!!!"], ["@dam8087", "Never, ever forget despicable people in America voted for a traitor who earned the nickname Putins cockholster"], ["@planejanedaniels", "Putin, you're at it again, huh?"], ["@GaryEvans-lt2pn", "This is what TRUMP what's to be ..."], ["@juston69", "Do not think for a moment that Trump is not viewing this announcement with envy - you know if he had his way this what his future in office might look like."], ["@petersnortum2971", "bet that will be a nail biter, LOL"], ["@knelson3484", "Oh gee, I wonder if he'll win?\n(sarcasm)"], ["@bennysantos7876", "TO STOP THE WAR IN EUKRAINE , DON'T RE ELECT PUTIN !"], ["@ange6580", "Vladimir Putin did what Trump wants to do.\nSigned law that  he can run for president until 2036."], ["@YZ250W1", "Donnie wants to follow in Putin's footsteps and be dictator of the US. He would be the dumbest dictator in all of history!"], ["@jonmunch3298", "Election.......lmao. They dont have elections. They have mach elections, kinda like we're having in the US."], ["@demigod1013", "Who is he running against? All his political opponents have either been incarcerated, poisoned, or tossed out windows."], ["@hieronyous", "I HAVE HEARD MULTIPLE TIMES THAT PRESIDENT PUTIN IS VERY SICK.\nYET, HE IS RUNNING FOR PRESIDENT'S OFFICE AGAIN. \nWHAT IS THE TRUTH?"], ["@djtechnique", "Good luck with that"], ["@eltonwashington596", "Good luck President Putin!!"], ["@TTOCSSMITH", "How does a dictator 'run for re-election'?"], ["@grandroofing1604", "What’s the Alert? Is this a surprise? They are at War, he would be re-elected regardless. Stop this Fox, we are not sending more Tax dollars. Why is it that people with common sense knew Ukraine couldn’t win. Now so many are gone on both sides. We could have new roads and bridges and helped the homeless with that money."], ["@sandyelliott3350", "Putin is a great leader.  He takes care of his people.   He's smart and restrained."], ["@tomgolden1673", "Putin running for another term is hilarious,since when do dictators need to announce their candidacy when its a done deal already.\nPutin over the last 8 years has been getting sloppier than his earlier days,he is starting to make big mistakes,"], ["@edwardotero382", "Does ANYBODY in Russia have the guts to run against him ??"], ["@newshound2521", "Fake election. opponents tend to disappear"], ["@andrelotscher280", "I immediately start laughing at Trump Supporters with their silly Red Hats 🤡\n🤣🤣🤣"], ["@Netwirq2", "It's just a \"Special Operation.\""], ["@ange6580", "Trump disgraced America when he bent over for Vladimir Putin in Helsinki on July 16 2018."], ["@SlipperyHill48-tv9rb", "REPUBLICANS ARE.   PRO.    RUSSIAN.      ANTI.      AMERICAN."], ["@mikespak1473", "Well any front runner against Joe end up in Multiple Kangaroo court cases, Putins opponents end up dead."], ["@demigod1013", "Republican comrades are overwhelmingly supportive of a lifelong Putin dictatorship."], ["@themistoclesadmir2997", "Bless Mr Putin..Bless Mother RUSSIA...."], ["@LetsGoBrandon-FJB", "nice thumbnail of biden's puppet master"], ["@tonyd7832", "The only thing i got to say about Putin is at least he does not Condemn half of his Population."], ["@murrygondwana7260", "Be glorious, our free Swampland!"], ["@patricewashington3974", "Evil doesn't age ."], ["@ange6580", "An article in the Kommersant (Moscow newspaper) said that if Trump became the American president he would support Russia's involvement in Ukraine and the Middle East.\nIt also said that the MAGA Republicans have denounced America for being involved in Russia's expansion."], ["@kingstop5495", "Why Have Elections They Just Appoint Themselves Its A Joke."], ["@user-ev2dz9cy8z", "Best president in the world"], ["@georgeamaya772", "HE CAN ROT IN HELL IS WERE HE BELONGS  👹"], ["@goldbud2287", "FJB"], ["@The1313jeff", "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣I'm shocked!"], ["@jjlloyd8017", "The sky is blue, water is wet, and Putin will win. Condolences to any of his opponents and their families."], ["@user-vk3ze2qv6o", "Put Putin on food stamps"], ["@chrisdavis6264", "Maybe a military coupe like the african countries"], ["@voixdelaraison593", "Treasonous Trump will be so happy for Putin. If TT is re elected he can give Putin the Destruction of NATO & the Keys to Ukraine as a gift."], ["@UnitedWeStandFreedom", "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 That's all i have to say !! He needs to go he's destroying Russia."], ["@binaryblue8179", "Putler the evil isn't running.  He's stealing like he does every year."], ["@proudcalifornian9914", "Vladimir Putin’s useful idiot trump has successfully directed MAGAcult Republicans to sabotage US aid for Ukraine thereby insuring a victory for Russia. Thats how fkDup the Republican Party of Reagan has become under the 4 time indicted criminal psychopath trump"], ["@kissmyaxe531", "Putin is a Biden wannabe dictator."], ["@Swingsetbalnis8035", "Putin is much better than joe"], ["@pjbassman2253", "Of course he's the front runner. Any opponent suddenly ends up dead."], ["@PatootysManyMisadvetures", "This news makes Trump very happy."], ["@chad6326", "Putin is a G"], ["@ange6580", "When his opponents are imprisoned he stand a good chance of winning"], ["@NickPorter-ui7st", "Of course all the Trump supporters will vote for him."], ["@matthew90276", "Putin will win with 120 percent of the votes. That’s how it works in these countries"], ["@williamcunningham6442", "Trump and portion of my republican party have become nothing but Putin Boot Licking traitors so they should love this!"], ["@Jaja01915", "Putin shouldn't even say it's a campaign. He should just elect himself president again..."], ["@swampfox5660", "A free election in Russia???\nNow I've heard it all."], ["@dag4836", "Do you really run for election in Russia?"], ["@MrCrackermann", "😂 Trump dreams of being Putin, elections are a show.😂"], ["@winsomemartinez", "Fox News immediately throws support behind Putin."], ["@mashedpotatoescsgo6331", "This man needs to be taken out back not to be put into power again."], ["@trailmark4504", "Homelessness is the evil of all evils.\r\n\r\nNot allowed to use the bathroom or go to sleep turns the body against the mind. The worst part of it is that it is the law that is making it happen. For a homeless person it is the same as being judged by God going to hell in your consciousness even before you die when your soul is judged in righteousness. If you are an honest person realizing that you are not perfect you will know that eternal hell is still there when you die. Having to endure two hell's destroys any mind to the soul. A rich person can go into outer space and look down on the world passing his judgment in spirit down to his children till the end of time. In the world today it is society that drives a person who has nothing to go to war with a God to survive he cannot win. A world that is trillions of dollars in debt should not be allowed to make this happen. It is ignorance that a person has to live in the streets when science is making affordable housing less than $10,000 a unit. There is a little over 500,000 homeless in America. Bill Gates can end homelessness for only $5 billion and still pass his spirit along to the end of time on his copyright laws."], ["@Sonichu_", "PUTIN 2024 !!!🇷🇺🇷🇺🇷🇺"]]