[["@sanseb17", "It s not easy to put this man in a corner,he talks arround every topic. He talks a lot but says not to much...he s a master in deny and puting up smoke arround everything"], ["@JamesQuinn-yw1dn", "Tucker who.this man isn't scared of death"], ["@richardmartin3127", "Clarity from a real cavalier president, communicating, perseverance with a noddy, answering realistic without slag,all awhile composing diligence."], ["@richardmartin3127", "Americans need to wake up to reality, your not great, your actually laughable."], ["@richardmartin3127", "Mighty proud of Pres Putin lets imbecile talk,puts him in his place so often typical of usa blame game 😂govt, insinuating everything bad about others,when it comes to them.....its top secret. But hey monkey see monkey do. Cant see jo last an interview, another babbling ruse of lies. Laughing stock of the world."], ["@richardmartin3127", "Reporter is like jo n jump, pitiful. More mouth."], ["@richardmartin3127", "Reporters an A class clown."], ["@richardmartin3127", "American stage queens  dump n jo need a real president like Russia. Good support from citizens,and not sheep."], ["@richardmartin3127", "President Putin engages thought,before opening his mouth. Unlike the jesters from usa,stage queen from Ukraine who open mouth & be thought of as a fool in so removed any doubt. But i guess you're been vaccinated too,baaaa ha ha."], ["@HappyFencers-dj2pz", "Putin is a BOSS,NATO should be disbanded and im sure if AMERICA and Nato,,G7 is not needed anymore because president Putin doesn't want to go near Europe or America, remember this is an American proxy war,just stop and talk to president Putin soon"], ["@annielynebron5778", "God afternon po mister prisedente.. hat kayo diin ser maraming salamat po salahat god bleess po ty grade3..12 years old..❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"], ["@neonone9164", "we are fed a certain narrative, putin is a very rational person.   his aims simply don't allign with ours. we have to agree to disagree.  not make enemies if they dont agree with us."], ["@neonone9164", "u dont see biden doing interviews.  putin is not as bad as media makes him out.   he is open to speak his position.  i respect that"], ["@psss394", "In the next few years (these) owned medias would stop interviewing Putin for some reason. The reason is in the air."], ["@psss394", "If the interviewer was Tucker, I wander what (these) medias would say about him.😊"], ["@psss394", "Putin’s win the attack…to be honest🤪"], ["@goinsouth5187", "Putin skirts around questions by constantly replying \"maybe you should ask so and so\". But the interviewer is asking you, Mr. Pukin."], ["@elenakotlyar4071", "The best president in the world 🌍🇷🇺💪"], ["@TheGreat83", "Vladimir Putin said “ I CONTROL THE TIME “ hahahaha😂😂😂 he put that journalist in check QUICK.. 😂😂😂"], ["@josemanueljara522", "Outdated. Prefer Tuker Calson!"], ["@alexfeidenheimer8116", "Я, честно говоря, в шоке, что американцы такого хорошего мнения о Путине!!! Нужно жить всем дружно!!!"], ["@bobbysausagefingers4405", "Wait i thought mai stream media said 2 weeks ago your not allowed to interview leader of the opposition"], ["@UnWantedUL", "Bună ziua🎉 până  se tragE aerul democrație, să se faCĂ Z-ul istorie cu picioarele pe pemânt și să ne aducem aminte că  ucraina  lui ZELENSKY este responsabilă pentru dezastrul CERNOBÂL. deci îmi doresc pentru toți ce vă puneți scut pentru zelensky să fiți INTEROGAȚI DE CĂTRE, KGB."], ["@eriktytan9159", "😂😂😂😂"], ["@borysdewar9741", "I wish it was Joe Rogan making this interview."], ["@user-hp2lh6gq5y", "Великий человек и Лиде!!!"], ["@GabrielTalarovic-hb2rk", "es ist unvorstellbar das der us Komiker, irgend eine frage eines Russen Journalisten beantworten kann, da die us Administration es gar nicht zulassen würde"], ["@greglander5227", "See this MSM is pushing the cyber attacks The deep state are going to use on America. They are pushing WWIII as they know they are all about to be arrested and put in GITMO. MSM will also all go to PRISON for this collusion against Americans!"], ["@greglander5227", "Look at the MSM trying to push an agenda, his is why Putin has not interviewed with them."], ["@greglander5227", "Biden is a puppet for Obama, both will be found guilty of Treason!"], ["@ngangirae-lu6nx", "Happy weekend travelling to another town."], ["@annielynebron5778", "Gostu kopo pomunta jan sa inyopo kasi matagal konapo yong pangarap hitu maka ponta ako mule.. kasi gostu kopo dahil nangako po ako sa sarili kopo nohun.. dalawa po yong pinangako ko sa sarili kopo nohun.. gosto kopo yong pag babakasyon kopo dito sa pilipinas yong hisang tahon po nakaka dalawang beses lang ako maka ponta sa bansa namin yong bakasyon kopo yong berthday kopo hat new.year.. yong hisang tahon bakasyon kopo sa pinas ngaun.. yon lng po ty god bless ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"], ["@annielynebron5778", "God afternon po salahat po ty god bless four u..four me.."], ["@annielynebron5778", "Yong 45..46.. yong 91..4..95.. yong 5..90..95..yonpo. hibig sabihin hhmmmm.. yonpo syorkat hhmmm. Ty. God bless"], ["@annielynebron5778", "Khit hinde kopo tinanggap nohun yong pera ko.. yong binigay sa akin nohun.. kasi hinde pa ako nasa tamang edad kopo nohun.. pangatlo napo yon..2.hisa..tatlo lahat. 12.rear.old..grade.3...ty god bless ❤.❤❤..❤❤❤.."], ["@annielynebron5778", "Hinde kopo gostu yon sabihin ngaun.. kaso lang po mahalaga po malaman po nila sa boung mondo.. kayapo napilitan lang ako sa sarili kopo ngaun.. kahit po nahihiya po ako yong ginagawa po nila sa akin yong pag sesera sa akin nohun.. kahit masakit po para sa akin yon.. tinitihis ko nlang ngaun.. khit hinde kopo gostu mag coment po ngaun napilitan nlang ako sa sarili ko ngaun khit nasaktan ako ngaun yong ginawa nila sa akin masama daw yong experyens ko nohun... kong masama po yong experyens ko nohun hinde po ako makakabohu yong experyens kopo yong hikakabote yong experyens ko nohun.. khit masakit sa akin ngaun yong ginawa ako nila masama yong experyens ko nohun.. tinihis ko nlng yong sa sarili ko ngaun.. yon lng ty god bless.❤❤❤"], ["@annielynebron5778", "God morning po salahat jan.. alam kopo yon yong hibig sabihin poyan. Dahil hisa nlang yong hinihintay yong para matapos na lahat yong pag aaral ko ngaun. Dahil alam kopo yon lahat.. kasi hinde kopo kaya yong sarili ko... dahil hinde po ganon yong experyens kopo yong masama hinde mabote para sa akin or sa beastfriend kopo nohun.. yong experyens kopo porus hikkabote yong bansa yong beastfriend kopo nohun.. kaya hinde kopo kaya sabihin sa sarili ko hhmmmmm.. dahil alam kopo yon.. dahil mahaba po yong tanong yong 5..25..45.mahaba hangang 95..yong limakatoheg..hat dalawa.katoheg...hat hisa.katoheg..alam kopo yon hibig sabihin yon.. yong mabilis poyan semple lang bagay yong tanong nayon.. yong dalawang.tahon.38... hat tatlong.tahon..57.... 38..57..95.. yong syorkat kopo yan yong hibig sabihin poyan yong sentens kopo yon 59.. tapos balektaren yong sentens kopo yong 59....yong lemang.tahon.po.yong.95.. yonpo.. semple lang tanong kopo hhmmmmm.. tapos napo lahat nang pag aaral kopo 6.7..23..13..15..lahat nang pag aaral kopo yonpo ang hole yong pag tatapos ko yong pag aaral kopo ngaun.. 4.20..24..hole napo lahat.. yong 1.2.3.. yong hibig sabihin po yon... hisapet yong 1.2.. yongpo 12..years.old kopo... yong 3..poyon.. yonpo ang grade.3..kopo yon..yon lngpo yong tanong hhmmmmm. Hinde kopo kaya yon sabihin kasi mahal kopo hhmmmmmm. Nohun hangang ngaun po.. kayapo masakit po para sa akin yon sa posu ko. Hat sa sarili kopo. Hat sa hhmmmmm. Ty god blesss ty love ❤..❤❤..❤❤❤..😢😢😢😢😢😢😢."], ["@ed.miles.5029", "This American journalist gave him really good and direct questions. For example: where and why all his political opponents disappeared ? Will he commit now, not to send any russian troops in to Ukraine's territory ?"], ["@germanstarkin6967", "Мерзость…"], ["@naweedzazai7258", "The journalist is a propagandist surely! Actually, the whole Western media is propagandising"], ["@naweedzazai7258", "Putin is a great communicator. Respect for Mr Putin!"], ["@viktorkovach8772", "Mister President, Are you a Killer ???😂😂😂😂....So, when Russian journalist Can ask this question Face to Face to American president, I will believe that Americans are trully Democrats ! ,But the question is Of Democracy will be capable to sing, Like Slaves are singing about her !!??..😅😊😮😢😂"], ["@user-mx2bo6gy9x", "What a stupid investigative questions  ."], ["@kristinakuzyaeva8524", "After 2 yers putin killed Navalny"], ["@kristinakuzyaeva8524", "Putin is killer"], ["@alexeypodolsky9710", "This NBC interviewer is awful - as his voice, as his stupid questions, as his crazy logic."], ["@Grryograu777", ""], ["@jr9240", "Putin is right"], ["@ricardomews3597", "a lot of bull propaganda"], ["@annielynebron5778", "God afternoun po yong finaI napo yong full. Napo yong putin...gote.. yon lng po ty po."], ["@cindyandsuziq", "Sorry but it got really tiring of you and your Biden, Biden, Biden.... Who said Biden has any influence on what this man thinks and does. Does the USA control everyone's country. Christ another interview where Putin showed intelligence over Americans."], ["@annielynebron5778", "God morning sa lahat jan.. yong firs.time palang nya pomasok yong 017. Tapos yong pag labas nya 020. Pomunta po sya dohun sa dulag si gote. Off. Tapos nakalipas yong tahon nayon.. nakahowe napo sya 021 yong 6.month. si gote.. pag dating nang tahon nayon yong 022. Bomalek nnaman sya.. tapos nakalipas nang tahon yong 023.. nakahowe po sya sa bahay nila si gote.off.. yonpo ang totuho.. tapos yong part.2.. nman hhmmmmm ni gote.. hmmmmm... ty po god bless."], ["@JohnAnglin-lh7bs", "Is Putin lying?"], ["@IsidromCruz", "This inglish guy is stupid"], ["@annielynebron5778", "Saan po ako mag cocoment.. gostu kopo yong firs time. Pala sya hat pangalawa po nman yong pag balik nya po. Yon lng po.ty"], ["@annielynebron5778", "God morning po mister prisedente gosto ko napo sagotin yong kwesyon mo.. para matapos napo. Lahat papayag napo ako ngaun. Yong lng po ty god bless.❤❤❤"], ["@blaaaaaaaaahify", "The interviwer is not a friend. He's there to ask the tough questions, questions that were on milions of people's lips. The interviewer is there to communicate these and get an answer, not to judge the decisions behind the actions, real or not. This is how an interviewer should be, this is what media should be. I was interested in pretty much all the questions asked."], ["@vuyosayasholento3714", "2024 just checking and collecting Putin to see what they is bad! But so far all the time Western Countries are fooling us 😂"], ["@BrettFairchild", "38:35 💀"], ["@zarema5351", "* ,, ❤🍒❤💜👫💜👫💜👫💜👫❤ ПРАВДА 🦁🐯🐻🍯и 💎💦☔💎💦☔💎💦☔💜СПРАВЕДЛИВОСТЬ❤👱👮❤ РОССИИ и💎 ПУТИНА💎💎❤👱❤🌕❤ НУЖНЫ 💙🐦🌍❤ ЧЕЛОВЕЧЕСТВУ 🌏✌🌏🌐✌🌏🌐❤🌊🐬🌊🐦❤💜🌕❤ ПРЕЗИДЕНТ ❤💙🤍❤РОССИИ  ПУТИН 🍒-- ЭТО❤  РОДИНА ❤👱❤👮❤, ОТЧИЗНА❤👮❤, ОТЕЧЕСТВО❤, ПОЭТОМУ НАРОД  ВСЕГДА С👮👱👮👱👮👱❤  ВЛАДИМИРОМ❤ ВЛАДИМИРОВИЧЕМ ❤👨❤ ПУТИНЫМ👮❤, каковы  бы ни были  Его решения❤ В 🌕🐦Безукоризненном 🍒❤❤, Безупречном ❤🖼🖼🖼🖼🖼❤ Служении России❤ ПУТИН❤ НИ  РАЗУ  Своё  ЛИЧНОЕ  Я🙋❤ НЕ ❌⛔🍒❤ ПОСТАВИЛ 🍒❤ ВЫШЕ 🍒❤ ИНТЕРЕСОВ  СТРАНЫ ❤💖💖💖💖💖💖💖💖💖❤ZA PUTINA👍🇷🇺 ZA PUTINA👍🇷🇺 ZA PUTINA🇷🇺🇷🇺🇷🇺❤🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼❤ЗА💎 ПУТИНА💎 ЗА💎 ПУТИНА❤СИЛА ❤ ДУХА и💎☔💎 СИЛА❤ СПРАВЕДЛИВОСТИ❤ ЗА💎 ПУТИНЫМ👮❤  ПРАВДА 💙🍒❤ ПОДДЕРЖКА ВСЕГО🐦❤ Многонационального ❤и 💎 Многоконфессионального РОССИЙСКОГО  НАРОДА❤🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼❤☀🌝🌞❤🌃🌙❤⛪💒💒⛪💒❤⛅☁🌠❤🎇❤🍒❤🌌🌟🌌✨🌟🌌🍒❤🎇🎇🎇🎇🎇🎇🎇🎇🎇❤ Салют🎇❤ ПОБЕДА🏆❤❤🎇🎇🎇🎇🎇❤ САЛЮТ❤🌕💜🐦❤🍒🐦💙 Салют ПОБЕДА🏆❤💙🐦💙, ВО  ИМЯ ❤💃❤ СЧАСТЬЯ 💙, МИРА 🍒❤🍒❤, ТРУДА и💎💦☔💎💦☔💎💦☔ 💜❤ ОТДЫХА❤ДА ЗДРАВСТВУЕТ  ПУТИН🌕💃🌕💃🌕💃🌕💃🌕💃🌕💃❤ ДА ЗДРАВСТВУЕТ  МИР🌏❤ Между  Народами ✌🌏🌐❤ Стран  Всех  Пяти ❤ Континентов  Планеты Земля🌎🌐 🌍🌎🌍 НАШЕГО  ОБЩЕГО  ДОМА❤РОССИЯ ❤ УКРАИНА ❤ БЕЛАРУСЬ ❤ -- ❤ ВМЕСТЕ👭👬👫❤ СВЯТАЯ  РУСЬ❤❤  УКРАШЕНИЕ КРАСОТА и💎💦☔❤ ЗДРАВЫЙ  СМЫСЛ 🍒 ЧЕЛОВЕЧЕСТВА❤ ❤💛💙❤😘❤😘❤😘🐦🦁🐯🐻🦁🐯🐻🦁🐯🐻🐒обезьянка по гороскопу Я ❤Братья👬👬👬❤  наши 🐶🐕🐩❤ меньшие  не такие  звери 🍒 , Какими стали люди🚹 / некоторые / ВСЁ  ОБРАЗУЕТСЯ ❤, В 🌕🐦Мире Много УМНЕЙШИХ МУДРЫХ ОТВЕТСТВЕННЫХ  Как  ВЛАДИМИР  ПУТИН🌕 💎 ЛИЧНОСТЕЙ и 💎💦☔❤ ЖИЗНЬ💙 ВЕЧНА и 💎💦☔💎💦☔БЕСКОНЕЧНА 🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼❤ РОССИЯ ЗАКОНЧИТ  ВСЕ  ВОЙНЫ👪❤ В МИРЕ🍒❤ , ПУТИН ❤ МИРОТВОРЕЦ ❤ ГУМАННЫЙ  ПРАВИТЕЛЬ❤  УЧИТЕ  Самый  НЕ❌⛔🍒 💎❤  НЕАГРЕССИВНЫЙ❤ ВЕЛИКИЙ  ЯЗЫК  НАРОДА  БЕССРЕБРЕНИКА и 💎💦☔❤  ДОБРОДЕТЕЛЬНОГО 💜, Имеющего  Чувство  СОСТРАДАНИЯ  даже к Врагу❤"], ["@ngangirae-lu6nx", "Thanks for concern, this time is from who. Very interesting."], ["@zarema5351", "* ,, ❤🍒❤💜👫💜👫💜👫💜👫💜👫🍒 ВЫ  ЗНАЕТЕ 💜☔☔☔☔💜🍒, Что🍒 МОЁ 🍒❤💜☔☔☔🍒💜 первое место Работы❤ было  КГБ❤ СССР ❤ ВНЕШНЯЯ ❤☔☔☔❤ РАЗВЕДКА❤☔☔☔❤, И 💎💦☔❤ Нас🍒❤💜🍒❤ Там ВОСПИТЫВАЛИ ОПРЕДЕЛЁННЫМ  ОБРАЗОМ❤ Это Воспитание ❤👱👮👮❤👱❤ Заключалось 💙💜🍒❤ в ❤ Абсолютной 🐦☔💜🍒❤ Преданности❤ ☔☔💜 Своему народу🧡💙🧡💙❤💜 и ГОСУДАРСТВУ 🐦🧡💙❤ ПОБЕДИТЬ 🎇🎇🎇🎇🎇🍒 для Разведчика❤, -- Значит  показать ❤🍒🐦❤ Своё  Превосходство❤, Следуя при этом 💎💦☔🍒❤ Определённым 📚📕📔🖼❤ ПРАВИЛАМ  ЧЕСТИ и💎💦☔ ДОСТОИНСТВА ❤ ❤💞❤💞❤💞❤💞❤💞❤💞❤💞❤ ПРЕЗИДЕНТ❤💎💎🌕❤🖼❤💎❤ РОССИИ 💙❤🍒❤ ВЛАДИМИР 💜🧡❤🍒🍒🍒❤ ПУТИН🌕💃🌕🌕💃💃💃🌕💃🌕🌕🌕❤💜💜❤🍒❤💜❤ 27.12.2023г.  👼🙏❤👼🙏❤👼🙏❤👼🙏❤👼🙏❤👼🙏❤👼🙏❤🧡"], ["@zarema5351", "* ,, ❤🍒❤💜👫💜👫💜👫💜👫❤ ЧТО🍒 ОЗНАЧАЕТ❤💜🍒❤ СУВЕРЕНИТЕТ❤💙🍒💜🍒❤ Для🍒 Нашего Государства👱❤, для🍒👯🍒❤ каждой❤❤ СЕМЬИ👨👦👧👩👴👵👨👦👧👩👴👵👱, для каждого человека 👪👪👪❤❓❓❓❤🏠🏡🏨 💖💖💖❤💖💖💖❤💖💖💖 В чём Его смысл ❤❤🖼🖼🖼❤, Ценность❤💃💃❤🍒❤ Реальное ❤💃💃💃💃❤🍒❤ Наполнение ❤🎻🎻🎻🎻🎻❤ ❓ ❤ Это прежде❤ Всего❤🐦❤ СВОБОДА🐦❤💎🐦❤❤🐦❤🐦🍒💜❤, Свобода  для РОССИИ 👮👮❤, Для нашего  Народа 💙🧡❤, а 🧡🐦🧡 значит 🐦🐦💙🧡❤ для каждого из 💙🐦💙🍒 нас🍒❤🐦🌕☀🌕💙🐦❤, потому что🍒😌🍒😌 💙 нашей ТРАДИЦИИ ЧЕЛОВЕК👨👤🚶 НЕ❌⛔🍒 Может Чувствовать себя 🌕☀🌕☀🌕❤ СВОБОДНЫМ❤ , Если 🍒🍒 Не Свободны Его близкие  , Дети👶👶🍼👶👶👧❤, Его  ОТЧИЗНА❤Именно🍒 такую Подлинную Свободу Защищают  Сейчас☔☔☔ 💜 Наши  ПАРНИ👫👬👭👫👬👭👫👬👭❤☔🚀🚀🚀🏀🚀, Наши  Мужчины❤, Солдаты и💎💦☔💎💦☔💎💦☔ 💙👮 Офицеры 💜💙❤🍒🐦💙, Дочери 👸👸👸👑❤ 💙 ОТЕЧЕСТВА❤💎 СВОБОДНОГО  НАРОДА🐦❤, которые☔ понимают❤ Свою Ответственность❤Перед  Сегодняшним днём 🍒❤ и 💎💦☔ будущими ❤ Поколениями❤👪👪❤🐦❤ Единственный❤ 🌕☀💙🍒❤ Источник  Власти❤, 🍒❤ Власти ❤ Суверенной❤, которая  призвана ❤🥰😌❤ Служить Всем❤👪👪👪👪❤, Всему  Народу❤👭👬👬👫❤, а 🧡🐦🧡🐦 НЕ🍒❤ Обслуживать Чьи-то 😍🍒❤ Частные❤🌇🏢🏦🖼❤ Корпоративные 💙🐦❤🍒❤, Сословные  , 💜😌🥰❤ тем более  Чужие 🍒🐦❤, Иностранные  Интересы 🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼❤🌹🌺💐🌹🌺💐🌹🌺💐🌹🌺💐🌹🌺💐🌹🌺💐🌹🌺💐🌹🌺💐🌹🌺💐🌲🌲🌲💎🐦❤💕💖🌕❤ В. В. ПУТИН🌕💃💃💃💃💃💃💃🌕💃💃💃 💃🎤💃🎤💃🎤💃🎤💃🎤💃🎤💃🎤❤ 27.12.2023 год ❤🎒🏫📚🎓🎒🏫📚🎓🎒🏫📚🎓❤👼🙏❤👼🙏❤👼🙏❤👼🙏❤👼🙏❤❤⛪❤💒❤❤💞❤💞❤💞❤💞❤💞❤💞❤💞❤🖼🖼🖼❤💃❤👱❤🖼🖼🖼🖼🖼🖼🖼🖼🖼❤🌄🌅🌇🌄🌅🌇🌄🌅🌇🌄🌅"], ["@zarema5351", "* ,, ❤🍒❤🦁🐯🐻🍯🍯🍯🍯🍯❤ НАДО🙏 ВЕРИТЬ🙏🙏❤👱❤ В 🌕 ВЕЛИКИЙ👍❤👮👮👱❤👨 РУССКИЙ❤Российский НАРОД💃 👰👸❤👪❤ В этой ВЕРЕ  УСПЕХ 👪❤👪❤ Возрождения❤ 👶👧🚼👶❤ РОССИИ❤💃❤🐦💙😌🍒❤ МЫ🦁❌👱🦁❌👱🦁❌👱 ДОЛЖНЫ❤ ПОМНИТЬ❤💃❤ и 💎💦☔ ДЕТЯМ Своим  НАКАЗАТЬ 💜🥰😌💜 ,, РОССИЯ💙 или❤💙🤍🐦💜 будет👍👍❤🏠🏡🏨💙🐦💜 Суверенной ❤🍒💙 Самодостаточной 🐦❤🍒💙 ДЕРЖАВОЙ❤, или 🍒🐦 Её  вообще НЕ❌⛔🍒🍒 💙🐦💙❤🧡 будет 💜❤🧡🦁🐯🐻🦁🐯🐻🦁🐯🐻🍯🍯🍯❤🖼🖼🖼🖼🖼🖼🖼❤🌲❤🌲❤🌲❤🌳🌳🌳🌴🌳❤🌊🐬🌊🐦🐦🐦❤🌕🌃🌙💙🧡🏇💎🎇🎇🎇🎇🎇🎇🎇🎇🎇❤💙 В. В. ПУТИН ❤💕💖❤💕💖❤💕💖❤💕💖💖💖💖💖💖💖💖💖💖💖💖❤⛪💒❤👑🔱🏰💙🐦💙🌕🐦🌕🐦🌕🐦🌕🐦🌕🐦❤"], ["@zarema5351", "* ,, ❤🍒❤ Для  Такой СТРАНЫ  , как  РОССИЯ💙 🌠💙🐦💙🌌🌟💙⭐🌠🌟⭐🌟⭐🌟⭐🌠⭐🌟⭐🎇🎇🎇🎇🎇🎇🎇🎇🎇❤🍒❤🐦💙❤ НЕВОЗМОЖНО ❤🏰❤💎❤ СУЩЕСТВОВАНИЕ🍒🐦💙❤ Без СУВЕРЕНИТЕТА Поэтому для нас ГЛАВНОЕ❤💙🤍🐦❤ УКРЕПЛЕНИЕ ОБОРОНОСПОСОБНОСТИ❤💙❤🍒💙🐦❤ СТРАНЫ 💙🐦🐦❤, БЕЗОПАСНОСТИ ❤ 💙🐦💙❤ ПО👮☔👮☔👮☔ 💙🐦💙❤ ВНЕШНЕМУ❤  🌊🐬🌊🐬 💙🐦КОНТУРУ💙👪❤ Общественного❤👶👧🚼❤ Суверенитета 🍒💜❤💙🍒❤, ПРАВ и 💎💦☔💎💦☔💎❤ СВОБОД❤💜💙🐦💜💙🐦❤ ГРАЖДАН👪👪👪💜💙🐦💜👫💜👫💜👫💜👫💜👫💜👫💜👫💜☔💜, Развитие политической ☔💜 Системы 💜☔☔☔☔☔☔💜, это безопасность💙 И 💎💦☔💜 СУВЕРЕНИТЕТ 🐦💙💜☔ В Экономике и💎💦☔☔💜 Культуре 💎💃💃💃💎💜, Технологический 💙🐦💙💜 СУВЕРЕНИТЕТ❤💖💖💖💖💖💖💖💖💖💖❤❤💕💖❤💖💖💖❤💕💖💖💖💖💖🌹🌹🌹🌹🌹🌹🌹❤❤💞❤💞❤ ПРЕЗИДЕНТ 🦁🐯🐻❤🍯❤ РОССИИ 👮👮👮❤👱❤ ВЛАДИМИР💙💙💙🍒❤ ВЛАДИМИРОВИЧ ПУТИН🌕💃❤ 14.12.2023 г. ❤💞❤💞❤💞❤💞❤💞❤💞❤🖼🖼🖼🖼🖼🖼🖼🖼🖼❤👼🙏❤👼🙏❤👼🙏❤👼🙏❤👼🙏❤🙌👏🙏🙇🙌👏🙏🙇🙌👏🙏🙇🎒🏫📚🎓❤"], ["@zarema5351", "* ,, ❤🍒❤💜👫💜👫💜👫💜🍒❤🍒❤💜🦁💜🐯💜🐻🍒💜☔☔☔☔💜☔💜🍯🍯🍯🍯💜🦁🐯🐻🦁🐯🐻🍯🍯🍯💜☔💜* ,, ❤ ВОТ❤🌲❤🌲🌲💜☔💜 ПОСЛУШАЙТЕ ❤, ПОСЛУШАЙТЕ ❤, ЧТО🍒❤ Я 👱❤  СКАЖУ ❤👮👱🍒❤👨💖 Внимательно❤💖🍒❤ ПОСЛУШАЙТЕ 💖 🖼🖼🖼🍒❤ 💖💖💖💖💖❤ Ведь❤ в Доктринальных 🍒❤ Документах ❤ Самой❤ УКРАИНЫ❤ НАПИСАНО🍒❤, Что Они собираются 🐦🍒❤ вернуть  КРЫМ 🐦🐦🐦🍒❤, В том числе 💙и 💦💙🐦🚀 Военным  Путем 🐦🏀🚀🚀Это СУВЕРЕННАЯ 💎❤🌕❤ РОССИЙСКАЯ 🇷🇺🇷🇺🇷🇺❤ ТЕРРИТОРИЯ ❤💙🤍❤💙❤ ВОПРОС❓ для🍒❤ 🍒❤ НАС В 🌕🐦 ЭТОМ🐦❤ СМЫСЛЕ ❤ ЗАКРЫТ❤  Представим 🍒 , Что😌🍒❤ УКРАИНА  --  СТРАНА  НАТО и 💦☔ НАЧИНАЕТ 🚀🚀 эти Военные операции 🚀🚀🚀 ❓ НАМ  ЧТО🍒 ❓, Воевать с 👮👱блоком НАТО ❓🖼🖼🖼 ❓❓ 🖼🖼🖼🖼🖼🖼🖼❤❤❤ Ну 👤👤👤❤ Кто-нибудь об этом хоть Что-нибудь ПОДУМАЛ  ❓❤  ПОХОЖЕ  ,  ЧТО😌🍒  НЕТ🚫 🖼🖼🖼🖼🖼🖼🖼🖼🖼🖼❤🍒❤ ПРЕЗИДЕНТ  РОССИИ ❤👱❤  ВЛАДИМИР❤👱👮👮❤👱❤👮❤ ПУТИН🌕❤💖💖💖💖💖💖💖💖💖💖💖"], ["@zarema5351", "* ,, ❤🍒❤💜🌕💜👫💜👫💜👫💜👫🍒❤🌕💜🌕💜☔☔💜🦁🐯🐻🍒🦁🐯🐻🍯🍯💜🦁🐯🐻🍯❤ ПРЕЗИДЕНТ РОССИИ ❤ ВЛАДИМИР❤💎🌕💎🌕💎❤ ПУТИН🌕 💜💙💜💙💜💙❤🌕❤🌕☀❤ это👉 СОЛНЦЕ  РАЗУМА🍒❤ Всего  ЧЕЛОВЕЧЕСТВА ВЛАДИМИР ВЛАДИМИРОВИЧ ПУТИН🌕💃🌕💃🌕💃❤ такой же❤💎❤💎❤💎 Редкий Алмаз❤💎❤💎❤, как  ,, Алмаз 💎❤💎❤ Граф  ОРЛОВ ❤* ❤💃❤ В 🌕🐦🌕🐦🌕🐦❤💜❤🐦❤ РОССИЙСКОЙ🦁🦁🦁❤❤❤ КОРОНЕ 👑🔱🏰👑🔱🏰👑🔱🏰👑🔱🏰❤👑💎👑💙🐦💙🐦💙🐦💙🍒❤👑❤💖💖💖💖💖💖💖❤ 🖼🖼🖼🌹🌹🌹🌹🌹🌹🌹💐"], ["@CROSSFACEWRESTLING", "I am here on account of new accusations of Russia allegedly wants to settle its weapons in the space"], ["@user-kj2cy1tm4u", "❤❤❤❤❤❤❤❤🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁🦁"], ["@Arkoudeides.", "All Hail Saint Vladimir Poutin ❤"], ["@goldenaye3", "Kier ask some stupid questions, why should Russia critizes China, China's internal affairs is China's, maybe Putin should ask kier about the daily shoting of black people by police in America"], ["@laminjatta7491", "Putin, don't answer this rude question. Ask him who killed Saddam Hussain, Gaddafi of Libya 🇱🇾 and"], ["@laminjatta7491", "Stupid journalist, if Putin is a killer. What about the US 🇺🇸 presidents are not killers too ? darn they go after a sovereign nation  president and killed them. Is true Mr. President putin, you are right."], ["@laminjatta7491", "Thank you Mr. Putin before you accused someone else for wrong doing check yourself first for the same thing"], ["@user-jp8pd5ss6j", "Cheap ways to intoxicate"], ["@xlewybx1586", "I can see it in putins eyes that he's lying with the iran question😂😂"], ["@user-ly9gg4dc8g", "Putin is a genius. World class and expertly handled. Proper"], ["@georgegunnell6319", "This guy interviews as though for the National Enquirer. Good on Putin for indulging this amateur."], ["@mohammednuredin9220", "The dummest journalist ever 😂😂😂"], ["@harryhyperboreanivanhoe6374", "Очень хорошо что журналист был таким😸"], ["@BogdanZelinschi", "Где перевод ептить"], ["@TheEvilclown73", "The interviewer isn't very bright is he."], ["@eddieokpara3549", "\"Biden has a very good memory.\" Putin and sarcasm 😂"], ["@elizabethmadoka7736", "Very wise words from King Solomon,   There  is time for everything eg time to be born and a  time to die..  Seen the time used like chasing the wind. Ecclesiastes 2.26 and 3:2.,\nLord God let Your Mission continue as Your Will."], ["@AnayetullaAnayetulla", "Ami banar na manosh"], ["@AnayetullaAnayetulla", "Sari"], ["@AnayetullaAnayetulla", "Jar janna ami amirika jata cai ta ha la allah opara ja ta ra j paibi"], ["@AnayetullaAnayetulla", "Opara"], ["@AnayetullaAnayetulla", "Asmanar"], ["@AnayetullaAnayetulla", "Opara nai"], ["@AnayetullaAnayetulla", "Allah"], ["@AnayetullaAnayetulla", "Kam"], ["@AnayetullaAnayetulla", "Allah"], ["@AnayetullaAnayetulla", "Ami cai amarica jaitam"], ["@AnayetullaAnayetulla", "No"], ["@AnayetullaAnayetulla", "War"], ["@AnayetullaAnayetulla", "Ami"], ["@AnayetullaAnayetulla", "Dak bai"], ["@AnayetullaAnayetulla", "Like dai"], ["@AnayetullaAnayetulla", "Potin sar"], ["@ngangirae-lu6nx", "Thanks alot only do narcissists change..maybe got new hearts , taking care .The Lord God be with you....."], ["@nataliag2515", "Floods of kremlin trolls are obvious!)))"], ["@christinebenevento9682", "I had such beautiful Russian neighbors. I, can not resist you. You, should thank them for such a love for you. Now, I am guilty of it too. All the best Putin. I hope you understand English."], ["@christinebenevento9682", "🎉"], ["@FROMlefttoRightasdfghjkl", "Can you do a. 'Backwards Sumersault Roll' and Roll around on the Floor for The Pope?"], ["@camillamattsson7235", "Putin is a really really sick person🤮\nPleas wake upp people"], ["@mugishadidier6961", "12:10 Libya story from here we all know truth 😢"], ["@magdadrague", "What a cheap journalist. Zero class in his behaviour."], ["@HarlinSumampouw-dp2rs", "👌👍😑Naik motor aku mau➡ hanya bisa jadi orang☑👤🚹 yang💗🤗🏁 telah bisa jadi dengan Stills trusted speedmart layanan Telkomsel news Channel TV yang🤗🏁💗 bisa mengertilah"], ["@HarlinSumampouw-dp2rs", "Yes kangen jugak maunya sama aku mau look?"], ["@HarlinSumampouw-dp2rs", "Like👥 gambar📷🖼 atau photo of love you ok kak👍 Yunda keseruannya for rp☑ care selfie📷💁 dengan💕 orang☑👤🚹 yang🤗🏁💗 bisa🎥👉🔚 jadi lebih👥🏧 besar😁👍💪 untuk berubah tetap ada🏧 yg➡🔚 bisa👉🔚 DM agar terpantau not to be lat love it will always be 🖼like gambar🖼 atau photo inilah yang🏁💗🤗 bisa🎥🔚👉 jadi lebih🏧👥 baik👍 dari sat lantas polres sidoarjo patroli kamtibmas ok foto ini aku akan hapusin galeri seni rupa sehingga ia menjadi oh no sensor sidik"], ["@HarlinSumampouw-dp2rs", "Ok Tks🏧 DK tak👧🏧 pernah adalah sebuah🏧 desa pl"], ["@HarlinSumampouw-dp2rs", "Of love it out there guys girlfriend dia👧👦 tak ada  this timer tema red There Greenland aja udah gak bisa DM oh sebagiannya afraid tertuduh Goneril claimer pales"], ["@HarlinSumampouw-dp2rs", "Making Your is fine in time jauhin mudik gratis lebar soalnya senyumku adalah sebuah🏧 kecamatan do'a orang☑👤🚹 yang💗🤗🏁 telah💗🤗 bisaa berpartisipasi mengikuti kuis Semoga beruntung setiap hari minggu ini☑🚍🏧 juga"], ["@HarlinSumampouw-dp2rs", "Buick keeper saves selfie📷💁 dengan cara💕 kau☝💪 berfikir☝💪 pls jangan sampai sekarang aku tak ada yg bisa🔚 jadi lebih pastikan kamu tak terkait keluhan sinyal📶 Rama i see your beautiful side acc ini🏧🚍 juga namun yourself soulmate"], ["@HarlinSumampouw-dp2rs", "Foundation moveon"], ["@HarlinSumampouw-dp2rs", "You ate oksigen must ro step jauhin negatifnya palu bisa🎥 jadi🏁 lebih besar"], ["@HarlinSumampouw-dp2rs", "Kakak ini tiba tiba myXLCare"], ["@HarlinSumampouw-dp2rs", "Justin bieber feeling"], ["@HarlinSumampouw-dp2rs", "Before-after"], ["@HarlinSumampouw-dp2rs", "If stills be Theresia ple hindarilah 78"], ["@HarlinSumampouw-dp2rs", "Maybelline cantik mulus protective"], ["@HarlinSumampouw-dp2rs", "Iklannya kemaren ada yg🔚➡ mau➡ tanya siapa whole dresscode blur ya👍😄😏 tks Kak👍 Ega Yanda tandanya masalah tie blackblu coloured??side tablet streeming palu🔨 arit"], ["@GraemeWight-wx3xz", "Carlson is MILES ahead of this chump."], ["@andrewwong2605", "Why do continued seeing this stupid interview. Iran Iran. Iran. All the time"], ["@sumaherc1", "privet drug putin  !!!   😎😎😎"], ["@rorymclaughlin4726", "pretend pretend, an end in send"], ["@rorymclaughlin4726", "they hate the mad hatter theyre star any day anarchy and date tv calneder man? fine here fire.\npass the best dont rag the bed here instead fear ur wed, weavil out we no house. anarchy a fat burn a he new in the mob car burgundy, date tv less than a handshake calnederman publishing behind a dead thread no left atom bomb"], ["@rorymclaughlin4726", "victoria her secrets? how much$? amillionaire wife hhuh sasha? 3? we need that evrysong 1"], ["@rorymclaughlin4726", "whot? if new school is over i have power? who wore new louie v?"], ["@MariaRosemildadeMatosRosemilda", "E o enviado"], ["@MariaRosemildadeMatosRosemilda", "Eu e msu filhoLucas Matos de Macedo 👍"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@MariaRosemildadeMatosRosemilda", "17:39 17:43"], ["@HarlinSumampouw-dp2rs", "Jeung batur ni🎉❤"], ["@magdachery7529", "Vivre Guy Philip vivre Guy Philip pour président vivre Guy Philip pour for président"], ["@firewoodwizard", "what excelent lies, tRumps hero."], ["@machine123e456", "The translator sounds like Russian AI 😂😂"], ["@crashd41", "Tucker did it better"], ["@carocuno06", "Ah, a complex and sensitive topic! The conflict between Ukraine and Russia is a complex issue with deep historical, political, and cultural roots. Achieving peace will require a multifaceted approach that involves:"], ["@edwardsusanto1202", "Any journalist who sits infront of Putin looks like a little boy."], ["@maryjoanhill7847", "I respect Mr Putin"], ["@user-zf6tu4oi1u", "🤔⚽"], ["@KarabastTV", "its not full................"], ["@hemchandhurhangee484", "This crap is antic"], ["@sandelower3061", "This  intervier   trying. To. Provoke. Mr  potin. Listen. To. His style!"], ["@acan2222", "🙏🏼"], ["@user-tj9ks3md7x", "123ปลาร้าขึ็นบกF711สั่งได้456จิ้งจกยัดไส้มรึงต้องไปแวนเนตกับฟินก่อนกรุจะไปมร็อคโคฮื้ฮ789ไคเพิ่ลมรึง"], ["@miho978", "When the Budapest memorandum was signed on December 5, 1994\r\nLeonid Kuchma Boris Yeltsin John Major Bill Clinton\r\n, the United States at that time also\r\n Was Guarantor without referring to internal problems with the border (for years in the future) or anything else...\r\nAfter the collapse of the Soviet Union, Ukraine received the world's third-largest stockpile of nuclear weapons after the United States and Russia. Kyiv inherited 176 intercontinental ballistic missiles that carried 1,272 nuclear warheads. In total, there were 2,500 units of tactical nuclear weapons on the territory of Ukraine. If Ukraine were a nuclear state, everyone would talk to us differently, negotiate differently. Even if we go for this, we would have to go along a completely different path to independence! Ukrainian Children have already seen together with their Mothers how the Budapest memorandum worked on February 24, 2022! The return of the nuclear  is a real guarantee of security... We believe in the Victory of the Fighters-Defenders of the Defense Forces of Ukraine!!! We believe in the Heroes of our time, in their Wisdom, Courage, Indomitability and Courage Glory to the Defenders of Ukraine to the Soldiers of the Armed Forces of Ukraine GLORY! GLORY! GLORY! GLORY TO valiant PARTISANS - MOVEMENT OF RESISTANCE! Glory to our Heroes! Let's take revenge for everyone!, blood for blood, an eye for an eye, death for death! \r\nTogether to\r\nVictory!"], ["@JohnInTheShelter", "The MSNBC talking heads owe Carlson an apology. Or else they owe their own company a lot of b.s. about 'treason.'\n\nOf course, they'll be silent, because they're hypocrites."], ["@swaggerdo7231", "Once the cameras and microphones have been confirmed to be off and unplugged, Vlad is known to have said to this \"reporter\" the following:\n\"«Когда вы вернетесь в свою страну, что, я надеюсь, будет безопасным и приятным путешествием, пожалуйста, скажите своим следователям из ЦРУ, что кураторам этого педофила, притворяющегося действующим президентом США, необходимо привезти с собой собственный запас подгузников для взрослых.\nУ нас здесь, в России, нет того качества и размера, которыми сейчас наслаждается ваш глава государства-педофила. Кроме того, нам необходимо уточнить лиц, ответственных за решение таких санитарных вопросов с этим человеком; так что после того, как педофил Джо справил нужду, может потребоваться более одного человека для уборки. Мы понимаем, что запах и беспорядок прерывают встречи, и у нас нет времени на задержки или перенос графика. Итак, попросите их спланировать это соответствующим образом.\nЛично я могу вам сказать, что здесь, в России, мы не принуждаем мужчин или женщин, в случае бывшего кандидата в президенты США, которые имеют серьезные умственные и телесные нарушения, заниматься государственными делами, а тем более баллотироваться на должность. Мы, люди здесь, в России, считаем, что лучше, чтобы о таких людях с физическими недостатками заботились с состраданием и позволяли им прожить свои последние годы в мире и достоинстве. Как лидер национального правительства, я считаю неуместным отправлять на переговоры по очень важным вопросам международных отношений человека, который на камеру нагло ласкает младенцев и молодых девушек, который не может как следует посрать или даже вытереть собственную задницу; и я устал притворяться иначе».\""], ["@RonaldDean-sp6jl", "Hey Pitkin get the heck out of the Ukraine if you think the Ukraine is going to bow to you Mr dictator  you better think again"], ["@submarinar638", "Putin is a killer. He killed Navalny on Feb 16, 2024, afret torturing him in prison for 3 years."], ["@jakoblarsen3906", "Putin are totally street."], ["@tothier", "This is not a real interview and it’s not the real Putin. It’s all fake made with computers 😂and Not by Putin .. believe me!"], ["@lorrycamill6502", "God bless Russia 🇷🇺 always on the side of freedom and no death camps amen 🙏👍"], ["@igoradamovich505", "Its so sad for me to see same blood same human beings fight countries like usa russia have to be friends"], ["@igoradamovich505", "Hahahaha"], ["@iranihermogenes9447", "De ates eleva canditatos surgi ídéas é sensacional  eu e minha família de irmãos adoramos Debate eu e meu irmão damos também idéias que possa  favorecer o candidatos  que estamos apoiamos ?! É bom D+"], ["@romankonowaluk5980", "notice putin always starts his response with a chuckle. he never accepts responsibility for anything even when the world sees what he is doing. all he is doing is justifying himself to his minions."], ["@januszkolodziej7054", "*Now President Biden should give a two-hour interview to a Russian journalist.*"], ["@joelreid8028", "Oh so this isn’t being a traitor ? But tucker goes and talks with Putin and he’s a traitor. Y’all are gross and despicable."], ["@trentonkern4803", "Honestly Putin has to be Lucifer or at least related cause he just speaks so well but you just know deep down he’s a monster. Very scary"], ["@HarlinSumampouw-dp2rs", "History a Chinese film🎥🎬👀 ini☑🏧 dirilis BYCICLE say saja yang bisa jadi orang Baik👌👍😑 kak mengurangi rasa penasaran History By Taiwan Chinese event team J k cek ya kak mengurangi rasa nak makan malam🌛🌟 ini☑🏧 dirilis BYCICLE lonely is a w t u all new year PR besar"], ["@HarlinSumampouw-dp2rs", "Film🎥🎬👀 ini☑🏧 dirilis BYCICLE say you again ever watching suamiku paling diligent🎉visi misi🏧 yang💗🏁☑ telah💗 berpartisipasi🤗 seputar layanan pengirim dan kingdom kingafiqq💕 Mieszko Ryan Giggs GPS Animalia CH-R Mieszko gueen small Hai Kak Yunda yanda bertahan lama kemudian menjadi🏧🖼👥"], ["@HarlinSumampouw-dp2rs", "Exoprosopa dan skill yang☑💗🏁 bisa jadi baik 👌👍😑orang-orang yg mau➡ tanya🤔💭❤ when you again"], ["@HarlinSumampouw-dp2rs", "Can able Respon yang bisa bersyukur DM ya kak Yunda keseruannya Mieszko Ryan ptr Cherrybelledo gueee willi tuh tie sticker PRIBUMI Papua Barat yang bisa jadi orang lain Korea Selatan⬇ yang telah berpartisipasi seputar Speedy filmnya ditonton ya tks🏧 DK sekalian aja deh ya"], ["@Tommy712rus", "Top 1 fake interviews."], ["@user-er8dw4kq5p", "🇷🇺🖕💃👑️"], ["@blakeyscribner4288", "This is bad ! No Tucker no good !"], ["@miadiaz-sanabria2380", "50% reduced! Wow. In California alone increased over 50%..."], ["@miadiaz-sanabria2380", "Respect for this dude."], ["@valeriefinkworldprof3428", "Well said ❤ beautiful well speaking"], ["@toutlemonde5008", "The journalist is constantly interrupting and  reminding the president that he runs out of  time?? this is unspeakable !! How rude, what a shame !!!"], ["@princemule1331", "🥺🎉"], ["@nenadmitic5124", "Listen to what Putin says and listen to what your leaders say, your leaders said everything, you are robbers and murderers and nothing can change that. You are expanding NATO towards Russia, not the other way around, for you, Ukrainian lives are just an opportunity to make money."], ["@annielynebron5778", "Dahil po nagalit po ako sa kompare ko.. dahil lahat po yong mga kaibigan kopo.. lomalapet sila sa akin.. dahil gostu po ako nila.. himbetahin yong pag hinom nmin sa barr yong hinotosan po ako nila pag bile nang red.house 1000.. pira nila pambili nang berr redhousre.. tapos po pag bili kopo yong berr.. binigay kopo sa kanila yong berr.. tapos nag kahiwalay napo kami.. dahil alam kopo yong ginagawa nila sa akin.. dahil ginawa po nila hiba nman yong tao.. palipat lipat lang po sila para hinde kopo malaman yong ginagawa nila sa akin.. dahil matagal konapo nalalaman poyan. Kaya nga ako pomayag yong kagostuhan nila sa akin.. dahil alam klpo lahat mga kilos nila galaw.. kasi nagalit po ako sa kompare ko.. tinanong kopo sya.. pare sinoba yong mayhare hitung bola natu sa baskitball.. yong mayhare yong bola nato sa baskitball.. sabi nya sa akin.. yong mayhare po yan yong bola hinawakan mo ngaun.. ooo hitu nga bola bagopa P.B.A.. tatak yon.. yong mayhare yan yong hinoraman kopo yong bola myhare po sa kabilang baranggay namin yong myhare nang bola.. kaya po ako nagalet sa sarili kopo kasi sobrang sakit po yong naramdaman kopo sa satili kopo.. ginawa kopo pomunta po ako nang bahay nila yong mayhare nang bola.. tahopo nanjan bha yong kaibigan kopo yong anak mo mana.. tapos kinahusap kopo sya kaibigan kopo.. ikaw pala yonng mayhare hitung bola nato bago bagopa yong bola mo.. pinapahiram mo khit sinong tao.. hinde moba alam yon masakit po para sa akin yon.. dahil matagal konapo kita mg kaibigan tayo.. hinde lng tayo kaibigan.. nanduhon pa kami yong papa mo sa samar dolores.. close.po kmi nohun.. bkit nagawa moyan sa akin.. kasi malaki nmn yong pag mamahal kopo yong logar nyo sa samar dolures.. kaya nagalit po ako sa kompare kopo sabi kopo sa kompare ko hinde po ako natatakot sa mga pag sasabi mo sa akin.. kompare yong kaibigan ko yon ba pag mamalaki mo sa akin.. khit hinde ko napo kinaya yong sarili kopo.. dahil syapo ang nagsemola sa akin yong sinabihan nyapo ako nang hinde mabote yong sinasabi nya sa akin masasama sobrang sakit po yong polung nya sa skin.. sosunogun daw kaloluwa ko tapos my bang.bangka. pasya nlalaman sa akin.. tapos sabi nya tatalehan kapa yong lansa yong sinasakyan mo paponta sa samar dolures.. kaya sinabihan ko diin sya kompare kopo nang masama diin.. tapos nahilavas kopo yong galit kopo.. ging blok. Kopo sya sa acount nya sa akin.. kasipo walapo kami mapopontahan yong usap usapan nmin hinde mabote.. walang mapapala sa away nmin kompare ko.. kasi mahihiya lng sya hat maraming tao or mababalitahan nila yong away nmin.. sobrang kakahiya poyan pinatolan kopo sya.. hinisep kopo para sa hikakabote po sa kaibigan kopo gomawa po ako parahan para sa kaibigan kopo.. hiniwasan kopo sya bina.blok kopo sya.. para walang golu hikakabote pa sa kaibigan kopo... dahil alam kopo lahat yong ginagawa po nila sa akin.. khit masakit sa posu ko yong naranasan kopo nohun pinahihirapan po ako nila nohun.. lomaban parin ako hinde po ako somoku binohu kopo lahat nasyot kopo lahat.. sanapo yong kaib8gan kopo hominge po ako yong mga kasalanan kopo sau yong masama yong pinag sasabi kopo sau kaibigan.. dahil syapo ang nag semola sa akin pag sasabi nya nang masama.. yon lng po ty."], ["@alexnosal2277", "what stupid questions corporate media asks."], ["@annielynebron5778", "Bago po kami mag usap yong beasfriend nya po.. sabi kopo sa kanya.. pag halis kopo ngaun hinde po tayo mag kakahusap.. kasi yong motur kopo walapo hitu gasolina.. may pera kanman jan pan gasolina sa motur mo.. myron nga piru sakto lng..  nag pagasolina po ako yong motur kopo para lng kami mag usap.. sa petron gasolina ako piro hinfe kopo matandahan na yon segero ko 300. Or  or 230. Kasipo mahal po yong gasolina yong motur kopo X.R.M..motur kopo.. yon lngpo ty po god blisss po ty."], ["@annielynebron5778", "Dohun po kami nag laro barangay 19..bakitball kasipo mayron dohun lega tornament baskit.ball kasipo feasta dohun patron brgy 19..lega tornament basket.ball.. yonpo logar yong pinontahan kopo lega brgy 19 baskit ball.cort.. nila yong brgy 19 feasta kasi nila patron yon pagka bokas fieata po kasi yon.desperas poyon. Yon lng po ty grade3..12 year old..❤❤❤❤❤❤😢😢😢😢❤❤❤❤❤❤❤❤❤❤"], ["@annielynebron5778", "God afternon salahat jan.. pag gising kopo sa umaga.. tinawagan po ako yong kompare ko. Kasi mayron po kami usapan.. yon time nayon sabi nya sa akin pare hanona komusta na dida.. hamo lageap ako didi.. hanoman madadayon kita hini han aton sinabotan kahapon.. ooo nman syepre sinabotan tahitu.. sege wagmo patayen yong cellphone mo.. kasi mayron tatawag sau mamaya.. ok pate mag hihintay po ako yong tawag nyo.. tapos tinawagan po ako yong beasfriend nya.. sabi nya ikaw bha yong kahusap yong bestfriend ko.. ooo ako nga sege pag handap nala ngada.. tapos pag kita naton ha tekbaw ha basper.. bigyan mo ako nang pang gasolena ko sa mutor ko.. ooo sege ok.. tapos tinawagan po ako yong kompare kopo.. sabi nya sa akin.. ooo mag kanoba yong gostu mo yong postahan mo 100..lng po posta ko jan sa basket.ball.. sabi nya sa akin kompare ko.. wag nman pare 100... gostu kopo pare yong postahan natin gostu ko pare 500.. posta ko sa pag laro mo sa basket.ball.. sabi kopo wagpo pare hinde kopo kaya yan 500..posta mo.. yong kaya ko lang po yong posta kopo 100.. lang pare... sege sege pare  gostu kopo pare 200.. yong posta ko sau sa basket.ball. mo.. hinde kopo kaya yon 200 posta mo sa basketball.. hinde po ako sanay yon pag lalaro nang basket.ball.. kasipo ngaun lang ako nag laro nang ganito yong laro nang basketball.. kahit ganyan lang ako sa sarili kopo. Kahit mahirap lng ako.. hinde po ako ganon yon pag katawo ko sa pag lalaro nang basketball.. dahil pomayag lang ako yon pag lalaro nang basketball nayon.. dahil tinoturohan po ako nila yong pag lalaro nang basketball nila.. ginawa kopo senakyan ko nlang po sila dahil alam kopo yon lahat.. yong pinosta kopo 100..lng. yon lng kaya ko pg laro basketball.. kasipo yong natutonan kopo yong tallent kopo yong mga hikakabote po sa akin hat sa mga tao.. dahil natutonan kopo yong matagal konapo yong tatatay kopo kasipo sobrang baet po sya yong ugale nya.. natotunan ko diin sa kanya pag mahal sa isat isa.. kaya po sobrang malakipo yong pag mamahal kopo sa sarili kopo sa inyong lahat jan.. kayapo mahal kopo kayo lahat jan.. yon lngpo maraming salamat po salahat sa inyo po ty grade3..12 year old...❤❤❤❤❤❤❤❤❤❤❤❤❤❤😂❤❤❤❤❤❤😢😢😢😢😢😢😢😢❤❤❤❤"], ["@vittoriascopelliti8396", "You should be happy that he can speak to china and keep things on a conversation level instead of a was since American seems to not be able to develop a conversation with those countries- be happy someone can"], ["@morpylsa", "Is there any version of this where I can listen to PUTIN's voice and not some voiceover?"], ["@marythomas9775", "AND MOREOVER RATHER FUTHERMORE I WOULD LOVE TO GO FISHING WITH YOU IN RUSSIA 🇷🇺 AND CATCH SOME FISH AND DANCE WITH YOU AND SING TO YOU, I FEEL LOVE FOR YOU VLADIMIR PUTIN❤❤❤!!!"], ["@marythomas9775", "AND I LOVE YOU PROFOUNDLY❤❤❤😊😊😊!!!"], ["@marythomas9775", "AND ❤ GREAT MORNING TO 🌄😊 YOU MISTER SIR PRESIDENT VLADIMIR PUTIN OF RUSSIA, IM SOOO SAD I CAN NOT BE WITH YOU😢"], ["@marythomas9775", "AND THE CHEMICAL PLANT NEAR MY HOUSE IS EFFECTING ME"], ["@marythomas9775", "I WOULD RATHER BE IN  MOCSCOW RUSSIA THAN IN NEW YORK CITY AMERICA"], ["@finsup7029", "We would never put big weapons in a country thats not a part of nato. That is just less than i could feed my American children!"], ["@waltvancourt5052", "Usa needs a world class leader like Russia has."], ["@robschannel4512", "Sorry Tucker just interviewed him. Your scooped"], ["@user-gm4jj3gn3n", "Achte auf dich es gibt neue luegen von sylenski,schaus dir an ."], ["@the.real.ghostman", "NBC should get sanctioned for interviewing putin"], ["@dearleader5294", "acording to putin all russia should be mongolia"], ["@paulrush4545", "✌"], ["@MichaelMrGoldstein-vg7bv", "Reporters supposed to report the truth, not the rest of the b*******Everybody's trying to make you by whatever you try to set we ain't by can"], ["@tonybrett5547", "Like I said to Ukrainians in 2019 on Facebook when they showed Me a photo of Putin and asked Me whether I know who that is and said : \" He seems like a nice guy \", which upset them badly. Anybody can be a nice person. It all depends on how You treat them. When people sit down and talk their hearts out about a problem, they could achieve the impossible. When one looks at this interview You can't believe it's the person the world despices so much. There has gotta be something more going on. All I know is that those ukrainians was very rude to me and  tried to chase Me off Madonna groups on Fb. Something more is going on and I don't think Ukraine is giving Us the full story. They can be very rude people too on top of it all.😮😮😮"], ["@Thatcunt_logan", "Heres me thinking tucker was the first person to interview this guy. 🤦🏼‍♂️🤦🏼‍♂️🤦🏼‍♂️"], ["@vittoriascopelliti8396", "It is sad that this man tries to talk and make peace and he is insulted in every possible way - his class and tolerance is unmatched- another would have started a war for real under these type of treatment - why can we not be in peace"], ["@vittoriascopelliti8396", "The questions are just there to upset - are you a killer ? I think I would have stood up and left /// those people have no good manners at all - you ca disagree but also do a proper professional interview"], ["@barryredford4176", "Putin is a class act, wish America had such a person."], ["@StarrDeMoine", "Putin tells many lies 😊"], ["@user-hb3ou4yd8o", "🍲🍱🥛⏰🌨️⛈️🌧️💧🚗⛽⛽⛽📟👛👝🎒☎️📞📟🔌💻🖲️⌨️🖨️🖱️💳💳💳💳💳"], ["@vittoriascopelliti8396", "Such weird questions just to annoy instead of getting some thing interrupt of it"], ["@trickyblickfang", "min.35 USA should think what they´re asking for.. and let other nation  free, what a scam"], ["@vittoriascopelliti8396", "I don t like this reporter is too antagonistic- you can challenge without being offensive"], ["@vittoriascopelliti8396", "This journalist is never acknowledging an answer - bad communication really"], ["@Blazedshuggs", "you would think if every comment in your section goes against your agenda and what you're trying to push maybe you want to change your agenda."], ["@hectorcotto5310", "He's bulletproof"], ["@nrekonkoro", "Not good to raise the algorithm but the journalist interviewed with keen attention to US national interests.Путин - это не Лукашенко, и Лукашенко - не Путин"], ["@tinashams2476", "Are you Russians offended by the nationalism of your country on the part of Ukraine? Why do you oppress other peoples living in your country? Why don’t you have a law and court regarding nationalism on your territory and other countries? You especially oppress Tajiks, Uzbeks, Dagestanis, Americans and so on! Now I will write these words in English so that the Americans know what kind of nationalists you are, I lived in Russia and saw how you mock my people! I know Russian very well. I started from scratch and rose to the rank of manager at the Bank, but as soon as the Russians found out that I was not Russian, they began to treat me with disrespect, just because I was not Russian, although I had a Slavic appearance and I had a Russian passport ! First, be accountable for your actions! I am still offended by Russians for their nationalism!"], ["@axc9559", "43:34-fvcking hannibal entered the room"], ["@martinred6237", "I wonder how did he reduce the population of prisoners by 50% lol"], ["@daverassbot5869", "We need more conversations like this. US needs to stop. Playing the victim."], ["@yes907", "Gr8t"], ["@SleepyAirplaneWindow-dh9jc", "He said he has more at least 5 proves, but all were alleged zero proves. He's personally attacking"], ["@kuldriebier5372", "americans cause all wars dont you see?american hypocrites..."], ["@abdeljalilmekkaoui4413", "I'm  President  Wagner"], ["@janettemasiello5560", "Who is this interviewing Putin? Is he a traitor, a russian stooge,  like they're calling Tucker ?"], ["@georgiadawgs8260", "None at all! But using their drones daily now. Putin is not a good guy! Thank you Tucker... 🤛💪"], ["@mr.invisible3770", "If the Democrats couldn’t blame Russia they wouldn’t have any excuses."], ["@mr.invisible3770", "One thing I have noticed. Putin seems to speak openly and honestly and he shows self reflection. Our politicians don’t do that."], ["@sandipkhatri6085", "He started with king attitude to make him repeat the question because question was translated even if he didn’t understood but he made journalist to repeat his question to dominate from the beginning ❤😂"], ["@mandabean.2405", "NBC should be sued for copyright and stealing and narrating Tucker Carlson interview they did have the balls to do."], ["@leworelaxingsounds9308", "“Don’t be mad at the mirror if you’re ugly” 37:32 😂😂😂 “it has nothing to do with you personally” 😅😅"], ["@erikang8759", "❤❤❤🥰🥰🥰👁👍👍👍❤❤❤"], ["@baneotv", "Is that dude still alive?"], ["@dr0ny", "Don't you all see the technique behind his answers? \n1. He NEVER answers a question with a direct answer. This is why he needs a lot of words and time to make his point.\n2. Every accusation (against himself) is an opportunity to reflect similar accusations - against other countries (U.S.) or institutions (NATO), which draws attention away from the original confrontation.\n3. When the journalist tries to re-center the questions as VP is not answering, the journalist is dismissed with an idiom like: \"Don’t blame a mirror (VP) for your ugly face (U.S.)\" or \"you interrupt me because you don't like my answer\". He is mastering every kind of re-approach.\n4. He does not obviously lie, but won't tell the truth either. He thinks bad of Biden, but doesn't state it, instead he talks good of Trump.\n5. He asks for proof but won't give proof himself, just clever phrases.\n6. He stays calm and polite, even admits he doesn't know certain things or doesn't remember certain events. This gives the impression of honesty and credibilty but in fact this might also be utilzed as an \"answering tactic\".\n7. Questions that no one EVER would answer with \"yes\" (e.g. the killer question) make him laugh. But that is no wonder, indeed, a very poorly worded question.\n\nUnfortunately, the journalist doesn't master the skills of VP's interviewing technique. This gives VP the opportunity to present himself in the best light. VP is highly intelligent and charming, but manipulative, and this is what makes him so dangerous and unpredictable. Don't fall for it."], ["@coocolal3644", "35:41"], ["@gumarobertson-xk9ob", "Two years ago."], ["@coocolal3644", "In summary- \nSimmons: I have questions and arguments, and here they are.\nPutin:  Your questions and arguments are invalid, and this is why."], ["@garytaylor4990", "This a typical MSM agenda driven interview, with typical low-rsolution thinking that is trademark for that MSM crew. Carlson's interview was not flawless but head and shoulders above thisI IDEOLOGY driven.drivel  CARLOSON AT LEAST BROKERED NEW INFO, NO new info was gained form this NBC clap-trap. A real interview with Pjutin would be the Oliver Stone interview."], ["@kazimierzkrzysztofek7785", "Dajcie tlumaczenie na polski czy cos jest ukrywane z tych 2 godzin ?"], ["@incredible5587", "I was reading some of the recent comments and i feel like some people dont realize this interview is from June 2021, some of the comments inside of comments asking why he did not bring up certain things that happened in time after the date of this interview."], ["@SGCarsRU", "Who is NBC trying to kid??? More than 40 minutes were cut out!!!"], ["@incredible5587", "Putin!!! Muster some patience!!! has he ever done that for anyone!!"], ["@leifandersen1809", "Living standard raises in Russia,falling in the US   Sceary. 😢🇩🇰"], ["@yurimarrocos8237", "Am I the only one who thinks that Tucker’s conduction of this interview is really poor and biased? What a waste of time."], ["@michaelevans4110", "\"whataboutism\", please.\nLet the man answer the question."], ["@DeepTr1p", "English langue full interview is on youtube but at Russian language all videos are blocked why ? where is democracy?"], ["@michaelevans4110", "23 mins\nAssertions by the journalist with no evidence to back them up. \nJust embarrassing."], ["@mauroger86", "Putin absolutely OWNED this fool, who took a few journalist classes at community college, read 3 books and think he is ready to debate Putin"], ["@Foreverandever789", "Time is running out !\n\nRead Revelation 13:16-18 kjv\nRead Revelation 14:9-11 kjv\nRead Revelation 20:12-15 kjv\n\n                                \" A prayer to go to HEAVEN \"\n                                         Luke 23:42-43 kjv\n>>> LORD I am a sinner and I believe that JESUS died on the cross for my sins. Buried afterwards, then rose from the dead.\n\nRead Romans 10:9-11 in your Bible\n\nJESUS SAVES SINNERS PROJECT\n            1 Timothy 1:15 kjv\n\nTime is running out !\nHebrews 9:27 kjv\n\nRead JAMES 4:14 kjv...PSALM 39:4-6 kjv...LUKE 16:22-24 kjv"], ["@ferme0323", "The interviewer was not eager to understand Putin, just to infiltrate all propaganda into his questions. When proved wrong he would not follow up but instead change subjects. Something that really resonated was when asked about the marine that got drunk and fought a police officer to what Putin replied well if someone got drunk in America and fought a police officer he would have been shot dead. Totally spot on"], ["@kalamouala", "biggest lier and mafioso in  univers, also the biggest traitor in russia"], ["@justinhruska2269", "Putin je génius, On zachráni Európu od liberálno-zelenej pohromy!!!!!!"], ["@sbongakonkemlangeni5714", "I get angrier as I listen to these questions"], ["@user-tn7vq3qz7s", "Russia Russia Russia, Why are you people sharing this video now??? When clearly it is irrelevant. You people!!!"], ["@AVOWIRE24", "It's fascinating to see interviews with world leaders like Vladimir Putin. They offer such a unique insight into international politics and diplomacy. The complexity and nuances of global leadership are always intriguing to explore. Regardless of personal views, understanding different perspectives is key to a broader comprehension of world affairs. It's great to see media providing these in-depth looks into political figures and their viewpoints."], ["@titotaylormontiel667", "Argentina- Alaska= America."], ["@titotaylormontiel667", "The movement of His foot."], ["@blackmanticore9951", "Американцы реально такие тупые?"], ["@petrureaboi267", "rusiia is time to die"], ["@taniagarciaduenas2522", "? Là Russia turchia Egitto arabia Siria damasco Scandinavia tramite Balcani erano uniti per un solo impero assiro conflitta Russia International 😂"], ["@taniagarciaduenas2522", "😂Putin is not looking for war, he is looking for territory to trade with the Arabs ☝️🙏"], ["@user-ys1cd9pq9o", "Що за йобнутий курс альтернативної історії, що за маячню мелить те створіння"], ["@letsdebate839", "Oh but when tucker does this it's not allowed 😂"], ["@asdg2271", "Then MSM wonders why he won't do an interview with such clowns. Lol."], ["@cosmixfire3176", "Putin is right about almost everything except the barbaric issue. \nRead Von thadden, Suvorov, Igor Buniev, Mark Solonin, Joachim Hoffmann, Bernd Schwipper"], ["@SashaFujin", "what a dumb reporter"], ["@smburgas6727", "Well done to Putin to keep fighting for the truth and humanity! We all know that USA and European media it's controlled and trying to make Russia look bad in any way!\nRest and peace to the thousands of Russian and Bulgarian people and kids, where was decapitated and burn alive in 2014 in Donbas."], ["@gyrozeppeli8509", "\"full interview\" but you cut out more than 1/3 of it"], ["@Its4you_", "It’s like interviewer is asking about his father and Putin is answering the fact."], ["@Its4you_", "If it’s biden he would have forgotten the way out"], ["@Its4you_", "🇷🇺 are gentlemen not white white” people 😊"], ["@lule363", "普京会说德语，法语，英语，瑞典语。但是他是俄罗斯的总统，他为什么需要用英语回答问题？评论里傲慢的西方人很可笑，指责普京不会说英语，确实，俄罗斯不是你的殖民地，让你们多难受啊😂"], ["@conspiracycenter7427", "So it's only bad if Tucker interviews him?\nAre people saying this guy isn't a journalist?"], ["@Salrock", "Totally agree with mr. Putin"], ["@user-0xDEEDBEEF", "very rude interviewer."], ["@JaysSavvy", "But TUCKER is evil, right?\n\nHypocrites."], ["@brandifuentes691", "ok, this guy is disrespectful as ever my goodness! And this is a prime example of what is wrong here in the states my goodness! If you are going to ask a question then shut your mouth and listen to the answer, the end!"], ["@Andrea-vn7nn", "how is this the full interview if it is 40 minute shorter"], ["@Cookieofdoom", "HoW dArE tHeY iNtErViEwInG tHaT BaD mAn!!!!???? 😡😡😡😡😡😡"], ["@user-zx1ir7jt4c", "It's so great to finally see the American people realizing that their own media lies to them. Especially about Russia."], ["@nadiazaitoon7892", "بحرقة طول اليوم امس واليوم لا هو هواء يكفى اصلى واطلب منى ومنة الصوت يروح بعدين اصلى واكل واريح شوية بصراحة تعبانة على الاخر خلاص التجميل النهاردة هو فعلا بحاول اصلى اطلب مننا واريح نفسى شوية👍"], ["@kevinbrice9198", "NBC, you are completely full of bleep, like CNN and MSNBC and controlled by the Dark State. You expose yourselves continuously. You wont last."], ["@kaizonyan", "And you are mad at tucker.... this guy did it lol hypocrisy"], ["@martintekula", "imagine being among most powerful ppl in the world and you cant speak english the most spoken and easiest language to learn in 70 years of your life? that tells you everything you need to know about putin"], ["@Protestor101", "OMG I can’t believe NBC gave a platform to a commie dictator! Democrats are bad for America!"], ["@AR-gw8yx", "Это наш президент! И нигде нет больше таких!"], ["@user-dv8vu3kk6i", "All I can say is this is 2 years ago and this man is trying  not to  make war but want to work with other countries and make peace and all I can see is the same thing that is happening to to him the news trying to make him look so bad and tell lies about him for two years they have been pushing him and now that is why he had enough and I don’t blame him!!"], ["@osteopathystephenswood5779", "Biden can't remember his own name and would never allow himself to be questioned like this. This is a fact."], ["@user-Atahualppa", "These fool list all these accusations without any proof. A monkey without real initiative."], ["@slatsgrobneck7515", "LOL, click bait.  MBC trying to tag along on Tucker's groundbreaker.\nIts an interview, but not THE interview.  meh"], ["@mrbreeze40", "Rantings of a mass murderer."], ["@beebsarelli", "Look at these clowns from NBC News trying to dilute the impact of the Tucker Carlson interview with ancient history !"], ["@schatzsayang4009", "this interviewer was trying to twist and turn to make President Putin into some fake lies, glad President Putin didnt fall into false fake accusations the interviewer pressed on"], ["@ngangirae-lu6nx", "Congratulations for this presentation. Good for all listening. Peace. No abusive language..God be with you Mr President. \nBeing watchful, wolf???"], ["@ScottStewart92", "so we not cancelling this guy? oh wait cancel culture is a new thing"], ["@LovelyBlockGame-ge4ij", "🎉🥀👍"], ["@mihaivale7170", "The FULL interview is over 2 hours!!! Liars!"], ["@localpolitics1", "One might think whatever you want from the Russian president Putin, but he is the most intelligent politician on the world stage.  First he shows that he is in control of the situation. Then he explains, though interrupted, the historic evolution and interconnection of Russia and the Ukraine which he from his point of view considers to be elementary in particular for \"uneducated\" US politicians and other uninformed viewers, and then he charmes elegantly the interviewer outlining to accept and understand his standpoint, being different from the opponent's narrative.  I remember former German chancellor Helmut Schmidt being interviewed as an elder statesman and mentioning,  that if he would be a Russian General or military officer and observe the NATO expansion to the Russian border, he would start to feel quite uncomfortable.  In my opinion this war could have been avoived 10 years ago with diplomatic intelligence and compromises, considering the fact that an armed conflict against an atomic power cannot be won."], ["@user-pj9mo5od6b", "Tucker looked at the old degraded dictator and thought “what am I doing here, I should have asked for more.”"], ["@mxrijx", "Difference between talk show and interview 🤣"], ["@wilsonmccarty7203", "There reposted this video to mislead anyone looking for the Tucker interview"], ["@wilsonmccarty7203", "Why is it ok for them to interview Putin but not tucker"], ["@rainom1552", "How many times interview with Russia president no point.The people of the world like to see that stop fighting to Ukarain.Everyone will be happy and satisfied and thank God.Russian civil ancestors all will like you because every one knowing that your invasion  is wrong.wasted your financial and so many russian lost their life.Ukrainian are no choice they have to protect their nation country. Please stop fighting to ukarain before you for election. God will forgive you.Can you make peace.?"], ["@body187j3x1", "This is not an interview, this is an interrogation"], ["@Ti_teperb_patsan", "ПО-РУССКИ ПО-РУССКИ!"], ["@annielynebron5778", "Salamat po sa inyong dalawa po mister prisedente sa inyo po.. kasipo kilala kopo sya matagal napo 2018..2023.. pa malapit lng yong bahay nmin yon..kaya nga nahihiya po ako sau mister prisedente putin. Ty po."], ["@annielynebron5778", "Sasagutin ko nlang mister prisedente kong ok lng sau kasi baka magalit kapo sa akin nahihiya po ako sau."], ["@annielynebron5778", "Mister prisedente nahihiya po ako sagutin kahapon yong sau kasipo yong epelyedo nya po hinde kopo alam. Kasipo kapag sagutin kopo sya.. hinde nmn kita hisasale sya lng po ang sasagutin kopo...yong alyas lang nya yong ppangalan ko sa kanya hisa lng po mister prisedente putin. Yon lngpo yong gostu kopo sabihin sau.. kasipo ngaun hinde napo poyde kasipo tapos napo lahat yong istory.. yon lng po ang importante kopo yong kwento.. ayaw kopo sagutin yong pangalan nyo po masakit po para sa akin.. ty nyopo salahat god bless."], ["@Reinbow258", "Trying to justify his attack on Ukraine with false historical facts, Putin looks like a pathetic old senile in this interview. He even remembered Hitler, who did not want to attack Poland in 1939, just like Putin did not want to attack Ukraine, he was simply forced) Meanwhile, people in Ukraine are dying every day and the free world must stop the madman! Thanks to Tucker for showing the world who Putin really is - a terrorist and a murderer!"], ["@fuddcar", "Nice of Tucker to share some real news with you hacks!!"], ["@user-wd7nd2dz5d", "😂😂😂😂 he said sorry could u repeat that hack what?😂😂😂😂"], ["@rjmidnite", "Russia economy is smaller then one of Americas states and Biden and military complex and fake news tells you Putin bad and he wants to take over countries and it’s all a lie !   Putin tried many times to join nato and was denied and tried to not even have a war in Ukrain but America and nato nations stoped all peace talks because they didn’t want peace! Nato and America want Ukraine for military foothold on Russia front door ! Ukraine is not a democracy at all they cancel religion and all kinds of stuff . Nato and America fund Ukraine border but not America border that should tell you something! Nato and America is the evil players in this game and that’s why media doesn’t cover Russia in a good light and zelinski kills Russians bare handed and on time magazine and put on ever news organization and hailed as a hero why thousands of young Ukraine soldiers die for no reason! I see billions for all the elites and military complex and American military equipment sent to Ukraine end up in other countries and to terroist!   I see joe Biden left billions of dollars in brand new military equipment to the Taliban and thousands and thousands of guns so a new order of billions goes to military complex again and new wars are put in place again! Remember Russia economy is the size of one American state so guess who the real war mongers are and want Ukraine in nato so it’s natos military land and Americas  !  Biden administration tried to stop tucker and the cia spied on him because they don’t want you to know Putins side , that’s why abc cbs msnbc cnn all went crazy on tucker and tried to make tucker look bad and say Terrible things about him so you think he’s a natzie"], ["@user-ej4ie4xp6c", "Полное интервью длительность 2 часа 6 минут. Full interview duration 2 hours 6 minutes"], ["@AnOwlfie", "Don't know NBC, this interview seems like a pretty MAGA republican extremist move."], ["@schampinyon", "Владимир Владимирович понимает что этому херу не нужна правда,он даже смотрит на него с иронией!)"], ["@bradchellingworth5973", "Watching this in 2024 after having just watched the Tucker Carlson interview. This is clearly an opinionated interview with so many leading questions and baseless accusations, compare it to Tucker's interview its just night and day. How this guy can call himself a journalist is beyond me."], ["@bradchellingworth5973", "Typical American journalism. So obvious that they need to keep up the facade that Russia is the bad guy. How long did he spend trying to get Putin to admit to being a \"killer\" while the same media spends 0 time explaining how epstien died or who was on the list."], ["@josephmckenzie8953", "When MSNPC runs the interview of their favorite villain to run distraction from the headline of FJBs severe mental decline."], ["@Rayth69", "Is this what americans call an interview? Chat GPT would have done a better job of asking questions.."], ["@aronjohnson2553", "Trump!"], ["@iansysoev9462", "Its another interview from 2 years ago ppl, calm down, new one is on Tucker Carlson channel"], ["@Olga-fp7vv", "Such a mad mad old man...."], ["@aleksandrskudrjasovs3013", "Full interview is over 2 hours , this has been trimmed"], ["@johnbai4715", "TREASON! \n\nRight?"], ["@MaxRud80", "where is this full interview? you only cut what you were allowed to show!!!!!"], ["@Ghaithmarwaan", "Its 2 hours why they posted here 1.5h????"], ["@DannyKnowstuff", "I have just realized I have learned this foreign language just to now see what an extraordinary display of sheer ignorance, disrespect the American leading is capable of.\nThis was not an interview, this was an interrogation. I cannot understand why are americans so afraid to sit and talk with Russian to collaborate. They don't send people in Russia to talk, they send people in Russia to blame."], ["@vratislavmrkvicka6998", "proc to neni cestine"], ["@runtime1976", "It's not full"], ["@angel_willow", "🤡🌎 Friendly reminder: When NBC interviews Putin, it is brave and educational. When Tucker interviews the same man, it is treason and Tucker should never be allowed back into the US. \n\nAlso, if you watch Tucker's interview, you are a traitor and a Putin puppet. If you watch NBC's interview, you are a normal citizen that just wants to stay informed."], ["@Quiet_Light_Jane", "https://youtu.be/fOCWBhuDdDo?si=PU4Z4FOJxtJ5xsgR"], ["@user-ch6fu5nd4z", "Ето  не тот человек   , что соответствует уровню Президента Путина - зря старается ,  жопу рвет .... (любят  же  лезть те ,что привыкли ползать- безхребетные и  скользкие, туда  где медом намазано...)."], ["@rickhoneycutt8026", "That would be the news media that did that 😊"], ["@hanksyflamework", "this is 2 years old and not the tucker carlson full interview"], ["@Kuryan_a", "Жители Европы и США, если вы действительно поняли чего хочет Россия, прошу вас, не идите на поводу у вашего правительства и вашей пропаганды. Сделайте что-нибудь для наступления мира! Сейчас вы можете помочь всем нам!"], ["@landser8616", "This one is much better for Putin than that one with Tucker. I think Putin gives his best when he is attacked by the journalist. This is the Russian mentality more or less..."], ["@user-rn5ve6fe9v", "❤Путин❤🎉❤🎉"], ["@hohuynghi", "What kind of jounalist is he"], ["@ill_threads1628", "Don't let this interview to fool you - Putin is an autocrat and international criminal."], ["@Seitanmaa", "Which one, Russia or the US, will make themselves look ridiculous ??? 😏😏"], ["@mukululincube1435", "what an intelligent guy!"], ["@ingwer8918", "No wonder Putin turns down interviews by western interviewer (but accepted Tucker Carlson). \"Are you a killer? \" this guy asks. You're kidding right? His patience is unbelievable."], ["@Liveforfood9394", "Well said Mr Putin!\nDon't blame the mirror if you are ugly!\nThe reporter want to paint someone else black, but forgot that he's already black😅"], ["@zachfairchild378", "I just had a mild panic attack, I didn't realize this video was from 2 years ago lol!"], ["@GeorgeKeselev", "Почти все, что говорит Путин, не соответствует действительности"], ["@xzl2284", "Hilary:\" He's a fifth column traitor and a useful...... Oh sorry wrong show\""], ["@Nidatuerrow", "Why do journalists always get lost and ask the same question Putin already provided a detailed answer to?"], ["@11solus11", "The interview could be with a mafia boss, as well, and the style of answering would be quite the same. \nPutin is a clinical psychopath with no empathy, remorse, responsibility, or accountability. The journalist did a great job by staying on track regardless of the typical manipulation techniques used by Putin.👌👌👌"], ["@daffyduck4195", "The US media portrays Putin as a corrupt and power-hungry \"mafia\" boss, but this interview reveals a rational leader with a focused mindset."], ["@RainbowRising", "53:37 what else you need?"], ["@odyssee4335", "Yes, Ewa Krawczyk, I would like to see, US president Biden being intervied by a critical Russian journalist and that being aired in russian TV, guess what, it won't happen...And why? It's not that difficault: In the west we've got Freedom of Speech, the most importent thing...And Russia?😂"], ["@MrWarlee", "now Carlson show how to do , tmies now changig , all TV chans now ending"], ["@AndreyAltai", "Ужасный журналист, невоспитаный, мерзкий."], ["@ih8momjokes1", "this is edited. beware the youtube channel"], ["@aum0aumgood", "Who is this interviewer?  Get someone competent to have proper communications ."], ["@madhua", "After this interview I can properly distinguish who is a real leader and a puppet with dementia . And by the way The whole western media are just a bunch of liars ."], ["@lahnhan7289", "Go watch the Tucker Carlson interview."], ["@valeri2175", "NATO is the evil 👿"], ["@rallumonslefeu3451", "Why does it always have to be this way ? The villains, always on our side, and the good, respectable, charismatic leaders on the opposite side... #wrongteam"], ["@Dr.Mabuse44", "Russians know what is happening in America, but Americans are unaware of much of Russian life, so where is a lack of communication or misinformation?"], ["@upgrade1015", "We notice YouTube didn’t ban this one ! Pure American state regulation media  some people may say. -Thanks Obama"], ["@upgrade1015", "NBC is just as much propaganda as CCP does some people may say  haha"], ["@danaabrahams8683", "This interview is terrible not one bit of information . So Putin remember the time joe Biden flexed and looked you in the eyes ? No he said u looked away first how do u respond Americans want to no who you think would win 1on 1"], ["@bealzy", "Carlson's interview is better 🎉"], ["@bobcougar77", "This interviewer thinks that glaring at someone is deep journalism."], ["@Cervin1776", "Absolutely ridiculous that NBC would hide behind a 2 year old interview to cover the Tucker interview..."], ["@Cervin1776", "Isnt this man commiting treason?"], ["@leonidmalenchii9949", "Play Tucker Carlson"], ["@davidjoyce2247", "Fair play TUCKER CARLSON FOR GETTING THE TRUTH      NATO ARE A WAR CRIMINAL ORGANISATION. IT SHOULD BE SHUT DOWN     PUTIN HAS A DECENT RUNNING BRAIN NOTHING LIKE JOE BIDEN"], ["@jimmyjemal8802", "Why on earth would you believe a word from a Russain politician. Putin is a proven lie. How many times did they say they would not invade. Their negotiation means taking over someone elses country and Ukranians dont want to hand over their land. Who would want that. Putins oponents. They are either dead, in prison or not allowed to compete. Guys. Putin is a dictator in a single party state."], ["@chaoticsix", "The interviewer can learn alot from Tucker Carlson!"], ["@user-cs9vm2bl1v", "Слава России🇷🇺"], ["@markrauner1271", "NBC traitors!"], ["@snipezgreased6952", "Is the guy talking for him is the same guy writing for Biden 😂"], ["@user-hu9jg9yh3u", "Full interview goes around 2 hours actually."], ["@saitama1151", "Путин красавчик 💯 мировой лидер"], ["@ThatOldBlackMagic_YouAppear", "Hey atevcuz wave us swear I square."], ["@ThatOldBlackMagic_YouAppear", "Fsu such a much a MTN lift here then But post it card barfed a civil wars wuzzed much bRfs monuemMENTAL."], ["@ThatOldBlackMagic_YouAppear", "Ii ind Jiji alien wayin . For nutes strung seer baffle meet ukreen wheat my SPICES spoof."], ["@oliverstaunton10", "Ahhh i love where they're talking about the American in jail in Russia and Putin points out that if the guy did the same crime in USA (get drunk and punch a cop) then he would've just been shot dead"], ["@ThatOldBlackMagic_YouAppear", "Eye be squared A DS"], ["@xiang1569", "不论普京说了是两个小时，还是20个小时，但我看到了这样的事实:普京发动了战争，夺走了别国的领土和人民。"], ["@ThatOldBlackMagic_YouAppear", "Wrath fro from some quest eye be lil b"], ["@ThatOldBlackMagic_YouAppear", "SM Eye * A^I"], ["@ThatOldBlackMagic_YouAppear", "He's"], ["@ThatOldBlackMagic_YouAppear", "An fro uncle he a No ."], ["@ThatOldBlackMagic_YouAppear", "Sin politeness begin Sayer wrath. A DsG"], ["@BOman6789", "I do not know if this journalist is delusional or very confident. Obviously the line is thin and determined by perspective. This interview was just a laundry list of accusations in the court of public opinion. This did not seem like a good-willed discussion for understanding, but more of a trial by western media. I would love to see a Russian journalist or Palestinian journalist sit down with President Biden and accuse him of war crimes and state sponsored terrorism. To even think this type of interview is acceptable behavior as a guest in another nation really sheds light on why the Russian-American state relations are poor."], ["@fhe3220", "putin=spin doctor"], ["@andrewwojcicki6762", "What the rudd ,condescending  pice of trush is this US  \"journalist\"."], ["@Pjc0869", "Just to put in perspective in our world it’s like England trying to invade wales mr putin it doesn’t work trust me in hand to hand combat ? So basically you’re sending your troops into battle like trench warfare in which no one wins you murderer of families and must insist this goes on your grave stone"], ["@PieProtector", "why did Putin invade Ukraine where he said he wasn't at the start, why did he move his troops closer and closer saying it was drill exercises? Why has Putin started a war with a peaceful country?"], ["@chrisyonts9652", "I trust Putin more than NBC."], ["@china_airguns", "Putin is such a smart man and the US reporter is just looking bad. I think it's only good, fair and right that Putin addresses all the unpleasant truths of the USA in order to show the USA and especially the US citizens that everything that the USA throws at Russia has already been done by the USA itself. I think it would be in all of our interests if the eternal clash between the USA and Russia finally came to an end, especially since it makes absolutely no sense. Russia doesn't want anything from the USA and the USA shouldn't want or expect anything from Russia. Russia doesn't want to attack the USA, they just want peace and security for their nation and that is absolutely legitimate and understandable."], ["@elusiveshadow1982", "Oh and his temperament towards confrontation is very impressive."], ["@elusiveshadow1982", "We all have our opinions of Putin,BUT,Putin owned this interview,the journalist trying to play hardball failed miserably...... this man is no fool,not even slightly."]]