[["@patrikpatrik421", "Evil women😈"], ["@duongbui2617", "Seems like smart-steve obsessed with the term \"Russian invasion\""], ["@patrikpatrik421", "Yes putin is a real gentleman... in hell"], ["@mazas1550", "SLAVA UKRAINE!"], ["@lisaschauer5371", "Genau! Und Serienkiller können ja auch sooo charmant sein😝 Ich hoffe, dieser Tr*** bleibt, wo der Pfeffer wächst"], ["@clemensottawa1780", "And Putin, the true gentleman, will ride on a horse to find his Princess Karin Kneissl. 😂 I think, it was 10 years ago, that she started to loose controll on her life."], ["@zdenekmrlina", "BBC that is what I pay for  every year    Listening to these clowns"], ["@AntonioRodriguez-no4er", "Not un provoked invasion, he still sticks to that stubborn phrase when not even his bosses believe it was unprovoked, by know everybody knows why it happened."], ["@user-dk1bv9ck1p", "Putin = Hitler 2.\nPurin has murdered hundreds if Ukrains. Has just murdered one of his own  people - Navalny.\n\nPutin does not obey to the international prisoning rulls.\n\nThe fact that a Russia own citizens that oppose to Putin are   sudenly found dead at prison  cells is against any international laws. \nYet putin clains that all others like\n\n Israel and Ukrain are the ones the act against international laws.\n\nLets make it clear. Putin is a terrorist like Daesh Isis , like Hamas Daesh, like Iran leaders , like once Sadam Husain , Like once  Kadafi  , like Many history murderes and terrorists...\n\nPutin is not fit to lead any country.\nHe is a cold blooded murderer."], ["@ravelitschimo", "At least a little bit intelligence in Europe"], ["@jon123xyz", "Stupid is as Stupid does. Useful idiot and modern day Tankie. Jane Austin gentleman ... she has a crushnon a cold killer. Bye."], ["@kc4276", "I'm gonna be honest: the West (ie the US) has done and continues to do much worse. I simply don't care about Ukraine any more than I do about any other country. If Ukraine is a wrong, then so was Afghanistan and Iraq and Vietnam etc."], ["@fabribeijing", "\"Unprovoked full scale invasion\".\nNeither unprovoked, nor \"full scale\".\nSteve, when your requests for interviews with Putin get turned down, do you ever consider that your lies could be the reason?"], ["@aerohk", "This lady loves Putin, so what lol"], ["@AceManifold", "\"Unprovoked invasion\"?  This guy should watch Oliver Stone's documentary film Ukraine on Fire (2016).  This shows how the American CIA promoted riots to remove the duly elected Ukrainian president (Yanukovych), which was certainly a preparation for the provocation.  I guess being rude is an expected characteristic of BBC interviewers.  Maybe Chris Wallace should go there."], ["@panagiotissanozidis447", "Don't mention Iraq on BBC 5000 miles away from Britain and double of USA but ofcourse is justified by the west."], ["@PEST-rn7ip", "Excellent Ms. Kneissel .. the Rosenberg is another weight level far mor belowe yours-)"], ["@spilot1016", "This turd is such a clown, it's beyond comedy"], ["@marina1463", "Her huspend said she abused him. So according to him she is not a gentlewomen. BTW she works in russia"], ["@grahammitchell4142", "Typically BBC biased Interview with an obnoxious tin-eared reporter.  What else can one expect from a despicably leftist, woke and delusional self-styled Media organisation."], ["@addisbuzz", "I had anticipated that the journalist would delve deeper into her plans for her think tank, focusing more on her intended initiatives rather than delving into personal matters. I am optimistic that her efforts, in one way or another, will play a significant role in achieving a lasting solution for peace in Europe."], ["@jimnygf", "I can't  understand how the media still spreads  this idea of Russia being the bad guy and Vladimir Putin the Devil in person. With all this, you (US and NATO) are only going to get us in ww3, and the only reason for you  to do so is to fill your pockets with war money.... Disgusting ! :("], ["@AnnedolfFrankler911", "Calling the invasion unprovoked always shows how ignorant or how much in denial they are."], ["@user-yt2vd9gz8y", "This lady takes no crap, full respect"], ["@user-yt2vd9gz8y", "Presenter said 'unprovoked' Who's he trying to kid, where has he been for the last few years?"], ["@DOFDIFBF", "Unprovoked? 😮"], ["@catchmonster", "Woman is super smart!  Very smart."], ["@Proxymated", "Bad idea thinking you can threaten her future if she doesn't go along with yankee propaganda when she already lives and works in Russia."], ["@user-xb6kh1qo4y", "BBC, \"The dog is bored, the dog has fallen asleep and is snoring.\" BBS, I know - you don't know shame, but now I've begun to understand - you don't know self-preservation... so sad - you're doomed. The Darwin Award definitely belongs to you!"], ["@sp7873", "the less intelligent people fall for the charming play of psychopaths.."], ["@lukavuksevic7420", "clever woman"], ["@milicailic6747", "Bravo lady"], ["@tinapatton7346", "21st CENTURY PEACE, Prosperity, Progress, that should have been...\r\nBUT for pro-WARS, pro-GREED Psychopathic US WAR-Criminals. \r\nSTAGING 911/Fratricide Mass Murdering thousands of their own people, then ILLEGALLY invading Iraq, Afghanistan & the Middle-East endangering and sacrificing their own troops Mass Murdering millions more innocents and causing a mass-migrants crisis in Europe. shifting the whole World agenda to the far Right, self-justifying mass surveillance Worldwide, plus Wall St Bank$tas crashed the whole World economy still not recovered. \r\nWhile PERVERSELY calling pro-NATO Putin 'a threat', and now want HIM arrested?!\r\nPointed out in September 2022, during the 7th month of the Ukraine War interviewed by Channel 4 about his nine meetings with Vladimir Putin, ex-NATO Head George Robertson said, \"At the first meeting (in Moscow, Oct 2001) Vladimir Putin clearly said, 'I WANT RUSSIA TO BE PART OF WESTERN EUROPE...at the 2nd meeting (in Brussels) he said..'WHEN ARE YOU GOING TO INVITE RUSSIA TO (apply to) JOIN NATO?'...I started to sort of reach out and engage them in so many activities that they basically couldn't fight with us.. but after I left NATO (in Dec 2003), the American administration, the Bush administration (DURING THEIR OWN ILLEGAL WAR ON IRAQ opposed by Putin), lost any interest basically in doing business with Russia, they saw it as a threat..they didn't really want to make it part of the overall partnership (for Peace). I think we missed an opportunity at that time because I think it's what he (Putin) wanted, and we could have grabbed hold of him!\"\r\nhttps://www.youtube.com/watch?v=sTuTsQ1kuYU\r\nFeb 2022, quote formerly pro-NATO Putin rightly stating before wrongly invading, \"De-Nazify Ukraine.\"\r\nIn 1994, Russia was the first nation to join 'The Partnership for Peace' program, and on 27 May 1997, the NATO–Russia Founding Act (NRFA) was signed at the 1997 Paris NATO Summit in France, enabling the creation of the NATO–Russia Permanent Joint Council (NRPJC).\r\nhttps://www.washingtonpost.com/archive/politics/2003/03/18/russias-putin-calls-iraq-war-a-mistake/7fff0ba1-bfda-4970-a1a9-f7c7afd6aaa2/\r\nhttps://www.washingtonpost.com/archive/opinions/2003/03/15/a-russian-resolve-for-peace-and-partnership/9def3866-c8e1-41c5-ab88-50ba0cf3e1fa/\r\nMeanwhile, the WORLD'S WORST WAR-CRIMINALS USA killing millions (including pregnant women/unborn babies, infants, children, the defenceless elderly and disabled in their own lands) - DON'T recognize the INTERNATIONAL CRIMINAL COURT!\r\nhttps://www.npr.org/2022/04/16/1093212495/the-u-s-does-not-recognize-the-jurisdiction-of-the-international-criminal-court\r\nWasting TRILLIONS in much needed public money diverted to PROFIT the unelected Military Industrial Complex endangering and sacrificing his own U.S. Troops and millions of innocents \"GEORGE W. BUSH, WAR CRIMINAL? The Bush Administration's Liability for 269 War Crimes\" - by Professor Michael Haas.\r\nEminent jurists, professional legal organizations, and human rights monitors in this country and around the world have declared that President George W. Bush may be prosecuted as a war criminal for his overt and systematic violations of such international law as the Geneva and Hague Conventions and such US law as the War Crimes Act, the Anti-Torture Act, and federal assault laws.\r\nProfessor Michael Haas identifies and documents 269 specific war crimes under US and international law for which President Bush, senior officials and staff in his administration, and military officers under his command are liable to be prosecuted.\r\nProfessor Haas divides the 269 war crimes of the Bush administration into four classes: 6 war crimes committed in launching a war of aggression; 36 war crimes committed in the conduct of war; 175 war crimes committed in the treatment of prisoners; and 52 war crimes committed in postwar occupations.\r\nFor each of the 269 war crimes of the Bush administration, \r\nProfessor Haas gives chapter and verse in precise but non-technical language, including the specific acts deemed to be war crimes, the names of the officials deemed to be war criminals, and the exact language of the international or domestic laws violated by those officials. The author proceeds to consider the various US, international, and foreign tribunals in which the war crimes of Bush administration defendants may be tried under applicable bodies of law. He evaluates the real-world practicability of bringing cases against Bush and Bush officials in each of the possible venues.\r\nFinally, Professor Haas weighs the legal, political, and humanitarian pros and cons of actually bringing Bush and Bush officials to trial for war crimes.\r\nhttps://www.abc-clio.com/products/c8109c/"], ["@philliploco5037", "I totally support Vladimir Putin"], ["@parsiuskarma5028", "BBC bull shit at the prime. Awesome how the lady put his head in his own shit"], ["@Cheguebuddha", "This journalist is a thug! Come to and ask me a question or two you little .... !"], ["@Cheguebuddha", "What do you mean by \"unprovoked war\"? There was civil war already in 2014 untill 2022!"], ["@JuliusFawcett", "russia will be stuck in the donbass until putin dies, every day drip drip drip his power diminishes, he could be an absolute genius, but he's not going anywhere, the rouble falls as the dollar strengthens, new york won suck it up"], ["@picassomicasso1", "She is right. Putin is a smart guy"], ["@user-mb8xo1mi8w", "She doesn’t want to criticize Putin"], ["@capnobvious2718", "Why don't you talk about the USA and it's MULTIPLE illegal wars?  Anyone inviting Brandon to their wedding is repulsive, disgusting, and embracing murder."], ["@roychain4877", "I love Putin a wonderful President in this 21century smart cool clever intelligent leader glory Russia 🇷🇺 ❤❤❤South Africa ❤U"], ["@JUSTSANDRUDEMANNSTORM", ""], ["@josemunozg9755", "El más inteligente de todos.🎉🎉🎉🎉"], ["@chivalrous_chevy1163", "After this interview, we stand our ground."], ["@user-zk4hy5qy7l", "Прикрасная, умная,искренне добрая, милая, красивая, позитивная, настоящая ЛЕДИ!!!!!!! Благодарю за уважение к нашему любимому В. В. Путину и России!!!❤❤❤❤❤"], ["@giadaforneris6735", "She sound like a intelligent, brave and free person, I like the name of her wonderful dog. When questioned on repression in Russia, I must say she should’ve mentioned the repression we are experiencing in democratic Europe 😢"], ["@njcb17", "👏👏👏👏chapeau Madame Kneissl, not easy to talk against the mainstream and stay true to yourself"], ["@Samuray_nm", "Later, she will be called a pro-Russian head. That's all you need to know about pseudo-democracy."], ["@stepper8584", "It's easy to critize other countries, yeah people go to prison for anti war rethoric, I believe in my country (Netherlands) as in the majority of Western countries it would also be illegal during actual war times!\nI won't forget like the idiots how during covid suddenly we lost our fundamental \"rights\" (they appeared to privilages not rights) like the right to demonstrate (everybody who tried that got beaten up hard) or to worship at a church/temple, to gather with family in your OWN house... \n\nSo if we wage war for the very survival of our nation, we go back to WW2 times probably...."], ["@user-ec4wz5sm1b", "She is crooked. Anyone friends with the monster is also a monster. She can stay in Russia and rot."], ["@joseaugustofigueiredo2796", "President worthy of the great, magnanimous and victorious Russian nation!\nRussia has the largest economy in Europe and the 5th in the world, says Putin\nThe Russian president said that the country's performance in 2022 and 2023, with a small drop in the first year, and a possible growth above 4% in the second, had surprising results.\nVladimir Putin, President of Russia, admitted that Russian Gross Domestic Product (GDP) growth in 2023 could be above the projected 3.5%.\n\"More than 4%? Well, maybe so. We had a decline in 2022, Mikhail Vladimirovich [Mishustin, Russian Prime Minister] told me this before coming here, the decline we counted on was 2.1%, it's actually over being 1.2% [...]. Therefore, perhaps there will be more GDP growth\", he said in a meeting with businesspeople in the city of Khabarovsk."], ["@darcydomanko6396", "Putin is class act, number 1."], ["@chrissharkey6172", "Another  halfwit  with Russia  phobia  how many  times  Russia  never  started  this"], ["@felixgates7930", "Do you disagree with her.. If You do ,is your business. I do agree with her 💯%. The more the West try to demonized him ,the more well meaning citizen of the world love him.. The world will always stand with anyone who stood against the hypocrisy of the West..."], ["@kn0wmore126", "Always with the 'do you condemn the situation'... When has the UK ever condemned their own atrocities? Or those of countries like Israel?"], ["@christinakiki75", "yeah well try waving a Russian FLAG in UK or Netherlands...repression in Russia...lol"], ["@RichardDavies-pf4dd", "This BBC interviewer is an ignoramus repeating Western media bias. I would like to see him interview Scott Ritter or Douglas Macgregor."], ["@lysenko_nikolay", "bbc is a disguisting piece of shit"], ["@MarcusBrutus-nu9yj", "It not that he's smart it's just all the educated Russians have been killed"], ["@Zelioni-ts9fd", "Well this took a very strange turn, to say the least! Is she still married to the same guy or does she only have the dog anymore? So he's in the country Russia interviewing her and spewing all this nonsense about the president... why isn't he in the gulag then? For her as for her she seems also a little bit ditzy and clueless if that is what her response to the first BBC interviewer was! I'm surprised President Putin invited her to be in his country after her here words of treason. After all, they got rid of Gerard Depardieu for much lesser talk. Yes she is lucky Putin does not use the internet and nobody has sent the Kremlin this video yet!  where would she go next?"], ["@Zelioni-ts9fd", "Unprovoked invasion?? 🤨 another fool drinking the CNN Kool-Aid! And this is what passes as journalism in 2024? Do your research idiot!"], ["@mikhailyuren6781", "Invasion talk about Invasion is it not what united states has been doing for decades with nato"], ["@testimonium6596", "Honest and clever woman she is indeed. Not as this slimy dishonest character she did interact with ... or against ? God bless Russia and Vladimir Putin."], ["@brankareichert7997", "To recognize an inteligent person you have to be one\nUnfortunately there's not a lot even a few of politicians this days."], ["@muffy4300", "viva putin !"], ["@vmaysov", "incredibly brave and smart woman!👏"], ["@francoisvorster3914", "Go Girl Go!! This lady really made a total idiot out of this clown from the British Bullshut Corporation."], ["@Socialhack", "He didn’t seem to want to talk about American crimes when she brought up the Middle East 🤷🏼‍♂️ This guy CLEARLY should not be allowed to stay in Russia as he obviously hates it and doesn’t know ANYTHING about what and who ‘started’ this ‘special operation’🤨"], ["@yacir", "Obviously, he single handily F'ed US the EU, and Ukraine combined! Taking \"Back\" custody of Zaporizhia the largest Nuclear plant in EU, cutting 'em off from much-needed energy, alone, is a smart move.  Further cutting Uranium stolen from Niger is another bold move..among many others."], ["@davidfognini8526", "Xi JINPING and V Putin are changing the world for good ❤"], ["@jesusjuarezflores2196", "The gentleman must interview Prof. John M. Mearsheimer (Ukraine) and ex-marine Scott Ritter (Irak) to learn several lessons of Geopolitics."], ["@jesusjuarezflores2196", "USA propaganda power. Everybody in the Western world believes that USA is a democracy. Since the beggining it has been a plutocracy. And it will be so.\nCorruption is legal in the US Congress. Find out about lobbysts.\nCitizens belong to a second class (ignored) category."], ["@jesusjuarezflores2196", "Karin Kneissl was subjected in her own country to a custom beloved in USA: Ostracism.\nThe only item bigger than USA cynisism is its propaganda capacity.\nMany years ago USA dictated hate vs Rusia and the European garden obeys faithfully."], ["@jesusjuarezflores2196", "\" unprovoked war \" (!?)    What has been doing The States since 1947 when invented NATO (North America Terrorist Organization) ?\nWhen Europe will learn that every time they figth each other the only winner is the evil USA?  80 billion/year military budget. Several hundreds military bases around the world.\nMany deaths all over the planet are the life from USA Military-Industrial Complex"], ["@enrique9432", "She was compelled to affirm that the special operation of Russia was illegal. 😂😂😂"], ["@gloriahoulihan8717", "I can understand why she is backing Russia!Cash!!! Of course she is not facing up to the repression. A seventeen year old boy who threw a failed Molotov Cocktail at a recruitment centre in St Petersburg was jailed for six years. His uncle had just been killed fighting for Russia. A woman whom I have become friends with was bombed out of her home in Mariupol and her dog murdered. Blocks for flats are being handed to Russian people.Stolen I would call it. The pension is £100 a month, is this adequate amounts.? I don't know. This dozy moron doesn't look like anything other than someone with the hots for Putin. He is a smooth operator and like a sleek shark. This is how he hypnotises old grannies in Russia to follow his lead. She fits the Russian playbook.Deny,deflect,shrug. Stick a few letters and credentials behind someone and everyone is impressed. I bet she slept her way into her jobs in Austria."], ["@549Mirabelle", "He is ❤"], ["@issTachankaBlyatsuka", "Clearly, someone who cares nothing for human suffering. Shameful wretch."], ["@vojtechblaha1746", "Lecturing about opression keeping Julian Assange in prison - typical british hypocrisy"], ["@BStrapper", "Her grand father was an active party Nazi member, why wouldn't she love, admire and support Putin?"], ["@omerta-omega", "DAMN  MAN SHE CADASTRED HIM AND TRANSSEXUEL HIM PLUS  BITCHSLAPPED HIM  SO MANY  TIMES ... , HE WHEN HOME TO ASK  HIS WIFE TO USE HIS NOVEL  Dildos  WITHOUT VASELINE....  YOU KNOW THE  VERY  BIG ONE ...  OR MAYBE HE WAS THINKING  GCHURCHILL WOULD BE BETTER"], ["@alexkozlow7489", "Another good example of sanctimonious, biased and base Western journalism.  Western journalists are totally enmeshed and co-dependent in the official narrative which most of their corrupt leaders force on the population through  a media which is without ethics or conscience. And does their bidding. The for er Former Austrian FM is real woman who is honest, straight and able to stand her ground with Integrity against the juvenile like pushy warmongering views of a clown of the Western estab.ishment. John Milton's words are particularly apt in characterzing the current ethos of journalism and its pushers \"Filthy foul and full of vile disdain.\"  To the ex Austrian FM - Bravo !!  A role model of a real woman who stands her ground with real integrity in these dangerous times when Western men abdicate their integrity and objectivity and become tools of the highest bidder.      AK 47+"], ["@andreistan5497", "Steve Rosenberg = BBCue school of \"are you saying...\". Pathetic !"], ["@williamvanholder3368", "a woman like the devil she is, admiring the biggest mass murderer of the world, Putin, unbelievable"], ["@marthacal1", "This is  very bias interview to make the Austrian foreign minister look bad.... Petty journalism of the worst kind!!!"], ["@yuliyakuzina7689", "fuck off interviewer with your \"unprovoked\" invasion = provoked by the US war. We know what you are doing. fuck off bbc. Awesome woman - haha - she is so politely laughting at you - highly likely loooolll\nThank you for accepting the offer Professor Kneissl"], ["@diogocatalano9557", "The interviewer's concern regarding the free speech is hilarious. These minions of the mainstream media are, above all, great hypocrites."], ["@khanji4504", "I'm very intrigued on why there's a Lebanese flag on the table to his 5"], ["@kumho1321", "She was always a Russian mole in both the Austrian as well as the European Union governments! A Russian agent!"], ["@jospehmoore6625", "She made him look the colonial idiot that he is. Good Job. The western media is finished because of clowns like this who are controlled by their governments. He wants to talk about oppression let’s talk about real oppression, let talk about how his industry gives him an ultimatum that he will conduct interviews a certain way that makes Russia look bad because his government cant deal with the fact that Putin finally said enough is enough with the NATO expansion up to their borders and put a rocket up their proxies asses. Anybody with just a quarter of a brain 🧠 knows that Putin is 1000 time more a leader and a man than any and I mean any of these corrupt bought off western leaders that have sold their souls to the devil along time ago"], ["@DRIM_MC", "I would vote for this wonderful woman if i was austriam"], ["@Junder69", "Once he said unprovoked he revealed many things."], ["@user-hb9rl3ht4p", "He says unprovoked 😂😂😂😂😂😂😂😂😂😂😂😂😂 good joke."], ["@MatthewPeterMatthewPeter-gb6nc", "May LORD JESUS MOTHER MARY BLOOD OF JESUS\nPlease please Helps Protects Saves Russia Russians Russian army Putin\nAmen Amen\nGOD bless Russia Russians Russian army Putin\nAmen Amen\nPutin\nThe greatest greatest ever president on planet earth"], ["@richardivey9186", "Führer Vladimir Putin wins the John Gotti award again. What's next is for Francis Ford Coppola to make a Godfather film featuring Führer Putin as the updated actor for Vito Corleone."], ["@rodrigoshiozawa", "He's indeed a very smart man, much smarter than any leader of the West"], ["@adelaredding1594", "Is this a journalist for real??? so biased!!! and ignorant!!! check history, for a year Ukraine attacked and killed the Russian-speaking population and no one said a word!!! now it is just fair that Russia responds to that aggression and defends its citizens !!!!"], ["@Amit_Kshatrap", "This BBC gentleman have a knack to put words into other's mouth,like he was doing with her."], ["@juanaybar1395", "BBC SENDS A RUDE INTERVIEWER FOR A SMART LADY.😏"], ["@aliocal6613", "YAKIŞIR YAKIŞIR YAKIŞIR Putin Başkanıma Sayğılar,  Dünya + bütün gezegenler satranç şampiyonu"], ["@elmarre07", "Unprovoked 😂😂😂😂"], ["@rakeshsv8579", "At 3:55 we can see the true colours of this man."], ["@TheBorg01", "What a smug Journalist and still gets destroyed by old lady !!!"], ["@donaldsmith7824", "Unprovoked???? To believe unprovoked is to be either naive or stupid or both."], ["@eddieparsons8707", "BBC you are a broken record"], ["@johnnymentero6313", "The woman is correct. Putin is very intelligent. One of the most intelligent man to walk this earth. \nSomething nowadays most western politicians + CIA propagandists and media (like this \"journo\") put togheter are incapable to comprehend because the vast majority of them falls under the Dunning-Kruger effect.\nToo stupid to even know they are such.\nThey categorize Putin as \"an alpha male\" when he's a Sigma.\nThey fail to even know that. And you know it simply because they keep poking at him expecting an irrational uncontrolled outburst of an answer which never happens.\nHe keeps dodging, outflanking and outmanuvering them with ease. And they still are unable to figure that simple fact out. 😄"], ["@xalexander1996", "Huge respect for this woman."], ["@isaacnamini3976", "PUTIN IST  EIN  MORDER"], ["@aurevoir5", "Excellent answer, and no doubt, as intelligent as the man she described."], ["@Muradlek", "she is genius. hahah. reporter showed us his iq lvl, highly likely. haha"], ["@gedjon6176", "This BBC man is an arrogant idiot. Many nonfree Western Journalists like thi idiot are puppets, singing the song of their fascistoid bosses."], ["@ripabdg19westjava12", "Jurnalist propaganda"], ["@abdulbari5054", "Great Answers. She got no job in Austria because of her dance despite having decades of academic experience but now he is shamelessly asking low standard questions"], ["@johnmcentegart007", "This Journalist Rosenberg needs to report the news and not include his opinions. The British have a hidden agenda"], ["@natureallseasons", "your WARs in USA and Europe were plotted by Elizabeth and her indian, they are behind robberies, house break INS and theft with Lee Hsien Loong and his ministers, police, certis Cisco, tied to escorts hookers impersonating CCTVS, harassing non stop for money and CCTVS, they break into homes to steal repeatedly, they stole all your TAXs to fund your OWN WARs, did it again during the pandemic. Lee is behind all the crimes with LIN -YIH, POH hock guan, Wayne Li, Sadon Suraiman, Jeanette AW, Fann WONG, WONG kan Seng, Chan Sek keong, NG Joo Hee, Chan Wei Hong, Melvin Yong Yik Chye, TAN Chuan Jin Tharman Halimah YACOB, Masagos Zukifli and more all stealing for a living . Inside Clementi HQ, Jurong HQ, Bukit Panjang, Bukit Batok nearby stations. Lee Hsien Loong is behind drug trafficking, prostitute trafficking and robberies with WONGs tied to WONG kan Seng, NG Joo Hee, Dexter NG, they have been stealing non-stop, house break INS and robberies, bank frauds, all your WARs were all done by Lee Hsien Loong and his ministers, police with escorts impersonating CCTVS, Fann WONG, Jeanette AW, Kate Middleton and Megan Markle. Elizabeth plotted all the WARs past and present with Lee Hsien Loong, they are behind drug trafficking, prostitute trafficking and robberies to cover up for themselves, Lee Hsien Loong broke into homes with LIN-YIH, POH Hock Guan, Wayne Li, Sadon Suraiman, Tan Chuan Jin to steal repeatedly. Tied to the police with Fann WONG, Jeanette AW in banking frauds. With Elizabeth and her indian. Your WARs were all plotted by escorts Fann WONG, Jeanette AW, Kate Middleton and Megan Markle tied to the Singapore Police in drug trafficking, prostitute trafficking and robberies under WONG kan Seng, NG Joo Hee, Melvin YONG Yik Chye, TAN Chuan Jin, Tharman, Halimah YACOB, Masagos Zukifli, Vivian Balakrisnan, KShanmugan with her indian in the UK. And more all looting for a living inside certis Cisco, police hired by Lee Hsien Loong and his indian Malay ministers. Inside Certis Cisco, police tied to escorts impersonating CCTVS. They looted out all the TAX payers CASH during the pandemic"], ["@DinuGranaci", "BBC is deaf"], ["@ocean_romance5478", "So self righteous tools ⚒️"], ["@ocean_romance5478", "English are such idiots."], ["@ocean_romance5478", "Pommy stuffy toffee idiot!"], ["@ocean_romance5478", "British Bullshit Corporation!!"], ["@itsarsa262", "I think Europe is soon going to be Animal Farm,\" George Orwell."], ["@MetaTimis", "Yes, satan is most intelligent gentleman, he kill inteligent. Remember Auschwitz."], ["@igorvasin6960", "NATO countries invaded dozens of countries, destroyed infrastructure, killed civilians, claiming that this was necessary collateral damage. NATO countries created and armed most of the terrorist movements of recent decades. NATO countries interfered in the internal affairs of countries by organizing a civil war there and bringing criminals to power! NATO countries continue the policy of neo-colonialism by suppressing the development of countries with natural resources or located in strategically convenient places. The aggression that the whole world faces from NATO countries is colossal, while the magazine is trying to humiliate this woman using Russophobia and racism. how far the field of journalism has fallen in the West! It was the United States and its European colonies, through the hands of criminal groups, that overthrew the government in Ukraine and began to prepare Ukraine to become cannon fodder against Russia in NATO’s policy of enslaving countries. Russia is just defending itself."], ["@wagrof", "She is absolutely right in this matter, Putin is a brilliant genius, a leader with high intellectual capacity. I had the honor of witnessing Putin in live discussions and answering questions. His level of knowledge about different things is astonishing and extraordinary. Russians are lucky to have such a president."], ["@jamieleslie1177", "Goddam BBC is disgusting. What have we become in the last few years. Disgusting. Brits arent represented by our governments."], ["@virgiliustancu9293", "The Western World is dying in idiocrasy."], ["@Moskit.73", "Интервьюер глуп и ангажирован. Он от самого Путина \"получил по носу\". А  Карин удивительно корректна, умна, и очень вовремя говорит то, от чего у этого журналюги должна появиться изжога:  правду! И ее нельзя не уважать за это."], ["@vladbarbat3303", "It is obvious. If you are an idiot, all men around you are a match..."], ["@gordonwellard1415", "I stopped paying my TV licence the day RT was taken off our freedom loving airwaves..\nThis male interviewer is bought and paid for  by our warmongering elites.."], ["@benfranklin1770", "This Canadian supports Ms Kneissel. She is a very brave woman!!"], ["@katerinaperkova8709", "It looks like a school leader disliked someone uncomfortable and everyone who seem to be in touch with a cancelled guy are being shamed and pressed upon. The point is people got braver and smarter all around the world to follow these bullish manipulations."], ["@katerinaperkova8709", "What a beautiful, intelligent and very strong woman!"], ["@akap_987", "The British ruling class are the nice people….lest we forget. So innocent and virtuous!"], ["@user-lj5sk8vu4f", "Сколько военных конфликтов устроили янки по всему миру?\nСколько грязи, сколько лжи и обмана других стран?\nСколько военных баз по всему миру контролируют правительства другтх стран?\nСколько нефтянных вышек стоит в ираке, сирии, ливии ?\nВерните золото тупые американцы! Французам, бельгийцам, итальянцами, русским.\nВы экономические военные преступники!\nИстория расставит все по местам вот увидите"], ["@MR-tn5kv", "He is indeed."], ["@ImCHN24", "BBC is again proving that they suck"], ["@anuta789", "\"Gorki\" is not english word...\nIf she don't know Rissian, she couldn't come up it by herself."], ["@anuta789", "Somebody from Austria know this woman?\nBecause she crazily looks alike my ex mother-in-law."], ["@anuta789", "Somebody from Australia know this woman?\nBecause she crazily looks alike my ex mother-in-law."], ["@qaswedfr1234", "Putin is running down hill now"], ["@user-yh3do3pk4y", "What about Joe Biden 😂😂😂😂"], ["@user-yh3do3pk4y", "What about Joe Biden 😂😂😂😂"], ["@radisazivkovic7818", "Putin❤"], ["@user-xo1ov2bb9z", "Karin Kneissl can listen to anyone and talk with anyone. Journalist just doing what his boss told him to do, he wasn't that smart"], ["@gerarddenormandie6307", "Yes"], ["@user-yp2ui7nn4k", "\"Unprovoked aggression.\" It's funny, all Western journalists put the same phrases in every sentence. Like parrots. One would think that their vocabulary is limited. But no, this is one instruction for everyone. The United States and the EU have been provoking for twenty years, and now it turns out to be unprovoked aggression.."], ["@visnjalivancic3953", "Well done Madam , what a smart , brave women,  BRAVOOO ❤👏👏👏, this man is showing bad British arrogance"], ["@adrianc.demery8872", "❤❤❤🙏🏾🙏🏾🙏🏾♥️♥️♥️"], ["@Esoterica-Arabic", "Frivolous reporter"], ["@jant.carlsson5061", "British reporters are travelling to other. cuntries and lecture people. Pompous f****ng idiots! 🇸🇪❤️🇷🇺"], ["@NicholasKonig", "https://www.youtube.com/watch?v=l6y3l9xLBRs"], ["@ptrxos", "This is why BBC is bs nowdays... \"unprovoked\"? Really??"], ["@Knightonagreyhorse", "If she is a spy it is not for Russia..."], ["@jeanninelouw3632", "He simply doesn’t listen to his guest"], ["@K-xr2ok", "❤❤❤ браво на тази жена!"], ["@user-jb9jr4yk3o", "Putin is more intelligent than any ten North American liberals aggregated."], ["@hookprobe", "ahahaha, traitors"], ["@davidfoster2006", "This women is not as wise as the ex Queens corgis who growled as they recognise that little Putin was an evil man."], ["@Snukt", "Wow, BBC journalism is real shit"], ["@Zanne11", "She puts him in his place a number of times. Good for her. Yes, he is asking boring questions and she refuses to play along with his \"dirty fantasy\". Brava!"], ["@user-wz7bt9cc1f", "англичанка гадит! 😂😂😂"], ["@translateon.georgian7765", "Invoking to treat the enemy as they deserve seems inadequate in the EU. However, I suppose calling the enemy by their name is still achievable. LFMAO"], ["@HJF091173", "Britons and americans legitimate dozens of wars ... Always that disgusting double moral. They must think that the rest of world is stupid or something"], ["@watanpal9041", "The world must admire this woman who faced the controlled western media and answered worst question without any hesitation. Austrians must be proud of her."], ["@krystynamojsiej4221", "Yes Mister Putin is man a great class in every sense....I admire him ..."], ["@ECG.767", "Unprovoked war?! What a joke! NATO is on who’s doorstep. Cause and effect. Action and reaction. I don’t support war but let’s be honest now."], ["@climatescientist", "such dumn journalists out there"], ["@erkinbekyusupov6024", "World changed after the war in Iraq. It’s amazing 👏🏻👏🏻👏🏻"], ["@cusimilooking4965", "I must be in a radical bolchevic site , AMFs."], ["@cusimilooking4965", "\"Brown Shirt\"!!!!! She should apply for Russian citizenship !!!"], ["@georgebalan8452", "This is a disgrace of human being. Rage that is showing beneath that calm posture... Shameful. Whataboutism, \"no repression in my immediate surroundings...\" Good lord.... Well done, BBC!"], ["@zebakhawaja", "Why does USA always breaks the International Laws of War and never has been condemned? Is it because these International Laws were enforced by USA, and the The AMERICAN MADE United Nations Security Council to force all other countries to uphold their own made International laws while the USA the Isreali don't uphold and follow themselves but condemn other for what they themselves do? That's The UN being unfair and unjust and hypocritical. The International Judges at security council judges at the United nations then are biased and unjust!"], ["@S_dott", "She speaks rightfully I believe her and I’m confident Putin isn’t what the westerners stereotype him to be."], ["@Yosarian22", "Одна  из немногих политиков, которые вызывают уважение 🫡 \nСильная и честная"], ["@kitty6720", "Kudos to Karin for sticking it up to BBC!"], ["@JamesBarry-lc1lj", "I admire this woman!!!"], ["@lisalove6327", "Libras"], ["@luisbrayllebelo4973", "you must look at a video, a DOVE shakes her wing to Putin, it means holy spirit blessed him. A  bible reader never defeated by anyone else. Jesus is king all over the king he gaves authority to Putin to destroy western and USA hegemony"], ["@user-gk5rm3co2v", "None one in US is thought of accordingly as well in the leadership or leader WOW how honestly true"], ["@oleksandr8371", "Scholars and academics dodging their own morals and ethics is a sight to behold. Good on BBC to expose the frauds in European circles. 30M dollars tax-free is a lot better than selling some books right Mrs. Kneissl."], ["@user-mh7hx5hj9r", "Putin is a clown like  many leaders.many people killed while they're living on steak and caviar 🙏\nTime for people of the world to realise, don't trust those in shirt tie and Italian suites.\nThe majority are being controlled by the minority 🙏"], ["@ben-g314", "Dancing with the devil"], ["@ingridkk7124", "Wonderfull rhe answers from this woman to a person that tried input the narrative. 😂"], ["@Semper_Paratus", "She is suffering a serious Stockholm syndrome, and it is crystal clear. Look at this face. My God! You are not the only one."], ["@georgewee1227", "BBC is still shameless"], ["@HamidA-to8vy", "Described as the most intelligent gentleman by the most stupid woman! Is it good time to compliment him? It is even insulting to Ukrainian victims"], ["@earbjr4715", "British hypocrisy! Bloke, give it up!"], ["@FrancoisMouton-iu7jt", "Love this woman. She doesn't give an inch to the usual bs BBC propaganda."], ["@ifemichaelo7457", "Let's not get started with the atrocities committed by the British government dating back hundreds of years till date.  Colonialism turned the world upside down as they occupied multiple countries using their advantage of advanced deadly weaponry"], ["@Muhammad52523", "Am happy for her❤..... Something is definitely wrong with Westerners u deny her a decent life, she finds a Better life and now u want to drop it...  😅😅 And they say they are not imperialist or hypocrites"], ["@vandasaragosa", "Always remember, American, Australian and African continent still live under colonial"], ["@Kshapo", "the reportor has a leash on his neck while the minister is free to express herself freely."], ["@WheelyabarrabackApiary", "A pity that Steve Rosenberg hasn't learned a thing from her. Russia should throw him out of the country. I used to like the BBC once. Now they just sit on their high horse pointing fingers."], ["@danieltimbers400", "PUTIN IS A G, I LOVE HIM"], ["@WheelyabarrabackApiary", "BBC interrogators at it again lol Take a good look at your own countries crimes."], ["@ashastormiji2233", "The hypocritical and haughtiness train of western mainstream media keep rolling on.😏"], ["@comedian12Months", "Mama on interview the Dog feeling very relaxed😂😂"], ["@gibbos1985", "How can he be allowed to get away with living his life when he has ended so many others? Bucha!! And all the other atrocities committed at his hands"], ["@EpicBench", "putin a real leader"]]