[["@bertbrouwers9277", "No attention to Putin threats. Are Germans cowards??"], ["@jeromejooste3493", "Nuclear war can only be started by the person who presses the button first. It sure is not going to be a NATO member."], ["@jonherken1874", "Putin says he will nuke if I pass gas??? The sky is falling the sky is falling remember chicken little? Remember the emperor has no clothes? We are so gullible."], ["@borreLore", "Russia: You will let me keep stealing territory, or I will destroy civilization!"], ["@sathishkumarkumar9008", "Sending troops to Ukraine by France Emanuel Macron before addressing media must think thrice what RUSSIAN PRESIDENT PUTIN will do, already one comedian zelenky seen one more can't able to see pls"], ["@aleksandarmilosevic6395", "One country did use nukes, twice"], ["@christiansock6309", "\"Threatening the world with\" coming from a little guy invading all the neighbors he can referring to the west...\n\nHilarious"], ["@oliversakanyi7238", "This Putin guy makes me sick"], ["@BryanKohnenkampf", "putin is short and impotent"], ["@shoot-n-scoot3539", "Are we going to let Russia boss us around?  NO.\nDo what is needed to stop Russia from expanding it's border through aggression."], ["@tolitsdterrible4785", "Putin really believes that western leaders are as weak and as scared as Olaf Scholz. 😅"], ["@007Zweli", "You could say the west has clearly been warned. Yes, he’s been threatening nuclear response but wouldn’t usa react the same if not worse?"], ["@kevinwilliams1768", "time to take it too Putin"], ["@Americaisarefugeecamp", "👍"], ["@zealot42o", "This putin dude doomed earth"], ["@robertstan2349", "blah blah blah. he's been making nuclear threat for the past two years. it's baloney. call him on it"], ["@MB-mn1ym", "There not gonna back down to Putin so I guess he’s bluff will be called !?"], ["@bassmanjr100", "The facts are these.  Russia took 20% of Ukraine, and NATO couldn't stop it.  Russia is economically stronger than most any country in Europe.  I think it is time for the dying to stop and make peace.  The West lost.  Especially Germany, which has basically been a loser country for a hundred years now."], ["@flesz_", "He warned for months about Ukraine\nWest didn't listen , so he attacked the Ukraine \nNow he warns about nukes\nHow it ends, you go figure"], ["@purplemicrodot58", "These kind of threats should result in the expulsion from the U.N.."], ["@peterdavidson3890", "THAT would be suicidal for Russia. For everyone Russia sends they get 20 in return"], ["@alexandremendes3186", "People in the comment section seem to really think that Russian Nuclear Weapons don't really work. What a dangerous world we live in. Also, it completely strengthens Putins argument that NATO is a treat to Russia."], ["@alvincealmendras7930", "Western are war mongering."], ["@DiegoLopez-mu3gt", "NATO need to realize that this is a war between Russia and NATO directly, and he won’t stop until he complete his goals. He wants to absorb Ukraine, and wants to connect Kaliningrad with Belarus and Russia."], ["@poli946", "Прислушайтесь к Путину, если вас мозг еще не до конца разложился от содомии и антидепрессантов."], ["@RobertPreeti", "The Western world's arrogance is the biggest threat to planet earth."], ["@eduuklee9453", "the west has a whole plan build on the bet about things russia wont do. but guess what, they will do everything."], ["@KaterinaBudyakova-hf7rk", "Mrs. Anya, unfortunately, doesn’t know that Vladimir Putin it’s not a matter of popularity, but of respect, he has the respect of the nation, and he works hard , he deeply knows needs of citizens and do his best so that the economy of his country would be pretty good. From Moscow with love ❤️"], ["@twincitybulldogclub", "Yea yea yea nobody cares about Putins lies"], ["@ManuelRodriguez-fy1hf", "NATO IS THREATENING RUSSIA BY EXPANDIN EAST AND YOU KNOW THIS... STOP ACTING LIKE YOU DON'T KNOW"], ["@alexandremendes3186", "How can Iran be a party to the conflict between Palestine(Hamas) and Israel but NATO isn't in regards to the Russo-Ukrainian war?"], ["@Hokuhikene", "He always resorts to blackmail. The West also has a nuclear mail system just saying ¯\\_(ツ)_/¯"], ["@ComlucDeluc", "Pootsler is paranoid."], ["@jeffreyokun2355", "When will the weak bureaucrats in the EU learn to read the Kremlin; Nuclear threats are an admission of weakness and fear, which means the EU should respond with MUCH more pressure!"], ["@Hokuhikene", "He always resorts to blackmail. The West also has a nuclear mail system just saying ¯\\_(ツ)_/¯"], ["@gaikhamgangmei7042", "Lol so call the western or European nations afraid of putin alone forming and alliance. And they are barking in YouTube comments 😂😂😂😂"], ["@ihrdforth3", "😂😂😂😂😂😂"], ["@jojolafrite90", "No one said no one would send troops. Just that we had to consider the possibility in the future. That media frenzy deforming what that poor Macron said is annoying."], ["@FrancisWaterworth-dv4hu", "Bla bla bla"], ["@flesz_", "President Putin for you journalist"], ["@ddmcpaisley6299", "WTG Biden, losing  what's left of your mind to call Putin an SOB and today he threatens the US with Nuclear War."], ["@ddmcpaisley6299", "WTG Biden, losing  what's left of your mind to call Putin an SOB and today he threatens the US with Nuclear War."], ["@colddarkness1798", "He is talking but never waling the talking"], ["@christiansock6309", "At least Macron finally understand that putin doesnt care about any kind of diplomacy,it is a russian way or war.."], ["@truthmatters8689", "NATO should intervene in a pleasant way, not supplying arms to boost war, olaf sholz said they dont want a war between russia and nato,  then start diplomatic talk not supplying arms . europe became a tool for the big english country outside europe,"], ["@Intentspunk19", "Yeah sure bud"], ["@dusancville", "\"Here is some of what Putin says...\"\nThat is it. Censorship with no end. One and a half minute of speech followed by analysis of half an hour.\nSo sad looking at the \"west\" for us that lived part of our life in communism. You guys might think you may cheat your public but to the people of Global South your media are laughable. Time of western democracy glory has long gone. You put yourselves under \"iron curtain\" this time."], ["@scotam02", "So Putin's play is to threaten nuclear war while stationing troops close to NATO allies.....I say we call his bluff and put an end to this!"], ["@KaosVerket", "All this bs is what paying taxes gives us 🎉🎉"], ["@jotaere100", "Bluf"], ["@charlievardar1330", "I thought the EU was still in peace talks with Russia! How on Earth nuclear threats are supposed to help that? If everyone has fumed out already could we talk it over? These are not talks between Israel and Hamas after all. The solution is there - could we talk it over, please. You know what you want, we know what you want; we know what we want, you know what we want. Where is the problem?\nCould we the least stop the crossfire - this is already absurd. It looks easy to me - just stop shooting!"], ["@saxologist1", "Germany, nothing more than toilet paper for the US."], ["@mrjsam-wp4465", "Only the West would expect that Putin will announce his plans to provide assistance 😂.. just to intercept/disrupt his plans😮, he is a genius, unlike the Nato leaders"], ["@anandsingh-hv7fm", "Dw, u too lie"], ["@liberty484", "Hey everyone. 😊 Remember the Trump Years?"], ["@N1611n", "Keep poking the bear and find out."], ["@electronicfarts5105", "Just another week and Russia threatening nuclear war."], ["@__3800", "You can run, but you cannot hide.\nIn Death We Trust."], ["@bps7209", "Stop pushing war over the Corrupt Government of Ukraine. We won’t let our children and grandchildren fight in a war in Ukraine. Test us, then try."], ["@anandsingh-hv7fm", "Putin is right...eu should know their limits..."], ["@yesterday1396", "Do it Putin I dare you."], ["@grrrbrrr9053", "Olaf Scholz mag ein guter Gymnasiallehrer sein, aber hier brauchen wir einen charismatischen Führer, nein nicht A.H., sondern jemanden mit zwei Eiern - zwei, drei nicht ausgeschlossen, hart, schwer und strahlend wie die Sonne, selbst wenn bei Nacht die Hose fällt."], ["@dirkdiggler5581", "Bro thinks he and his family would survive a nuclear war or why he constantly threats with it?"], ["@captainseadog7600", "he just gave a speech to Russian people how schools,hospitals  etc need  to be updated etc but he has been president for last 24 years in Russia ? What have you been doing Putin ? 😂😂😂see how he’s brainwashing Russian people"], ["@pointgreece4331", "A completely normal statement.  If someone helps a side with which Russia is at war, sends weapons to kill Russian soldiers, threatens to send its own army, then it is to be expected that Russia will respond with all available means.  If America attacked Mexico and Russia or China sent weapons to the Mexicans, would America see it as a threat or would it watch it calmly?"], ["@user-mc3lk3me2n", "I guess metro 2033 is gonna be real soon"], ["@alextraordinary5294", "Oh no! Anyways…"], ["@user-nx8ii4ef7f", "Quite right too! But we also think that they are already there!"], ["@russiasucks7170", "Putin is always on the offensive. He uses Russia nuclear arsenal and make threats. Yet NATO who is far stronger then Russia is so timid. Look , Putin is take advantage of NATO defence posture. Who says that there will be war if NATO acts tough? Not quite"], ["@armandomercado2248", "No surprise."], ["@rogerstephenroth8073", "Stop calling Putin a president! He is president in name only as he is dictator. Putin will go after anyone who opposes him so popularity polls in Russia are worth absolutely nothing as the real truth about how Russians feel about Putin is not really known except the Russians who are not in Russia now."], ["@ArashJan-jb5lt", "I'm definitely sure, the day will come all powerful countries will fall to zero and weak and helpless countries will raise up and just Russia will be leader of all, Don't worry no country would dare to send military to Ukraine and What Macron said was a joke and may be it takes 10 Yrs or more but finally it's Ukraine which will beg to Russia for stopping war!!!\nLong live Mr. President \"Putin\"!\nLong live great and strong nation of Russia!\nLong live hospitable people of Russia!\nSincerely, I'm from \"Panjsheer\" a northern province of Afghanistan which its respected leader was called\" Ahmad Shah Massoud\" a famous fighter of Afghanistan that was killed by two Journalists Which had hidden bombs in their Camera and during interviews they expluded it and finally killed our leader and it shouldn't be left that those journalists were   puppet of NATO and America and had sent to Afghanistan just for doing this missions!!! 😢"], ["@str8ballistik", "The only one that wants to destroy Russia is Putin."], ["@abm191", "Did he just asked for a preventative strike on himself?"], ["@Welgeldiguniekalias", "\"Putin is the only viable candidate\" lol you can say that again, all credible opposition candidates have contracted Sudden Death Syndrome. Such a coincidence!"], ["@SA-ks9vz", "Putin is such a whiner, and would never use nuclear weapons as his financiers would show him the window."], ["@captainseadog7600", "Dog just barks and don’t bite"], ["@tellitasitis", "Well said Putin. Telling it as it really is. Did The Ukraine/USA /EU really think Russia would let them set up NATO Ukraine on their doorstep ? Nukes will fly well before that happens. Did they think Russia would let the Pro Russian Ukraine areas be shelled ?  Did anyone think this through before the 2014 coup ?"], ["@saltA-saurus", "So what are we on now? Threat #20?"], ["@nachtensturn1634", "....I mean why can't we...he sent troops into a sovereign nation...as far as the nuke.. with how incompetent and corrupt their military is... Do the nukes even work? Lol chances are they will either backfire or misfire. That's probably why he's flexing so much because they're not ready for nuclear war."], ["@johnkijkt2713", "He is talking to a crowd of zombies. I do not feel very threatened by this display of idiocy."], ["@solojavaisland3148", "nato send troops in ukraine signaling ww3 ..or nuke exhchange,  \n\nnato reveal agressive behaviour against opponents get harsh reactions."], ["@peted7687", "Nobody wants Russia. Nobody!!!!"], ["@jaysartori9032", "We didn't threaten you with nuclear weapons Putin,  all France said was that he may deploil troops to Ukraine.  If you launch a nuclear weapon at us or any of NATO members then it will be the end of you!"], ["@John_II", "Well... nuclear deterrence is meant to stop full blown wars."], ["@davidkvocak1234", "DW please nobody cares u can report from russia 😁😊"], ["@workingtogether6633", "The human race has this insane ability to create madmen constantly and there's no shortage of them and no end in sight in creating them!"], ["@vitorrosa6260", "Well isnt he being attacked? \nDont attack Russia so that they dont have to defend themselves."], ["@richthomas9170", "Germany Unification was the beginning of all this B.S."], ["@12marcusboy", "lmao he's got nothing else to hold on to either way...."], ["@OresteUlise", "Long live His Excellency Mr. Putin! Honor to the brave Russian people, they saved us from Nazism in WW2, costing over 30 million lives, and are now fighting to rid Ukraine of the clutches of American tycoons! Let Ukraine belong to the Ukrainians and not to the Americans!   Biden and B. Jonson- UK – PM, NATO, UE  are true criminals!"], ["@spaget3919", "It should be: Putin threatens nuclear war 109th time"], ["@shakirnaseem472", "Russian Elections ❎\nPutin Self-selection ✅"], ["@Marc_Gagne", "Again with nuclear rhetoric.  putin's jokes are nauseating."], ["@dennisestradda9746", "And this is the exact reason why people join nato 😂"], ["@michaelsilva5264", "Putin does not just roar like west does. If putin warns, that means it is a real warning. No bluff"], ["@donbabilio8298", "West must be scared of the little madman as he may nuke his underwear"], ["@abrahamatar", "Too sad to see all the so called collective west leaders as a kindergarten kids. In fact, I see only adult in the room is Vladimir Puten and may God protect him and bless Russia!"], ["@lucschoesetters4307", "It is time that the West answers that for one nuje tgey will vet 5 back. End of threats...."], ["@lucianoarroyo8687", "Putin he’s Scare NATO🤦🏻‍♂️😂😂"], ["@Adnan-bc1vk", "HOW ABOUT IF THE WEST FORGET ABOUT KEEP CLOSSING TO THE RUSSIAN BORDER AND THEN RUSSIA WITHDROW FROM UKRAIN ? THE SOLUTION AS SIMPLE AS THAT BUT THE PROBLEM IS THE WEST BELIEVE THAT THEY CAN DO WHAT EVER THEY WANT AND OTHER SIDE HAS NOT THE RIGHT  TO REACT AND THAT IS THE ATITUDE OF THE AROGANTS"], ["@RolandasVegele-ri3fz", "Do you know that France suggested EU to send its troops to Ukraine but just today they disagreed to use confiscated russian money for rebuilding Ukraine. Shame on you france !!!"], ["@rogerstephenroth8073", "Putin should close his mouth, he is talking World War 3 then. If he makes good on his threat Russia will be destroyed, and NATO and the USA will fight with their full military might. I highly doubt he wants to expand the war beyond Ukraine if he knows what it is good for him to close his mouth and stay in his place. I think Putin talks a big game but he does not want WWIII because Russia will be blown out of the water in the process. Everyone is going to gang up on him."], ["@jackconnolly772", "Absolute bull, more threats, more lies. Russia will get swiped aside by the west and he knows it. Ukraine have showed the world what a poor excuse of a military Russia has. They have nothing but threats in their locker."], ["@spootnik00", "Lil man complex"], ["@DerDoMeN", "Putka should send warnings more towards China... They are quite certainly smelling the smell of a corpse ripe for picking far more than the EU."], ["@AzrenKaleBolles-Pohja", "NO ONE CARES! Putin has been waving the Dildo for years, and people who claim that he would use them if Western Soldiers stepped foot on the Annexed Territories because the \"Russian Government/Constitution\" views them as Russian Land, He won't because No one Not even China Recognizes them as such. Putin wants to make Russia \"Great Again\" not kill it and turn it into a Nuclear Wasteland."], ["@jasonalmendra3823", "Putin is starting to sound like Kim Jung Un."], ["@forfairfair472", "ALMOST 50 COUNTRIES THREAT RUSSIA AND RUSSIA HAS THE RIGHT TO THREAT THEM BACK  SO IS FAIR FAIR"], ["@carlosbilro8400", "Stop buying from China!"], ["@deslow7411", "Putin threatens nuclear war if the West  intervenes.\n*nothing*\nPutin threatens nuclear war if the West supplies Ukraine.\n*nothing*\nPutin threatens nuclear war if the West supplies MIG-29\n*nothing*\nPutin threatens nuclear war if the West supplies old soviet tanks\n*nothing*\nPutin threatens nuclear war if Germany supploies lethal weapons to Ukraine\n*nothing*\nPutin threatens nuclear war if the West supplies Ukraine with Himars\n*nothing*\nPutin threatens nuclear war if the West supplies Ukraine with Patriot\n*nothing*\nPutin threatens nuclear war if the West supplies Ukraine with modern battle tanks\n*nothing*\nPutin threatens nuclear war if the West supplies Ukraine with F-16s\n*nothing*"], ["@safaulalam2352", "Boss putin.glory to Russia.biden will piss off after seeing this"], ["@troymercado4240", "Russia always saying nuclear weapons,N word is a sign of weakness."], ["@maaguilar", "The bully is doing his bully thing… The question is: Are the Russian military willing to destroy the world by following the orders of this corrupt, crazy dictator?"], ["@lkhxlt7689", "Russia should thanks micron of France for revealing the no balls of NATO for the sending of troops into Ukraine 😊😊😊"], ["@iscariotproject", "i mean we are slowly going towards ww3 anyway...maybe just get it over with"], ["@carlosbilro8400", "Of course, in Europe and the United States, everything is asleep waiting for Russia to send its nuclear weapons, which only they have, what a clown!"], ["@drinkcoffee23", "Uraaa"], ["@mercyvelasquez9162", "Oh what happen to Ukraine is Winning..and Russia was decimated"], ["@AdamAdam-kh5wf", "Putin has been threatening Europe to use nuclear weapons against them even before the war in Ukraine, so there's nothing new about his new threat."], ["@3nL1ght3n", "⚪🌀🩸"], ["@PS_Tube", "Headlines: Small member menopausal man who invades a weak neighbour threatens the world powers with nuke."], ["@rvanden4740", "It was good that Macron said what he said.  It can give Putin some talking points.  My vote is for no troops to be sent, not even one.  Instead, and much more importantly, France and the rest of the democratic, internationally law-abiding countries should send massive amounts of military equipment and ammunition over many years.  They need to wind up their military-industrial complexes to crank all that stuff out, lift restrictions on long range fires, and have a 30 year plan to build up the Ukrainian military into a force that dwarfs Russia's military.  And there needs to be less talk and more action on this going forward."], ["@jeffersongeorge2227", "He said German was not going to send offensive weapons to Ukraine until his master in Washington commanded him to send, including tanks. Schultz should sit and wait for instructions instead of talking out of turn."], ["@konstantinospapadopoulos4643", "Fair game"], ["@Mxyz1234", "Putin has nothing to speak for aside from war and nuclear threats. Totally useless leader."], ["@ceciliajovinia6255", "This western n nato are nothing but trouble maker..russian are very patient"], ["@comicomment", "Pics or it didn't happen."], ["@juhajuntunen7866", "What if NATO send 2 million bottle of vodka to frontline ruzzian side (per month if needed)?"], ["@Vijaykumar-sd9ol", "Putin ni tera 5911 varga klla hi Europe nu khichi firda"], ["@fransainsbury", "Bully Boy Putin at it again!"], ["@couldntfindafreename", "The news media should not give space for putler. His deterrance is effective only because the media gives him a voice. Just stop reporting what he says and he will be toothless."], ["@rogerduguay3435", "Putin must be blind if ge can't see the harm he is doing to Russia. He needs to stop feeding the Russian population his lunacy. Get with the program Putin we are not gladiators anymore."], ["@jacquelineyousif4335", "OH MY LORD JESUS CHRIST HAVE MERCY ON US AND THE WHOLE WORLD"], ["@nathanlillie5262", "Putin threatens nuclear war every time he feels like he didn't get enough chocolate sprinkles on his ice cream."], ["@charlieangkor8649", "Youtube censored my comment."], ["@atisalvaro", "We got used to his bluffs, but have not learnt from them. Anyone starting a nuclear war is a gambler. It is easy to start it, but hard to win it"], ["@yaroslavbozhdynsky", "Appeasement towards a fascist aggressor was not a good idea 80 years ago and is still a mistake."], ["@mattgraves", "NATO should have been ready for his statement and immediately sent troops to Ukraine so that someone would have to interrupt this address while he was making it"], ["@emk88", "Boring comments today are you guys smoking something 😂"], ["@mwilson7842", "Goodbye Moscow, Putinska."], ["@quecksilber457", "The monthly nuke threat. Boring."], ["@LovelyPuffin-fo5te", "Republicans in the house do your job send the aid to Ukraine and vote blue"], ["@karolpalion2883", "Perhaps the West should threaten Russia to use nukes, if Russia send troops to Ukraine."], ["@ish4578", "Чем нести ерунду в комментах,могли бы понять уже что час X все ближе и ближе"], ["@josephshields2922", "Another click bait lying headline. Putin did not \"Threaten Nuclear War\". He simply pointed out that sending NATO troops increase the risk of nuclear escalation."], ["@psychedsage4990", "Why is Putin being so insecure? He has half of ukraine and still uses the N word for even the smallest of things. West already has been sending troops unofficially and Russian army is managing it well. Does the word has anything to do with Russian 2024 election i wonder? Putin not starting to make sense right now."], ["@ponypong261", "Putin is such a small damp cat, always lying about anything. What surprises me is that he still can't find a suit that fits him."], ["@russchamberlain8755", "Putin is not in control."], ["@BlackRiverGold", "What would the world be like if Ukraine already had nuclear weapons? Most likely it would have already destroyed Moscow because the people of Ukraine hate the Russians and it is not because of the current war."], ["@foilhat1138", "Another day another idle nuclear threat."], ["@fazfinisher5598", "Stationing more soldiers, another mass exodus of young men scrambling to get to the border."], ["@rogerbartlet5720", "Next step is Russia ditching nuclear test ban treaty and performing an air-burst test in sight of NATO. A 10 megaton bomb explosion puts on quite a show. The EU will quickly ditch Zelenskyy and Ukraine will belong to Russia. This will be the biggest foreign policy failure for the Biden administration, turning the clock back 60 years."], ["@michaelotieno6524", "Did Putin really threaten nuclear war or did he state that there is a risk of nuclear war if NATO deploys ground troops to Ukraine."], ["@WiseMan22", "The only way Putin and the oligarhs can keep their money is if Russia stays corrupt.  The minute this changes,  they all will be imprisoned, and their stolen money taken away.  They know it, and will fight to the end to not let it happen. This war is not for the future of Russia, or their people, it's for their own personal survival.  Remember when they were making plans to escape to Argentina if things went south?   Again,  this war is to keep Russia not great, but to keep it corrupt so they can do business as usual."], ["@graemes52", "Ukraine needs $3 bln in financial aid per month to survive, NOT including Arms and military aid, just to pay pensions, wages, food, and living costs. Ukraine is a  TOTAL failed state being supported by the crumbling dwindling USA /EU."], ["@rado_grami", "It's when he says he won't use nuclear weapons, that we should worry"], ["@mselvarajraju1040", "Joker with Nukes"], ["@jamesparker1071", "Meanwhile, thanks to JoBama, our US borders are undefended as he bankrupts America \"defending\" countries who hate US. And, again thanks to JoBama, enemies are flooding across to destroy America from within."], ["@Icenflamesrush", "If this isn’t a reason for the Russian people to rise up and remove their “leader”, then I don’t know what is.\nHonestly, at some point you can’t just sit idly by while your president is seeking to destroy the world for his own twisted fantasies."], ["@tudvalstone", "It's a bit more nuanced, Medvedev clearly stated that it would happen only if they attack Russian territory with the aim of pushing them out of the territories they annexed. And it makes sense, because NATO getting directly involved in that endeavor, would pose a big threat to the whole of Russia, so what they say is they would use all the means they have available."], ["@andrewdavis6428", "Nato has ice cream😂"], ["@toddgraham8653", "It’s to believe the bluff or perceive the threat . It’s up to you to determine the difference between hot and cold. \nRegardless the outcome, of your thought, the questions are what to do?\nWho is right or wrong. \nRussia invaded the land they believed was theirs historically. \nNATO protected a non nato country. \nFor myself to believe Russia has enough energy to go much further than they are , is a tad far fetched. \nObviously Ukraine should have made some deals. Land agreements, and assurances with new borders. \nThis never happened. The nato should have realized, there are more Russian citizens that Ukraine has. And if I was to believe Ukraine was going to push the Russian back to their borders, prewar , I wouldn’t bet on that in any sense. \nThere is no counter offensive that has weapons, or vehicles to push that line back . \nMy assumption is this needs to end quick. Agreements on land, and end fighting. I do not believe Russia wants to continue deeper, and deeper. \nUkraine is on the verge of being a landlocked rump , and if they want to continue fighting, they will suffer the possibility of loosing Odessa, and creating a real mess. \nSo it’s best to make a deal now before nato makes more of a mess supporting a non nato country"], ["@BadgerBreath-rz1np", "Putin...\" where's my chin?\""], ["@pauljcross2289", "Trump's boss"], ["@ProfessorJayTee", "Russia threatening nuclear war... Again? Dumb guy has no new ideas."], ["@up2u7", "Russia also pays soldiers from other countries..lol🤣🤣🤭"], ["@johnniep405", "as if the germans were going to do anything anyway.  cowards."], ["@gilbertobanaga9874", "Cowards will lost in this war if they've no robust & genius plan to face big challenges. That's your greate mstake if big Alliance r afraid to face 1 countr. Useless strength 😁😄😅🤣🤑"], ["@leifharmsen", "Russia sent troops to Ukraine, so what's with the double standard?"], ["@ht8602", "Putin crying nukes again, it was nukes if west even got involved at the start, and then it was nukes if west sent missiles, and then it was nukes if west sent tanks, i guess that means we should should send troops !"], ["@RdamplificationUk1", "If Russia takes on NATO it would be fooked in short order."], ["@danw506", "Putins got nukes?! I had no idea 😂😂😂"], ["@laniciakonelio-hd5lb", "We all have nuclear weapons"], ["@laniciakonelio-hd5lb", "We all have nuclear weapons"], ["@chrissangany8106", "I feel like Europeans are tired of living in a peaceful continent. What is so difficult about talking and finding common grounds. Remember Russia is no Iraq nor Libya …"], ["@marijanpastorljubicic9315", "Russia 💪💪💪💪"], ["@wuhanvirus7036", "Putin knows very well that Russian troops won't be able to stand a chance against the US & French army (not other western countries). Only nuclear weapons are the equaliser ATM."], ["@yves3560", "If   \"Russia invaded Ukraine\" are the only three words your brain can handle, so be it.   This war started in 2008,  rest assured.   Learn, read, make conclusions."], ["@ThomasHalways", "We also have weapons which can target Russia's territory, but our politicians (mostly) maintain decorum and never threaten anyone with their use.  Of course we should have never ruled out sending NATO troops to Ukraine. Keep uncertainty, a basic principle of politics with a hostile power. I am very tankful for E. Macron for have finally said this. I am ashamed of Scholz. Our message must be: Russian will never be allowed to steal land from Ukraine. They will never be anything but a pariah nation, a 1% global GPD creator."], ["@Thebeardedcanucks", "The USA always loves to poke he bear"], ["@RobRoyBoaz", "Love the footage of the brainwashed bubbleheads being addressed by Putin."], ["@galaxi_01", "putin afraid of nato ok sure"], ["@mr.replay5218", "wew unless his general agree.."], ["@stefyganda9798", "Every day russian propagandists are making nuclear threats😂"], ["@Chuckt961", "Putin is willing to risk Russian nuclear destruction over a country , he says, doesn't exist."], ["@vt6014", "Now the west back down agian lol. Seriously we have nuke too. He knows the west is weak that's why keeps threatening lol"], ["@user-rt1dh4dx6d", "Putin the murderer...killed Navalany..."], ["@adrianosverko6601", "Puppets of power. Not even a German channel, anymore."], ["@bradleyheights5905", "When is Putin not threatening nuclear war?"], ["@jamesonpace726", "Hi, my name is Vlad & I suck...."], ["@naveenverma1334", "We call ourselves human being😢."], ["@TheAlchemistZero1", "What a mummer's farce!! \n\nWe literally watched his attempted 3-day ransack of Ukraine (with a 2000 mile long convoy) fail spectacularly. Over and over, their best tech has been vaporized by mid-tier weapons from around the world. Outside of unbridled brutality, he's only got BS."], ["@stevemartinez4007", "Mr Rescheto , he warned the West..which is defensive,.he didn’t threaten the West..which is offensive…really like your work but the words affect the context and could be confused"], ["@douglasdeltondo7852", "No “democratic election” …can you prove that? Why does Putin need election rhetoric if there is no democratic election?"], ["@TheViva890", "Putin simply said west mind your own business..🙂"], ["@ryanv8245", "Nuclear “threat” number 27 in the last two years…. Yawn 🥱"], ["@rajveerkanojiya2985", "Putin will end the world"], ["@desgoulding7154", "Put is to dangerous can’t be trusted. France 🇫🇷 has a good idea. Putin has gone to far. Very informative video with factual reporting"], ["@OllieX123", "I can see the future headlines now if we don’t send troops:\n\n“Putin threatens nuclear war if EU don’t let him invade and annex their member states”"], ["@pededautclaude8178", "FLFCGACT 😂"], ["@douglasdeltondo7852", "“Allegedly want to destroy” — you are a serious news outlet and have any doubt causing a drain on Russia does not want Russia to fail? That sanctions had aim to collapse Russia?"], ["@sophieturner2676", "NATO needs to stop fooling around, NATO needs to take accountability for intensifying this regional conflict , NATO needs to put PEACE talks on the table and ASAP"], ["@stuart3383", "Not again happy New year Putin"], ["@ruibebiano9015", "Estou para ver quando as ameixas começarem a cair, quem tiver cheiro a caril, está phudides."], ["@groovy611", "HE IS BLUFFING"], ["@Anton-ji4td", "The audience looks completely lost and bewildered.  They are thinking he has gone mad."], ["@AvanguardInvinsible3740", "Putin is afraid of NATO forces in the battle field😂😂😂😂\n\nHe know Russian forces can't win in conventional war againts the west specially US, that's why he warn Nuclear war in that way no one will win😂\n\nPutin is afraid😂😂😂😂"], ["@RussianPies", "Take a look with an auto-translator and you will find where they lie to you"], ["@wokeaf1337", "I dont fear nuclear weapons, I fear surviving it."], ["@sunnyboy4553", "I don't understand why Germany is such a little poodle dog to it's master the USA???  My country blew up your pipeline. Much earlier Biden threatened to do it in a speech as your little poodle Scholz stood by his side and smiled. Now your economy is in ruins and you are forced to buy more expensive liquid gas from the one who controls you and attacked you. Yet not a word about this in Germany. Can someone please explain this to me??? It makes no sense."], ["@user-tp9en5cx3h", "When to stop calling \"the wolf\" \"the wolf\". He must soon make good on his nuclear threat, otherwise no one will believe it. But he is probably too cowardly, he fears that it will backfire"], ["@neodharma", "According to the more sophisticated and deep study conducted in the end of last year by The Anti Corruption Foundation, founded by Alexey Navalny, only 42% actually support Putin. There is significant disturbance in the studies due to the fear factor."], ["@robotx-xq4vn", "war can quickly escalate to nuclear war. there is no way russian can be fighing 30 plus countries  connvetionlly.. it doesnt make sense. they are already at war with nato forces abet small contigent forces not less than 50k are in ukraine. but a full deployment is just an escalation an invitation to full blown nuclear war."], ["@frinkleboop9963", "Oh he’s threatening it again? Yawn"], ["@Anton-ji4td", "He is totally mental.   He completely messed up with his 3 day SMO.  He is nuts."], ["@johnchiu7581", "If NATO troops enter the war, Chinese troops should enter on the side of Russia, since NATO is also making trouble in Asia now."], ["@susanneschroder8409", "Mafia puttin craze  sob"], ["@raphaellavictoria01", "I never believed that Putin could use nuclear weapons, nor that anyone ever could. Now I believe it is actually possible. Putin's psychopathic ego has reached out of control, truly insane proportions. I believe he could do it."], ["@davidkendall1614", "So, if we had said “West threatens Russia with nuclear weapons if Russia sends troops into Ukraine”, how would Putin have responded? Feels different when it is turned around, doesn’t it Vladdy? Fool. Mutual deterrence unless you are suicidal."], ["@barondodzi", "Why is he talking Abt nuclear war as if RUSSIANS are invincible hahaha😂😂😂,, Get out from ur world war 11 mentality,,,"], ["@user-nu4uh5fx3z", "“Now, I am become Death, the destroyer of worlds.” \n― J. Robert Oppenheimer"], ["@paulmarren7970", "a clear threat he says???\nnot a threat he was giving an analysis of what COULD be the outcome for CIVILIZATION\nshould certain actions that are being pursued against Russia continue.\nthis is the problem with the words used by media, misleading people and making enemies\nwhere they should be using their influence to disolve the fears of fellow humans that have been fostered by the old guard.\nfor the gain of the greedy and the evil. WAKE UP PEOPLE THINK FOR YOURSELVES.."], ["@GabySolantolo-iz6jc", "So much mocking of russian threats what of it happen and that cant be ruled out also ...\n\nI think macron will think twice such a shame of all the arts will burn"], ["@flash802", "We have nukes too, little bully boy"], ["@sunrise1975italia", "Germans are either afraid or quietly support Russia, like during WW2"], ["@dorsetguerrillagrower", "😂😂😂 they already in Ukraine 🤣🤣🤣"], ["@foxhunterdival5428", "how many times putin warning?????"], ["@MinisterioElReyQueViene", "Putin is afraid of NATO"], ["@user-sv2pt5nc6m", "Russia is already a pareiah!,,"], ["@JesusChristF0rever", "Hello people, you do realize they translate Putin words without knowing Russian right? He said war with europe is a bs. Please people learn how use your gut and your brain, don't let those rich companies think for you"], ["@speakup18", "NATO give  it try big strong boy's 😅😅"], ["@You-in6lm", "We all no someone from Russia will take him out"], ["@havik7954", "These comments are mind blowing. We shouldn't even have got to this point, of throwing threats left and right like it's nothing. This title is so misleading... I mean, if an all out war breaks out between NATO and Russia, the use of nuclear weapons is very possible. Now it's just a game of who bluffs better and is willing to take it to the next level, until the next stage is loss of billions of lives."], ["@totalfootballcast4100", "USA and the so called west choose their battles , only battles they know they have an advantage. Even a small country like North Korea no USA can fly through or even try to throw Christmas crackers . We think America is great because they use all their might on small countries. Even those small countries they get lots of casualties"], ["@syedahmed5539", "Makron has gone totally mad.  One would, perhaps not be wrong to think that he needs either help from a psycho-analyst to stabilise his mental status or maybe he got bleeding piles or an enlarged prostate(conditions, quite possible to develop at his age with difficulty in passing urine, making him restless and errate, and perhaps could benefit from surgical intervention."], ["@masonhancock5350", "Russian Ayatollah"], ["@thembastoep733", "Well to be honest Putin doesn't need to threaten nuclear war, even just ICBM's are enough to show that any western boots will bring war to their shores as well hence most people don't want to send any, as for Macron obviously he wants to act as a strong man to feed hope into those Europeans who really want Ukraine to win but is not looking that good so far, he should be careful though western troops=WW3, We are full of strong men in Africa look at what that always brings us and we don't have Europes technological sophistacation in military tech, in fact if Europe unilaterally does we don't know what Washington would do, Lastly more than anything countries those next to Russia's border like Estonia should be the last to advocate for this no matter how empowered they feel because they are part of Nato, in reality a Russia vs Nato war would be worse for them than Any other country because if the frontlines are not going to be there the nukes will start there. Cooler heads must prevail, supply Keiv well and it will at least hold its own long enough for the Russian population to rebel and end the war and China will keep Russia at check regarding the nuclear threat."], ["@bankrollwels", "Words from a coward... he knows that he can't beat NATO any other way, so I'll destroy the world like a kid throwing a temper tantrum...."], ["@rogermullan6736", "Putin forgets the West have Nukes too."], ["@tuff-knorf4561", "Since he always lies, lets go ahead"], ["@NoicyX", "'Everyone gangsta until pootin launched the nukes\"__ wise man."], ["@shadowcivilian9942", "So basically what he said was \"Step the  fugg back NATO\". Clearly nobody has provoked this guy!.. Umm 🤔🇺🇸🕵️🇷🇺"], ["@pergi-pancing", "Putin is probably going to die, knowing the way things are dealt with in the Russia he has created."], ["@johnfinbarr1160", "Has Vlad check if his nukes are still working. Not that long ago when a few hundred boys with drone toy bombs stopped the great Russian army invading in from the North of Ukraine. 😂😂😂😂😂Game over for you defo Bad Vlad if you even dare to start that game."], ["@019208237", "More BS threats due to fear. You look weak Mr Putin😂"], ["@coreylegend4248", "He scared."], ["@S.E.O.S", "America can't find oil in Russia 😂"], ["@imantserdmans3169", "aha..."], ["@monikabotkova4382", "Watch the interview Putin versus Clarkson to understand what is going on."], ["@jeffmacarthur9722", "Putin loves his lavish lifestyle and creature comforts too much to risk Russia getting sent to the Stone Age by the West..."], ["@zeitgeist5134", "But what if people have stolen the copper wiring in all of Russia's nuke silos?"], ["@paololuckyluke2854", "Putin lining up troops on the borders of NATO countries is certainly with a view sometime in the future to take over the Baltic states."], ["@cYYAN88", "Narrator: He wont. He is playing the west like a fiddle. We are too afraid and rational for our own good and it will hurt us in the end. Putin feels fear and presses even harder. Scholz is crumbling like a cheap pie and is super afraid and paranoid. Germany can not lead Europe when they are afraid everything."], ["@SlantEyedJoe75", "Meanwhile Zelenskyy: “Send me all the troops”"], ["@chronesrt2925", "well i guess its going to get a lil warmer on this planet."], ["@fanakimii6842", "The difference is, you can't risk getting nuked by jumping into war caused by Zelensky."], ["@burhansaid8730", "I'm afraid of my Brother whose in spain Ya Allah make him safe for these conflicts between Westerns and Russia"], ["@andyrusso6599", "Don't mess with Rusia."], ["@petra1201", "Get rid of him already."], ["@sackykamati7071", "Curiosity killed the cat folks. Some still ridicule Mr. Putin although he just emptied their military storage and banks in Ukraine.😃😃😃"], ["@juvenaldasilva413", "Weak russian leadership, is everthing that west wanted from Russia, in that way they can easily destabilise the Russian federation."], ["@sherifbatawy", "This is the only language the west understands ☢️ 💥"], ["@paololuckyluke2854", "German GDP = $4.2 trillion, Russian GDP = $1.8 trillion yet Germany is afraid of Russia, while Russia isn’t afraid of anybody.   Not just Germany.   The same goes for other Western countries."], ["@arthurdanahar1690", "NATO hasn’t touch u yet ,your all mouth"], ["@user-su1bn2ku1v", "I thought was an action not a war. Didn’t he imprison his po-ulation for having said this Ukraine thing is a war"], ["@alive4627", "FU"], ["@stormtrooper2170", "Putin is always threaten NATO n USA with nuclear war. Putin like to BS with nuke every time US n NATO send weapons n rockets to help ukraine.👈😁😁\nEveryone knew it will never happen..cos putin always play this game..👈🤣🤣🤣"], ["@Greenmarty", "Let me get this straight, Russian president threatens to end civilization for the reason of being prevented to occupy free nation.  How can Russians still keep following this guy who leads them to their own deaths and takes a future from those few of their kids who might survive?\n \nAnd who will clean up this mess afterwards ?  \n- Russians will just go starving while radio-poisoned due to lack of any care from their gov as in any conflict they took part in the past, while west will stick closer to each other use their economic integration and green deal to recover ASAP just as they did in the past.  \nLike what else do those  folks in the east expect ?"], ["@GlobalPenguin2012", "Nuclear weapons? The west has lots of them too…… Putin’s KGB threats sounds so hollow and empty"], ["@Potus1789-chanel", "Mr. Putin has sunk low. He has been threatening for two years, but no one is afraid of Russia anymore. Two years ago in a conference with Macron at his side he admitted that NATO is clearly superior to Russia, but only the United States would be enough, the other NATO members could stand by and watch, even the elderly Biden allows himself to insult Putin."], ["@croutardsparrow", "Good afternoon! Thank you sincerely for the video! I hope to see new videos coming out soon :)"], ["@nozhki-busha", "So bored of hearing about Russia and its pathetic empty nuclear threats. Get Ukraine what it needs to defeat Russia and ignore this nuclear nonsense."], ["@MARK6297", "😂😂😂 we not worried about Russia. They been struggling with a Ukrainians for 2 years"], ["@shanelanier8740", "Hey Putin...Nato has nukes too...Unlike Russia, they arent afraid to use them...I dont think Putin wants Moscow to turn into another Hiroshima..."], ["@shadabqureshi6283", "And he is not bluffing.."], ["@britishairacademy8475", "Thanks for such a warning and India is a friend will keep buy the Russian Petrol\n3:43"], ["@xSTRUggLE", "Putin having no idea 🤣"], ["@user-ul6li3cs9n", "I guess France is not afraid of Putin"], ["@evolvedtv6668", "threatens to Use Nukes is just like you showing your self as desperate and scared🤣 and Putin think the west has no nukes? you just give Risk to your people."], ["@bruceedwards8003", "Hmmm, he is getting desperate and this makes him even more dangerous, so very sad, his parents should have told him to behave and play nicely when he was a child."], ["@picadosinferno", "Just remember that putin said he wouldn't invade Ukraine, he's clearly bullshitting"], ["@GUNRIR", "i thought he would only do that if \"Russia\" got attacked lol what a child xD"], ["@user-we9ub3dh6z", "conclusion: puting shitted his pants and the West should start preparations of the boots on the ground"], ["@MMakai3", "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣"], ["@vinm300", "Chronology \r\n21 Sep 2022 Putin \"This time I'm not bluffing\"\r\n13 Oct NATO defence summit Brussels\r\n13 Oct evening Macron on TV : \"Nuclear neutrality\" if Russia uses nukes in the region\r\n19 Oct Ben Wallace Washington : US + UK nuclear response to Russia\r\n21 - 24 Oct Gerasimov & Shoigu call the West 4 times in 4 days\r\nRussia capitulated\r\nI'm amazed nobody else knows this"], ["@80-80.", "Every time Putin is trending with nukes, he hates what is about to happen. Crystal clear communication."], ["@h2centsfunnysideoflife", "This war could have ended.  Putin needs to exit Ukraine. Is that simple.  No body was trying to invade Russia. Is Putin who is moving west because he is afraid of losing power. He doesn't want to lose power, the people in Russia in power don't want to lose power and millions they use for themselves rather than improving the lifes of all Russians.  \nPutin doesn't want Western Democratic mentality in Russia because it will be the end of his Totalitarian Dictatorship. \n\nRussians are forced to vote for him\n\nThis is what Trump is trying to accomplish in America\nDestroy our Free Nation and turned into a totalitarian form of government where only those loyal to him will get jobs benefits and freedom"], ["@mac_pls", "yes, because attacking a nuclear power results in retaliation. Stop war mongering, nobody wants to fight and die for the western elite."], ["@cosmicpsyops4529", "The world has little patience for tolerating whimsical dictatorial fantasies. The magnitude of failure and evolutionary regression Putin represents cannot be understated."], ["@albertopimentel5866", "Pura bomba china.. no sirven no truenan .. los cazas invensibles están cayendo como peras 😂😂😂"], ["@lesthompson5907", "Putin is panting that gritty old wall.  in a prelude to getting re elected  In an atempt to Make all feel better. but what he thinks as retreat  is often a trap & a prelude to defeat for Russia"], ["@vipecrx", "Olaf ribbentrop sounds about right."], ["@starlight161964", "napolion / failed \nh*tler        /failed\nnato..       /fails \nwhy no reporter dare to say that russia did be the first in berlin?\nwhen finally get the truth get told?\nwe didnt fight to russia in ww2 . we did be on the same side.\nnow they find it wierd that russia respond, when nato take al surrounding country's as members.(what they promissed NOT  to do.)\nhow much worth is the word from liars who keep lying.\nthis war is NOT what putin wants, but what other chooses did/do he have?\nif this turns ww3  a lot people have to look in the mirror, who is wrong, en who is right."], ["@Ashchinn", "Russia has the right to defend itself"], ["@costabandale7507", "Russian doesn't care about your Isolation in Entire Europe. Your under Russia sanctions banned numerous numerous Collective West politicians  for lives can't enter Russia. Russia blesses the country in Europe and Asia  with resources and so on. The collective west helped with these thousands of sanctions against the great people of Russia.  Over ten of thousands of the EU and US are facing an economic meltdown along with huge inflation."], ["@KlodianHysi", "To all germans here that want boots on the ground ! Go fight for ukraine . What are you doing here ?"], ["@mrmelmba", "Ukraine had a president that acting in good faith and in the best interests of the nation set it on a course of solid growth and stability.\r\n\r\nHe was too businesslike. They wanted someone _entertaining_ and sent him packing, voting for a _comedian_ who promptly manoeuvred to deplete the nation off its citizens so that he might turn this land into a colony.²\r\n\r\nNo one is laughing.\r\n\r\n\r\n\r\n²     Ukraine: Land of milk and honey. _The plenty of game and fish, the innumerable bee-hives, deposited in the hollows of old trees and in the cavities of rocks, and forming even in that rude age a valuable branch of commerce, the size of the cattle, the temperature of the air, the aptness of the soil for every species of grain, and the luxuriancy of the vegetation..._ (A.D. 244 during the reign of Emperor Philip)."], ["@marclohnhardt6420", "Thread with nukes eh? This is now..41241 time? 634532 time? I stoped counting after it was nothing more then another phrase"], ["@albertopimentel5866", "Yo no sé qué esperan que los manden pero ya.."], ["@irvin701", "What response were you expecting from Putin, honestly? Sending NATO troops to Ukraine actually risks nuclear war, so how is he wrong for pointing out the obvious?\nY’all are unbelievable."], ["@xSTRUggLE", "CW was also capable to have hits in enemy territory! Hdd er is reloading this or will he do a special edition of it?"], ["@chance360", "Send the troops call his bluff. Russia is notorious for lies. Constant Saber rattling but never any follow through."], ["@mariuszbryja7395", "Putin is a clown 🤡"], ["@stonewalljoey5137", ">‘We entered an agreement with Ukraine. Ukraine honored their part of the agreement - we need to honor ours. Rise America! Stand tall! Fulfill our obligation! Show our allies and our adversaries that we are dependable, we are reliable, and we keep our word!"], ["@kasperchristiansen1119", "We have no moral right to allow ourselves to be deterred by this fascist state. We have nukes too and they will not fail. \n\nIf we had not let ourselves be deterred and bribed by Putin - there would be no war in Ukraine. \n\nThe nuke threat is a sign of weakness and a genuine fear of the western military - and for good reason. \n\nThe Ukrainians are holding on with antique weapons, limited supply of ammunition, a relative small army, no navy and no air force. \n\nPutin knows that it’s game over for him if the West adds a real navy, a modern Air Force and a modern army to the battlefield.\n\nWe have no interest in conquering Russia and Russia has no interest in committing suicide over Ukraine - Putin in particularly does not seem suicidal when sitting meters away from whoever he meets with. \n\nNothing should be off the table nor NATO troops in Ukraine. \n\nWhatever battle will take place it will be without nukes."], ["@chrisbronson5341", "Nobody really has to live\nAny longer than he will ."], ["@stonewalljoey5137", ">‘As a proud U.S. citizen I am one of the 74% of United States citizens who support Ukraine and urge congress to provide the aid necessary to help Ukraine defend themselves against an aggressive Russian attempt to destabilize Europe and dissolve NATO. We know that this war is about Democracy, individual rights and freedom."], ["@stoneageprogrammer432", "YouTube is fascist."], ["@Magneticvortex-kk4gb", "The destruction of civilisation is already happening with Putin in charge of Russia. Let's be nihilists, an arm for an arm, an eye for an eye. Russia will lose an all out nuke war too, don't know why he's trying to talk about nukes everytime someone takes a step to block his military expansion."], ["@NiftyGusko-Nice", "The West is playing with fire. Everyone knows when you play with fire you get burnt 🚀🔥🤔"], ["@vipecrx", "Oh look, he found his knife and is rattling it around again. 😂"], ["@macdacsky2701", "I’m\nnot sure why Macron is allowed to talk for all the west countries  👀🖐🏻… !!!\n I strongly disagree with idea of  sending any of NATO troops to Ukraine …   which would mean if they do WW3  ☠️☠️☠️"], ["@Kienetic", "NATO also have nukes so…."], ["@fodediallo4867", "Sending troops is the solution against this expansion."], ["@francheskalong9728", "He does do everything to protect his nation and its borders. Win win for the Russian nation."], ["@homegymhulk7256", "Like the first 200 times they threatened to nuke everyone?"], ["@lesthompson5907", "he knows if NATO send trups then he as lost  the war."], ["@JoeyBlogs007", "A madman and his weapons.  Not a good combination."], ["@wycliffew.woduor1748", "Are there decomcratic electins in USA of late? I hear computers are able to vote and even count the votes."], ["@moali8434", "Glad that Europe the so called paradise will be glass"], ["@PavolFilek", "Why this WEST propagnda again. You lost war., Bye."], ["@allines6470", "Nato is terrorist and aggressor.  \nNato is killer of thousands of peaceful people in Jugoslavia and elsewhere."], ["@khurshidahmadshiekh6761", "Excellent news report and analysis"], ["@americiumamericium4442", "Chiwawa countries like france germany uk can just bark 😅😅😅😅"], ["@Redisia", "He has been threatening nuclear war on everything.... i am sure when he gets out of bed he delcareds nuclear war with his toilet if it does not flush properly... its his go to line"], ["@loseta1234", "Knowing how western media works, chances are they are deliberately leaving part of his speech and presenting the statements out of context to create panic."], ["@timbloemenbuurt6581", "Putin will receive some nukes in return if he thinks he can get away with that. The usual  threats from the Kremlin sound like a broken record."], ["@stonewalljoey5137", ">‘We entered an agreement with Ukraine. Ukraine honored their part of the agreement - we need to honor ours. Rise America! Stand tall! Fulfill our obligation! Show our allies and our adversaries that we are dependable, we are reliable, and we keep our word!"], ["@pari-gm8lt", "❤"], ["@BePatient888", "Dumb move on the parts of French leader Macron and Russian dictator Putin."], ["@stonewalljoey5137", ">‘As a proud U.S. citizen I am one of the 74% of United States citizens who support Ukraine and urge congress to provide the aid necessary to help Ukraine defend themselves against an aggressive Russian attempt to destabilize Europe and dissolve NATO. We know that this war is about Democracy, individual rights and freedom."], ["@jonr6680", "Like the kid who's been caught red handed spraying the school bus.\n\n Incapable of speaking without lying, living in his own little world of fantasy.\n\nAnd invoking the gods of wrath to punish the grownups who caught him.\n\nIt truly is pitiful."], ["@bloggalot4718", "Too late, the volunteers are already in Ukraine and have been fighting for many months. Fed up of listening to threats from Putin and his gang."], ["@DH-kt8st", "Russia has a terrible record of being in charge with the wrong leaders. Without Poetin the country would be rich and prosperous and there would be no need to bully other countries into submission."], ["@robertedson2155", "Putin is a clown, his mind is stuck in the past and when I say, I mean medieval times which is why he still uses poisons, so he nukes and then what happens? he runs to where? I don't know what goes on in his mind but it is sad."], ["@vrvaughn", "Why is Putin still alive?"], ["@bugsy791", "This report is so bias and it's obvious...didn't Macron threatened Russia first?"], ["@bravosierra2447", "Who is gonna blink first?"], ["@thomaskenyon9240", "Pretty clear what terrifies him!"], ["@davidhoover3347", "Someone read him The Boy Who Cried Wolf."], ["@ebb.D", "He loves playing mind  games. Putaboo! Not Putin"], ["@Tracerburn19", "The last time the French military ventured that far east, things didn’t turn out well for them."], ["@yurgamark", "Putler is scared AF"], ["@PandraVa-hq9oo", "I trust Putin more than  western politicians."], ["@Dreamscaper111", "Quite frankly im part of one of those countries and to be fair our leaders dont bother asking us what we want , wether we would take risks to help Ukrainiand because ABSOLUTELY i would . I have kids ect but there is a bigger picture here and so called leaders i just see as scardey cats... Putin wont stop unless someone stops him . Im embarrassed to be British"], ["@alialimohamed9410", "DW why lying 🤥 to your own public citizen.What happened to NordStream pipeline line"], ["@juancolon7040", "He should remember whos got tge experience using the nukes and the consequenses! Japan knows that terrible experience!Careful what you ask the Gods. You may get it!"], ["@Robby3296", "I'm not trying to find out if this man is bluff or not. Don't send troops."], ["@alyparker4457", "People are delusional if they don't think troops are on the ground. Might not be on the front, but they've been in ukr since 2012. No ones hands are clean."], ["@allines6470", "Putin has to be chosen Head of Europe immediately."], ["@chase94.", "No winners"], ["@andyharpist2938", "Its not my war. And Russia threatens noone. America fighting Russia using Ukrainian boys is as evil as it gets. And your German news is utterly ludicrous."], ["@HRTWARRIOR", "Hahaha he's scared."], ["@TrixiLovesYou", "Ah yes, the usual threats again and western leaders start shaking in their boots. It's a pattern by now and the only insane part is that the west is too weak to stand up against blackmail."], ["@juanalonso1980", "Again 🙄 Vladimir please. I promise you a romantic date whit trump next year."], ["@thetaikonaut8397", "The “im going to lose so im taking everyone with me” card."], ["@kugelblitz5812", "Call his bluff!"], ["@iLLustrious85", "We dont believe you, you need more people"], ["@user-by7uq2lz7c", "NATO started the war with Russia, with Ukraine used a a proxy."], ["@mjs4751", "He has been truly emboldened by the Republicans in the US Congress.  Shameful."], ["@allines6470", "Putin never lies. \nTake it seriously."], ["@svenjorgenson3224", "And rightfully so!.... 40 yrs of infringing on the Russian border has finally caught up with America...\nAlong with reality"], ["@somethingsinister8493", "They threatened Nuclear war if the west intervened in any way, since then the west has called their bluff over and over and over again. Putin is just embarrassing himself at this point. He looks genuinely sad, he doesn't look like a man who's leading Russia into the next generation where it will dominate the world, and all his guests look sleepy and bored. It's incredible people still think Russia is winning because it managed to steal some farmers fields from the outskirts of Ukraine. 😂 And they lost so many men doing so that now Russia is demanding women pop out multiple kids even though they cant afford to feed the one kid that they have. Putin has decimated Russia and his lemmings are still nodding along politely to everything he says, it's incredible."], ["@talesofcanterbury42", "Western forces should already be West of the Dnipro river."], ["@cerconefamily2912", "Has anybody ever asked the question \" what happens one day when Putin is on his deathbed and decides his lifelong enemies should pay the price?\" I haven't heard it..."], ["@user-hk1pd5sy9w", "Agh he says that all the time .."], ["@user-by7uq2lz7c", "I am Canadian, and pray for you President Putin. I support whatever decision you make to stop NATO."], ["@gimmy118", "Desperate people do Desperate things. The West knows they lost war in Ukraine 🇺🇦."], ["@tiptoe38", "The west threatened him so he threatened them back,so what."], ["@TheGersh18", "If you continuously make threats for years and never make good on them then with time your threats will fall on deaf ears, no one will believe you. You’ll become the little boy who cried wolf."], ["@mohmadhassan7926", "it's logic, russia is surronded by gangster, us and the west,luckily russia are not a weak country, nuclear power country, if not,from the begining russia would attack by the warmongers."], ["@nolongerblocked6210", "Nobody in the west is scared of you Putin, literally nobody. We've seen your pitiful military in action"], ["@IcarosImmortal", "So , what is going to be done with this convicted wwar criminal ? will he threaten  the planet and still none  answer  properly ?"], ["@Lylaylion", "Why does the west want to send troops in Ukraine though? Did the ukrainian canon fodder run out? If thats true how about a peace deal?"], ["@acholnai9358", "\"i just said now myself\" , the western world always look to make some the dictator but them self too much democracy. what happen to peace talk?"], ["@Jabe1963", "WORLD PEACE - it’s a beautiful world ❤"], ["@west5828", "Well said Putin , great speech!"], ["@maximusmiles8435", "Look at a nato map from the 80's, and compare to today. You don't back anybody into a corner, and expect good results."], ["@sergiodelgadomeza2202", "Well, he told to NATO for many years don't reach the Russians  borders and no buty beleived his warning until Feb 2022. Now he es warning again, and base what I could see on the previus comments they won't beleive him, until they see the sun at the mittle of night. Then, everybuty will show shocked faces, as they did it when he invadate Ucrania."], ["@eduardselskiy320", "The USA and NATO cannot govern in the old way - the inability of the ruling class to maintain its dominance unchanged leads to weakening.\nRussia, China, and the global South do not want to live as before and demand their place under the sun, and they will get it."], ["@PjotrII", "Is it the 4th or 5th nuclear war Russia has threatened already. Russia's leader is dumb, but not enough dumb to see himself burn in flames."], ["@robertsiwek7503", "How it is possible that RuSSia is fighting NATO and at the same time is threating NATO to not to join the fight?"], ["@thoenyhills217", "Oh wait, yep, it’s Thursday again isn’t it. Shirtless shorty going to push his buttons."], ["@filipe5722", "Europe needs its own nuclear capabilities."], ["@Aashirbaad", "USSR ❤❤❤"], ["@jerrykawashe7911", "I don't blame him. Nato must be keeper's and not war makers.  Nato is full of garbage"], ["@Keepingthefaith72", "NATO has a lot of Nuclear weapons, And they are all aimed at Russia...."], ["@fimyfeed", "Nuclear countries are safe in this cruel world"], ["@sommmeguy", "Which is exactly why NATO should place soldiers in Ukraine. Is Putin controlling the world now by being the craziest person in the room?"], ["@ryandunevant7448", "There is zero difference between the Cuban missile crisis and this… if you think what Russia is doing is evil then what the Is did was evil…"], ["@Oliverbrun90", "Putin is scared af"], ["@shaungriffin123", "This man wants all of Europe including Germany uk and France, rattling the nuclear sabre just to take more ground. He’s already admitted to wanting all of Europe!"], ["@80-80.", "Hasn’t Putin been saying for years that NATO is already in Ukraine and that he is fighting NATO right now? Has he forgotten his own lies?"], ["@davidrickwood5588", "Putin is powerless and scared of NATO"], ["@satvinder8810", "NATO Lost and destroyed"], ["@robertsiwek7503", "When Putin warn about nuclear war, he is afraid."], ["@stefanlazarevic9072", "Did anyone hear Putin said that he warns with nuclear war?"], ["@josephkelly1422", "Why are u afraid"]]