[["@odynhros", "19:26 goofy aah"], ["@stenwurtz", "When Trump doesn't think Nato countries are buying up military hardware, which is the agreement - he is only partially right. For many years, we have not considered NATO to be particularly important since it was targeted at the USSR, which as we know no longer exists. We should perhaps have seen that Putin has slowly but surely crawled out of the fog after the collapse and represents an even worse regime if possible. Now he must be fought and the USA, which profits from military purchases, can clap their hands, but then you can also reasonably demand that they fulfill their agreement."], ["@JeffreyPullen-lp4oe", "I don't like trump but baron looks like a nice kid god bless baron"], ["@lilljacob", "If you listen to Trump speaking backwards you can hear him asking Putin to nuke the U.S in Russian."], ["@katherinepettit6585", "Trump > Hillary. She is soooo dodgy and would have been the worst 1st woman president for America. There are so many better women out there with much more moral integrity for the position."], ["@michaelcruz4623", "Trump forgives Russia for the Iron curtain and the cold war!  He trusts an enemy!"], ["@michaelcruz4623", "In 2012 Trump began his racist.movement, picking up racists bad mouthing Obama."], ["@user-zb4ze6fn5x", "Putn help trump win the election by cheating"], ["@rwb3335", "Protect our USA border not Ukcranes. \n$$$$ for USA not NATO\nNo more dead people. This war can not be won. Compromise wins wars not Blood and US tax payers $$$$\n\nTRUMP 2024\nLGB (Let's Go Brandon!)"], ["@jimmyw7291", "Russia is still a 3rd world country playing super power. The only value that comes out of Russia is oil-producing that's it they have what 3 Cities all in the west of Russia because the rest is Pretty much inhabitable"], ["@jimmyw7291", "Throat history All russia has done is Collapse One dictator After another"], ["@marcelperera1630", "Putin likes fools like Trump who he can manipulate."], ["@marcelperera1630", "We don't like dictators who kill innocent people."], ["@liamstanton6053", "Their states were only destined to remain enemies in the eyes of those whose business  interests are served by perpetual war"], ["@BrandonTon618", "see, Hilary was right. the problem with Russia is it's an autocracy.  One man rule and Putin is a Hitler, a dictator who wants to return the Soviet empire. He's a thug, a killer. He kills off any political opposition. Trump would give him Ukraine. Putin will then go for Poland, etc. a situation not good for the US and the world"], ["@Vote.for.EUARMY", "Thats how the war started, the Crimean naval base. All about influence."], ["@W_Bin", "37:41 _\"I can hardly imagine he went to hotels to meet girls with low sense of social responsibility\"_\nThat aged like milk. 😂"], ["@W_Bin", "31:20 \"Trump saw Nato as a competitor to the US\""], ["@W_Bin", "27:57 the reason Putin hadn't endorsed Trump 2011-2015 was no doubt because of the total disasters backlash against his endorsement of Yanukovich in 2004 had led to."], ["@W_Bin", "19:30 _\"the cry goes up Crimea is ours\"_ \nA publicity stunt.  Despite extended daily brainwashing on Russian State TV, a Levada poll in February 2014 found that only 16% of Russians thought Crimea should be part of Russia."], ["@W_Bin", "18:45 \"Crimean residents overwhelmingly backed annexation\" - how funny when 4 years earlier support for Russian Unity party was 4% in the elections, a year earlier in a poll 77% were *_against_* seceding and joining Russia, and 2 weeks earlier in a poll 59% were against even Ukraine joining with Russia.\nIs DW the only entity in the world unaware of Kremlin's falsification of poll results, and staging \"celebrations\"? \nEven the Russian Presidential Human Rights Council pointed it out in a report on 27 April 2014, a month later."], ["@W_Bin", "11:17 _\"he was the clear winner with 64%\"_ \nis DW the only entity in the world that hasn't heard of vote rigging and exclusion of opposition in Russia?"], ["@W_Bin", "5:40 \"Expansion of Nato\" BS. This was explicitly *_agreed_* by Russia and just another propaganda lie created by Putin. \nOn 19 November 1999, when Putin was PM, both Russia and Ukraine signed the Charter for European Security. \nClause 8: \" Each participating State has an equal right to security. We reaffirm the inherent right of each and *_every participating State to be free to choose or change its security arrangements, including treaties of alliance,_* as they evolve.' \n...  *_\"no State ... can consider any part of the OSCE area as its sphere of influence.”_* \n\nOn the same day, Yeltsin said to Clinton  \"Just give Europe to Russia... you know it has to be done...\". (P562 _\"Declassified Documents Concerning Russian President Boris Yeltsin · Clinton Digital Library\"),_\nYeltsin was trying to do another Molotov-Ribbentropp Pact. \n\n*_I wonder where Russia could have got the idea that it could sh*t on the law?_*  \n*_Could it be the huge violation of the UN Charter since 1991 pretending that Russia has a memberships of the UN and veto when it has never even applied under Article 4, let alone been named in Article 23?_*"], ["@Whitesox216", "Trump and maga approved the murder of navalsky"], ["@JonHammer", "Can't wait for Donald trump"], ["@Pppppp443", "And after only four year of Biden we have chaos and big cemeteries all over the world..."], ["@crystalheart1186", "I’m watching after the death of alexei. Traitor trump."], ["@user-jt7ep9fb7k", "Trump& Putin enemies of Hillary Clinton and Barack Obama Europe insist \nYes Barack Obama in USA like Alexi Novalni in Russia even more becouse he already knows American politics inside out and he is still alive and ready to fight for normal people people who don’t want to kill anymore"], ["@user-jt7ep9fb7k", "Germany is despot now by loosing Kremlin in Moscow"], ["@USER-jo7yz", "The Russians are experts in leveling entier cities..."], ["@bluestarfishmurphy6372", "If the wives of all the men Putin has had Murdered inside Russia and outside it got together the world would be shocked how many there are.  Read The US Magnitsky Act 2012, Almost the same treatment as Alexei Anatolyevich Navalny's sad death  this week. Sergei Magnitsky a brave Russian loving,  young honest accountant was murdered on Putin's orders.  Magnitsky developed gall stones, pancreatitis and calculous cholecystitis and was not given medical treatment for months. After almost a year of imprisonment, he was beaten to death while in custody by a riot squad."], ["@derekbaker777", "Democrats twisted ideology and horrific policies is the biggest threat to America's Republic. Ppl on the left can't even define what a man or woman is, and have become morally bankrupt reprobates like Romans 1:18-32 describes."], ["@jantoleu8392", "Two friend bullies. Two greatest enemies of the USA and democracy."], ["@new_hampshire", "Worst president in history. Worst criminal works liar, cheater grifter, scumbag, scammer, ConMan thank God he’s going to jail.😂"], ["@ahriman9929", "Glory to the Emperor of the Universe, glory to Vladimir Putin"], ["@kevinneblett6749", "Hillary only congratulated America and not the mega party🎉"], ["@goofybeer1", "Putin wants Biden for president now!"], ["@kevinneblett6749", "America is about to decide if it's for all the people or just the White House People"], ["@kevinneblett6749", "America is willing to sell out before they follow Obama"], ["@kevinneblett6749", "He's probably hiding top secret documents in them fake shoes he's selling"], ["@kevinneblett6749", "Obama walked out with nothing and Trump walked out with Russia and everything that White House owns"], ["@kevinneblett6749", "The lines were divided when Obama walked out and took nothing then Trump walked in and took everything that Jack Smith will never know about"], ["@isstechnz1021", "Putin will keep invading other countries that's why Nato is around"], ["@LS-ki9ft", "Trump with prostitutes...Nah, it could never happen, just ask Stormy Daniels."], ["@LS-ki9ft", "RIP, Mr. Navalny. You fought the good and righteous fight for your country's freedom."], ["@kelvinberassa5181", "The West is responsible for Navalni's death. He is a Russian traitor,  American puppet.  Mr. Putin is a righteous man keeping the world safe from USA' unilateral corruption rule. Thank God for Mr Putin. He has an 80% rating of the Russian population. Navalni could never win an election over Mr Putin. No need for Mr Putin to kill him, he's no threat. The Russian population know the truth opposite to the USA' . Peace over war, right over wrong, righteousness over wickedness. Imagine Trump or Biden for election. The world is doomed. All yuh wicked God knows. God bless the Russian Federation without apology say. 🙏🏾 \nCondolences to the Navalni  family same way."], ["@infocus-media", "Was that Danny Glover om the crowd at 0:17 seconds? LOL!"], ["@conoroleary3639", "At all cost keep trp out of the white house can you imagine russian spies in the white house trump and jared doing their business all that money rolling from different countries all the while the russian controlling usa 🇺🇸 itd no joke it would be a reality american democracy would be finished and a dictatorship in its place run by putin and trump a puppet president who would be hoarding all the wealth what a partnership that would be its frighting to think imagine putin absolute controll over usa 🇺🇸 mind blowing devestating that is why you must keep trump out american people are being sold out putin is only useing trump because before long trump would be re moved and then you would really see whos incharge russia knows the trump family are just greedy so he gives them what they want for a while after a while putin will move in and take over thats why 🇺🇸 must vote blue democratic because the alternitive does not bear thinking about"], ["@alan4yt", "Trump is the anti war candidate the media hated that."], ["@alan4yt", "This is a freindship with putin that the biden lovies claim never happened."], ["@S00WER", "6 Let no man deceive you with vain words: for because of these things cometh the wrath of God upon the children of disobedience. HOLY BIBLE"], ["@user-pf6sc3ny6z", "Η ΔΗΜΟΚΡΑΤΙΑ ΣΤΙΣ ΗΠΑ ! ΠΡΕΠΕΙ ΝΑ ΝΙΚΗΣΕΙ ! ΕΙΝΑΙ ΠΛΑΝΗΤΙΚΗ ΑΝΑΓΚΗ ! ΜΕ ΤΗΝ ΜΕΓΑΛΗ ΝΙΚΗ !  ΤΟΥ ΛΑΙΚΟΥ ΗΓΕΤΗ ΤΩΝ ΗΠΑ ! ΝΤΟΝΑΛΝΤ  ΤΡΑΜΠ !  *** ΤΗΝ ΝΙΚΗ ΤΗΣ ΔΗΜΟΚΡΑΤΙΑΣ ! ΣΤΙΣ ΗΠΑ ! ***"], ["@user-jh3sh8gp9v", "Trump is a Puppet President of Putin which has diminished all the efforts of our past great Presidents including Truman and Eisenhower. I disliked this guy the most and will continue to do so. The guy is a good speaker and clown no doubt. However, who is getting into his speech and cheering for him, please go through the History before Voting this Guy!! You probably are killing your country and our generation future with it. So please!!"], ["@oddcool1", "You know your doing something wrong when the worst official enemy of the US is celebrating when a new president is elected in the US."], ["@user-tb6lg5jd7o", "Being involved in Russia 🇷🇺  has always been a Bad Destination OK"], ["@jacksonmpondo2903", "Ameeen"], ["@lindamaxwell3688", "They are both out to destroy USA.Why voters want a dictator  not freedom anymore Wake up voters. Keep him out and all his lies"], ["@djmclencio", "THE QUESTION IS :  Why now Putin prefers Joe Biden to win the next election??? Is there someone that can give a polite answer???"], ["@russellearley4442", "Both losers on their way out!"], ["@user-jm2uu5dp6e", "chúc mừng vì hoa bình thịnh vượng❤🎉"], ["@user-rz4uu6ve1i", "Russia and America should get on and if trumps not next president god help us all,there's only trump can save the u s a"], ["@patrickpierce7475", "Cia and fbi both knew that Russia didn’t interfere in the election and fbi was hunting a reason to bring Trump down, they haven’t quit yet and Trump knows this and now American people knows this and trump will be elected president in November of this year!"], ["@patrickpierce7475", "Putin realized that Trump will try and drain the swamp in the good ole U.S.A. ! Trump didn’t drain the swamp but in January of 2025 Trump will start draining the swamp!"], ["@apelsinuke", "4:02 and she was right"], ["@apelsinuke", "0:13 look at the boy smirking at those words"], ["@user-pv4ld1je5x", "Another putins Puppet"], ["@jrt4585", "If you think Trump and Putin are bullies what do you think of   the EU and American foreign policy in particular their fueling of the Ukraine and Palestinian wars. And the biggest bully of them all? Starts with N and he's Jewish."], ["@Ahardly557", "Why are black people being put as a narrative of bad news? Weren't they there own people? Why are we overthinking Instead of going upon the church! It IS ok for\n segregation to take place! They call good bad and bad good! Shame on all these media driven stuck people! Shame on you all! Seek Christ! He leaves no greater or lesser, we are ALL in his path and you can not stop him! Be purified or damned"], ["@GEMINDIGO", "It seems more to me like they colluded to turn a blind eye to eachothers fascism!"], ["@richardjimenez7394", "Trump is in cohort with Putin! Treasonous behavior and behavior for dictators"], ["@lylecraig-eq7jk", "I wonder just how many top secret classified documents were handed over, 🫰🏼just like that to Russia and Arab countries. \n      Magog was predicted to be involved with Isreal being attacked on a safe, peaceful day.  Gog being Russia or leader.  Involved, but not apart of actual attacks on Isreal.   \n        Honest presidents are at some time permitted to see things we hear of, we question the existence and everything in the world becomes nothing you thought anymore.  Things logically not, somehow becomes logical.  \n\n     Trump's one of those that bring logic to whats illogical, if he knows or doesn't.   And 🇺🇸 constitution is only words, but the power it has isn't logical in some instances.  😊"], ["@paddy1952", "How is it possible that the elite Yanks don't realize they're on the wrong end of an FSB influence operation. Herr Drumpf and his MAGA clowns are the most idiotic of useful idiots. C'mon Yanks, wake up."], ["@marclawson2536", "Love him or hate him, there's no denying that Putin has greeat taste. Did you notice the smashing, shiny pink tie he picked out for Trump?"], ["@lanabyk8012", "Trump for President - not now, but in 2032!   Trump for President - not now, but in 2032!"], ["@JonesGOAT", "Western journalists make me wanna puke, disgusting."], ["@kathleenroberts6931", "The Ukrainian people are fighting for their lives, their families, their homeland, their Democracy and Democracies around the world 🌎."], ["@mauroger86", "So what? As if the US never interfered in election of presidents/leaders anywhere else :D Try again DW, you are a laughing stock of the world's media."], ["@user-fg5dp4hq", "Kepp your friends close and keep your enimies closer.....Not a bad idea"], ["@julianciahaconsulting8663", "it is pathetic - and dangerous - what the Biden Democrats have done to relations with Russia; this whole business of claiming that even talking to Russia is being a traitor - it used to be just good common sense diplomacy to have cordial relations with another nuclear superpower...as a non american at least i never had to worry about the real propsect of a world war happening under Trump like I do now under Biden,"], ["@SmokeyMirror1313", "Hillary lost, thankfully we have the Electoral College."], ["@vasilimacharadze139", "hard to believe that DW was promoting once this Kremlin propaganda naratives. It was long before NATO expansion Russia already started invading its neighbors (e.g. Georgia in 1992)!!"], ["@DavidR-dq8rb", "Stone Flb."], ["@8gomerpyle22", "Trump is the best."], ["@davedanny9053", "TRUMP HAD GOOD INTUNTIONS 😅😮"], ["@davedanny9053", "❤THOU SHAL NOT HATE DONTKULL DONT BE GAY\nANTI MAN😮"], ["@privateperson7488", "Propaganda, it was Hillary that started the birth certificate issue not Trump, edit: the farther I get into this the deeper the bullshit"], ["@xarzu", "The American Democrat Politicians are Hard Core Evil and deceptive.  They are also very unAmerican."], ["@davedanny9053", "CLINTON CNN B S SHITY NEWS😮"], ["@davedanny9053", "Old joe BLOE \nBIDEN FAKE NEWS 😅😮"], ["@davedanny9053", "Why OLD JOE BLOE IS NOT CHARGE SICK AMERICA 😮😢😅"], ["@sfl6307", "Putin is scum of the earth !"], ["@sfl6307", "It’s in a book, way before he was president he was associating with some not to good Russians .  Putin has videos of him when Trump was in Russia hotel room and Trump had a couple of hocker who did some weird crap and Putin holds this over Trump’s head…..it’s black mail.  Read the Book titled: The Plot To Betray America.   And this will wake you up as Trump’s associate tells all, everyone wants the truth about Trump out in the open."], ["@MichaelDavidFinn", "The United States was telling allied governments to smear and discredit Donald Trump prior to the 2020 elections. No elections in US history have been rigged in favor of Joe Biden, by Washington standards one of the top criminals to hold office, morally corrupt, with many hinting that he along with Kamala Harris are just a front for former President Barack Obama, who was unable to run for president for a third term, plus he had said that he’d love to do the work, just not the public engagements that came with the job. So, discredit Trump (again) with the Russia lies that Sullivan had designed for Hillary Clinton’s campaign, but thankfully, didn’t do the job. \nWatching Germany become USA’s loyal dog, has been surprising! Who would ever have thought that the German Chancellor would authorize the destruction of German infrastructure that would lead to the collapse of the economy of Europe’s most prosperous nation!"], ["@Chu3505", "Putin secretly uses computers hackers helping the 👿 Trump to win the United States President Seat 😂Than Putin uses Trump as a puppet in the world stage."], ["@CommonSenseDude2121", "Documentary of LIES ! we are 2024 and all this crap is debunked."], ["@whatsmynameagain7774", "Fake news nobody trusts anything you say 😂"], ["@TheDukeOfPannekoeken", "This is a bunch a bs"], ["@climatixseuche", "and for propaganda like this you demand money from me ... fml"], ["@6egotronix", "you, the EU medias, probably owned by american companies, keep pushing the american globalist agenda, you copy the US left narratives and push them to us, along side with the misinformation provided by you with the taking out of context peoples words and statements by cutting out the parts that do not suite your desired narrative. this is sickening."], ["@racheltaylor185", "Him working with Russia is highly likely! His continuous flattery of Putin is just embarrassing!"], ["@chrismills2043", "bet putin stops the bs war he started with Ukraine once trump gets elected again.trump won’t stuff around,he will be straight up and go u want to keep going one more day in Ukraine u r mince meat russia."], ["@KamikazeJustice", "*Trump/2024/America First!*"], ["@blaneharrison6341", "Hes a moron"], ["@obezijana", "This video is a Kremlin propaganda"], ["@ruthbuschard7735", "You know what if someone told me those glasses and I seen what I really look like in them I would sue the crap out of them that's what I do and then I'd have them put in jail them are the most ugliest glasses I've ever seen on a human being you may think they look good and you probably get paid a big price for him but those are just so that's just me though I didn't have to do with anyone else it's just me those have a good day bye"], ["@erzsebetnilsson580", "2.27  You can see the INNOCENT of Putins expression and than this WAR MONGER  TOTALLY OUT OF TOUCH of EVERYTHING \nDIRTY GAMBLER and EVIL LIES OF TRUMP      \nregards   from Europe \n\nPLEASE STAY AT HOME AND SHOUT your   PRETEND NON  EXCISTEN  DASTIY OLD     LIVING ON THE COUD MURDER BUSINESS....."], ["@yunwuyu", "American cheering the Russian spy, how sad 😢."], ["@HammersnBlades", "Imagine how many lives would have been saved if the election hadn’t been rigged.. 🤦🏻"], ["@HammersnBlades", "Hilarious Clinton will never be President - Trump will bring common sense back to the Whitehouse."], ["@Viper87th", "I REALLY hope all those who want Trump back as a president, RETHING that thoughts, after watching this video, part 1 and 2"], ["@peggycushen", "You do realize Tik Toc is owned and operated by China?"], ["@Zeonoid", "propaganda \nDW loves NBC"], ["@AHD2105", "⭐ Even the narrators narrative that Putin hoped to rule the world via Trump, is reduculas. The world just wants peace and trade agreements which is what both Putin and Trump want. And Trump would use embargos and sanctions to prevent conflicts. This is what the world wanted."], ["@AHD2105", "⭐ Trump was getting all China's potential alais on side, to strengthen the US standing. The west has never won a major war without Russia!"], ["@juhyokang2571", "Okok"], ["@user-sv2pt5nc6m", "No surprise at all!,,"], ["@azjeep26", "trump = me me me me Putin = me me me me Little Kim = me me me me"], ["@LorettaLaz", "*IT BREAKS MY HEART* that world peace was inches away, but the CIA, and world elite, military industrial complex.... just couldn't have it.  *_HEARTBREAKING_*"], ["@SeanHorton-ky6ds", "Ok.lo9k at how much America has put 4rth, compared to NATO..."], ["@SeanHorton-ky6ds", "Garbage..."], ["@SeanHorton-ky6ds", "Biden"], ["@SeanHorton-ky6ds", "Yo7 tick3rs voted on  him."], ["@SeanHorton-ky6ds", "However, Trump, did as he sa8d. He fixed all of it. Then 4 years later,  Here comes The dummy."], ["@SeanHorton-ky6ds", "Yeah, birth certificate was fake come to find out..."], ["@konferowicz1967", "Can't believe DW didn't pull that off YT 😂😂😂"], ["@konferowicz1967", "You idiots will have to deal with Trump again so better used to it! Have some respect for man who is loved by half of this country! You have to love that he called Germans on being dependent from Russia and not spending fair amount on defense!"], ["@Viper87th", "@04:04 seems like Hillary Clinton was SPOT ON correct when she stated Putin DOG  is the same as Hitler !!"], ["@ProMainMan", "And talking about the birth certificate.  If you weren’t paying attention back then, go back and learn.  That birth certificate was supposedly found at some hospital in Hawaii (a super ultra progressive Democrat state) and the hospital employee “that found it” died in a freak snorkeling accident shortly after.  Weeks after.  Don’t let them fool you about Obama.  Go learn"], ["@exsmoker74", "Tucker Carlson interview was good . Its was honest unbiased reporting.  Just letting putin speak his side and letting people make up their own minds. Not like here."], ["@ProMainMan", "Clinton’s are POSs.   They have hurt America more than any other couple in American History"], ["@duncanfindlay3227", "Remember that time when Donald Trump stood up in the UN and warned Germany about buying the largest part of their energy from Russia and your diplomats laughed in his face? Germany has always been Russias true ally , your political propaganda makes me sick."], ["@Oleh-Adolf", "Man to Trump, hummans two"], ["@Oleh-Adolf", "Bettering ways weiting greating sisthem this USA USSS. And, but undejob for❤"], ["@blooddumpster3427", "Trump is a stupid man. Putin is not."], ["@agronopoulus", "Trump 2024!"], ["@ProsperCobbold-jr2yy", "Funny how the west has forced itself to hate china and Russia 😂thus calling trump a bully as he tries to foster realistic peace."], ["@BassRck50", "SLUG!"], ["@JaneSoole", "Carlson appeared to be skewered by Putin, who did his usual trick of talking without breath - a stream of consciousness of his own self centred, self regarding pap and a stream of lies and half truths about Russia's history. it wasn't wasted. It exposed Putin for exactly what he is."], ["@keesko5740", "This lunatic in the white house is a real disaster for world peace,he is a failure for the hardworking American"], ["@marisabenson1222", "Taurus Taurus Taurus"], ["@kensweetser6901", "Russia donated 145 to the Clinton's foundation. Russia donated 0 dollars to Trump. The Bidens administration shut down Clinton foundation investigation and destroyed the evidence"], ["@kensweetser6901", "Tucker and Trump are peace makers"], ["@user-fm1ki2pg2d", "Damn...I didn't realize Trump first speech was a LIE!"], ["@gusparra1259", "It would be good for all the humans that this two men have a really friendship."], ["@user-pu2hc2tw2i", "So what's the problem if Russia and USA  wants to be a partners and friends and maybe stoo building weapons to kill each other and start building spaceships to colonise the galaxy. Why we need to fight each other."], ["@user-zl3xs1cf8x", "Nikki Haley was causing problems with Russia and the USA so she could side with Ukraine. So this Bull has been going on for sometime. Thats why she's so hoping to be president in 2024.."], ["@user-zl3xs1cf8x", "President Putin is not alone, many dont like Hillary Clinton. She biased and very far leftist."], ["@user-zl3xs1cf8x", "So what? President Trump and president Putin are both good presidents..."], ["@user-zl3xs1cf8x", "President Trump good president, president Putin good president ❤"], ["@silviabujor5690", "ISDRET America Donald Trump, Vladimir Putin, 0 Investiment Pipo Fals Ales Donald Tramp Vladimir Putin Disdret Garanty BANKARE BLOC Disdret SEMNEAZA CONGRESSMAN UK BUJOR SILVIA Labrinia Via Mariotti 21"], ["@silviabujor5690", "ISDRET America Donald Trump, Vladimir Putin, 0 Investiment Pipo Fals Ales Donald Tramp Vladimir Putin Disdret Garanty BANKARE BLOC Disdret SEMNEAZA CONGRESSMAN UK BUJOR SILVIA Labrinia Via Mariotti 21"], ["@silviabujor5690", "ISDRET America Donald Trump, Vladimir Putin, 0 Investiment Pipo Fals Ales Donald Tramp Vladimir Putin Disdret Garanty BANKARE BLOC Disdret SEMNEAZA CONGRESSMAN UK BUJOR SILVIA Labrinia Via Mariotti 21"], ["@bennietaylor3938", "Yeah I never worked for Russia 😮 that's why you won because of Russia, what happened to the doser on Russia that came up missing on your watch??"], ["@user-jq2ju7bg2p", "7:02"], ["@PhuiLuc", "❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉"], ["@michaelillingworth6433", "Trump and Putin, true love forever."], ["@inmyopinion6836", "Vladamir trump will be the reason for the DOWNFALL of the (used to be) United States of America! His constant lying and manipulating of the press will destroy the fabric of this nation! ! ! ! !"], ["@marh762", "Trump kur flet dhe ne takime me burra shtetesh me rikujton interpretimet fodulle te Duces."], ["@ThePaulobraveheart", "This guy is a traitor."], ["@ahmetdagdelen6180", "DW is the gadget of anti-Russian propaganda of the USA. The USA cancelled Nord Stream which was on the advantage of Germany."], ["@siliconslice", "Lol"], ["@sevenm7389", "in the lands of the west, where dominion doth rest,\nThat a ruler among men, enshrouded in the eventide's gloom,\nContemplated, the shearing of his mighty scepter;\nAnd verily, he did conspire with clandestine intent\nTo reinforce the kinsmen serving under the daystar of the orient,\nWhere dwell the ministers of Satan the deceiver.\n\nThis cunning bartering of authority's seat of honor\nIs purposed to endow the adversary, Satan, with boundless sway,\nTo traverse the earth, marred with shadows of rebellion,\nDesiring to ascend above all principalities and powers.\n\nYet, be thou attentive! For in these potent western climes,\nThere reside the righteous, the steadfast in integrity, and merciful in spirit,\nWhose very souls are alight with the sweetness of moral grace.\nThey shall rise up with vigor and unfaltering fortitude,\nTo impede the progress of the malevolent serpent.\n\nIn their valiant conflict, immersed in the very essence of piety,\nThey shall endeavor to quench the malignant advance of the evil one,\nTo safeguard creation from his treacherous machinations.\nThus emerges hope like a tender shoot from fertile ground,\nThat purity may triumph, staying the march of darkness profound."], ["@brianmurray1395", "Putin in Trump are the two BEST LEADERS OF OUR WORLD PERIOD!!!! God bless them both👍👍👍"], ["@user-oq1le2vb6x", "❤Putin i Tramp❤"], ["@user-oq1le2vb6x", "Trampovi❤❤❤❤❤❤❤❤❤❤❤"], ["@GK-sr5of", "14:23 ¿Is this subject mentally deficient?"], ["@tituhouqe8825", "God bless america"], ["@oussoubiniakate8412", "Vous''deux'je'ne''laisser'pas''pour'moi'le'jour'ne'pas'encore''l'arrive'"], ["@user-uu1xh4wp8r", "Iap trump and putin if this is not back elon mask is awiner so trup putin or nothink"], ["@besarionioselini2089", "❤❤❤"], ["@user-wy4xi2xz1n", "Presidenti il progetto del controllo della mente del Deutesch è iniziato tanti anni fa facendo pressione sui dipendenti delle grandi aziende indossandovriceventi satellitari  poi qualcuno ha rotto le uova"], ["@jocknarn3225", "both crooks"], ["@asifnihal", "Trump helping Putin u got to love it. not Trump don't have hotels in Russia"], ["@macedoniansunited9929", "This is a prime example of biased witnesses/people interviewed"], ["@agustianingsih-hb7di", "Don't your only block"], ["@agustianingsih-hb7di", "Debt your Debt your violtion democration of yours infidel Dajjal hell is death in the earth me"], ["@agustianingsih-hb7di", "Coming to me your Must withdraw the matter problem with me in the earth me, too dirty yours still hold life licked anything from earth me,too many yours have violtion with me in the earth me"], ["@andriashol9172", "Papua merdeka bersama palestina"], ["@user-wy4xi2xz1n", "Il futuro umomini del millennio"], ["@michadabrowa5976", "Jak się uprą to każdego upieprzą"], ["@AuditorInvestor", "Germany has to be one of the dumbest nations parroting the American line and paying 4x for natgas instead of getting plenty of cheap natgas from Russia."], ["@user-js5yv3qc3p", "Rucis no don enemihod , putin es lo  diempre es lo que siempre a wuerido , wue tam dificil ed edo de vompreder , porque der enemkhod seria fatal para todos 😅"], ["@joevehon8817", "Trump and Putin could be brothers they have the same evil mind"], ["@PavolFilek", "USA is a regional power, which attacks all aorund the world, so this Obama and Biden autocracy never happens again."], ["@PavolFilek", "Political scientists  and analysts are always wrong."], ["@PavolFilek", "And Russia is srtonger and stronger and stronger, and USA weaker and weaker ... and EU weaker and weaker, ... and war in Gaza, and gas and oill goes up. Which is bad for Germany."], ["@Kyle-uz1rp", "Russia and US should be allies."], ["@user-th8gp9co1x", "🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩"], ["@user-th8gp9co1x", "❤❤❤❤❤❤"], ["@ShukurjonTlavoldiev-to7gr", "😂😂😂😂"], ["@detectiveofmoneypolitics", "Economic investigator Frank G Melbourne Australia is following this very informative content cheers Frank 😊"], ["@annettegrantham7938", "Pavel Felgenhauer, This is your empire, status seeking power grab, not borne out by the Soviets who returned national sovereignty to the republics held captive by Russian tanks since the end of the war II.  I personally fought three Soviet incursions into Iran. Russia built itself by usurping the sovereignty of weaker states.  I hate Russia.  We do not want a larger rogue criminal state called Russia causing endless trouble as in Syria, Iran, Ukraine, Gaza, Georgia,Chechnya, Dagestan, Armenia, Finland, Belarus, Estonia, Lithuanian, Latvia.\nWe know about the Holodomor. We know about the Gulag.  Your writers come and live here because they are free here. Russia is a Rogue State populated by thieves."], ["@user-mn8re8jp7v", "Deep feeling to Ukraine in Russians!..Are you kidding?! 😢Why  are they  killing their “relatives “, as they call Ukrainians, today?  And  not only them, but mostly ethnic Russians, living in the regions where the  front is coming through!"], ["@user-mn8re8jp7v", "Such a pro-Russian propaganda!"], ["@user-wy4xi2xz1n", "Il futuro dell universo lunga vita che Dio vi benedica"], ["@fuhrerman", "TRUMP 2024 🇺🇸🤝🇷🇺\nPEACE🕊🙏"], ["@fuhrerman", "TRUMP 2024 🇺🇸🤝🇷🇺 \nPEACE🕊🙏"], ["@boycotte", "Same as CNN - fake.."], ["@JeffreyPullen-lp4oe", "Even before this documentary came out I knew trump was giving Russia top secret information to Russia now this documentary has come out backing my facts to be right how did I know I have slight Autism which makes me very dangerous to the people who are Satan's puppets I am blessed by God himself I seem to be 30 years ahead of everyone else but I ask myself why has God given me such a great gift when I am not high up politicly why couldn't he give this gift to someone high up in politics I ask myself why me ???"], ["@corintomartins5823", "🆗"], ["@user-wy4xi2xz1n", "Quando vincerà i andrò a comprare una batteria di fuochi d artificiò Number one"], ["@MarieDavis-xt7er", "Guess Vladimir Putin and Donald Trump do not want to be liver and onions for lunch from the Bush's and Clintons and Bidens and recently Obamas forget about working over war and I guess even Russia can have missing sex trafficked kids from places like Jeffery eupstine orgies Island"], ["@thisenbui2773", "Donal Trump 👍👍"], ["@kevinshepard7796", "We will look back at this time in American history and see that Russia conducted the most successful psychological operation in modern history. Furthermore, we will look back and realize Donald Trump was the most successful useful idiot to be placed in power from an adversarial country in modern history. Who knows how far it set back out intelligence community / assets? Who knows how many classified military tech documents? How many nuclear documents? Now we have millions of Americans walking around parroting Russian / ROC Buzz words and talking points, and one of the largest news stations in the entire United States is propagating Russian propaganda. Democracy here in the United States is dead in the next 20 to 50 years. \n\nWe need to remind people that Putin is a former KGB intelligence officer. THE USA AND USSR ( sorry I meant Russia) are adversaries. We are not friends. Putin wants nothing more than to establish the former USSR in its entirety and knock off the United States as a world superpower in the process.\n\nAnd they are coming extremely close to succeeding, if they haven't already. The infiltration, specifically with the GOP,  is DEEP. And anybody a part of our government caught colluding with the Russian government in any capacity should be charged with treason and treated as such. Our democracy is under its biggest threat since it's inception. Period."], ["@JlaKnows-nj3hk", "BOOM"], ["@robtorres5518", "Fitting"], ["@1000kings1", "whole program is bs.  Fact is hrc was a politician for sale and Russians knew it."], ["@DJS11811", "Trump works for Putin. P.S> Trump is a grandpa."], ["@user-ji3ux2by8k", "Thanks my lovely,no promosion❤❤❤"], ["@ronsmith1429", "Trump has worked for Putin 43 years. Most of the time illegal laundering of stolen money from the Russian people. Then giving Putin U.S. Military secrets."], ["@SteveLarson-rx6ek", "This isn't a Documentary this is Propaganda.  #Trump2024"], ["@deezznutts6036", "Don’t forget Americans Hillary Clinton fabricated the “ Russian collusion” Trump was clean!"], ["@mamadnawroozi", "Criminals!"], ["@eight7934", "It would be nice to get along and I'm 100% sure it IS not/definitely possible"], ["@scubemariononovsky-tb8js", "R WE THRU WITH THE MANCHURIAN CANDIDATE'S MOVIE'S I KNOW WE R W GAMBLING'S MAYBE TRUMP SHOULD ZIP HIS NECKTIE TO HIS OVERSEAS BANK ACCOUNTS DOE'S HE HAVE UNO 1 A DOLLAR BILL IN HIS WALLET? THIER FAMILIE'S PURSE'S NO! DEBIT CREDIT AMERICAN EXPRESS AMEX SERVE BLUE BIRD F!U! &"], ["@bholasahani7591", "बनके छाया सादगी का आकार तो खिलते हुवे आये है हसी का  मौका \n\nफिर भी मिलतें है कयामत का रंगत तो चाहतो के लिये जो खुशी हो सका\n\nसमा से भी छाया कयामत का रन्ग तो बहारो की एहमियत रहा\n\n\nजो कायदा भी छाया इनायत की तरह तो किरनो से भी आये मंजिल के लिये एहसास का मौका \n\nचमन की तरह छाया किरदार तो इरादा से खिलकर जो सादगी मिल सका\n\nअर्मानो की तरह भी रहा तमन्ना  का फेरा तो महफिल से जो यदा रहा\n\n\nफिर साहिल की तरह अर्मानो का आकार छाया तो जीवन मे रहा जितने हसी का तिनका"], ["@user-ul9oc8sg3l", "Trump will sell his mum his daughter his county just to be in the white house 😂😂😂😂😂😂"], ["@studentus4983", "Citizenship some company Bangladesh development"], ["@Kaanack95", "Trump ❤❤❤❤❤❤❤"], ["@DahirXashi-er1mz", "Abgal Nugler, two of them are successful, they have broken the system and they have taken the system from the system, they have taken it from the system, and we have left it in this way. It is not possible to use the system to talk or not.  You can't enter people, mind and wealth in the country without warning"], ["@carlmartin656", "Two of the biggest criminals in politics, traitors!!!"], ["@marvellis6762", "America's greatest ever traitor, con man and national security threat"], ["@djkk464", "Hillary =Hitler 😮 Obama as well. He   wasn't even born in America.  He was born in Kenya 🇰🇪 😳 😭"], ["@papi5377", "😂😂😂"], ["@danielasulea2694", "Priveghi tramp? Cam asai? E cam bolnav"], ["@garylawler1453", "Wann werden die Deutschen den Nationalsozialismus aufgeben? Staatliche Medien sind voreingenommen gegenüber Ihrem autoritären Staat..Wenn Trump der Ukraine keine Javelin-Raketen gegeben hätte, hätten sie die russischen Panzer wahrscheinlich nicht aufgehalten. Obama und Biden würden der Ukraine keine tödlichen Waffen geben.+ + + When are the Germans going to give up on National Socialism? State run media is biased toward your authoritarian state. If Trump hadn't given Ukraine Javelin missiles, they probably wouldn't have stopped Russian tanks. Obama and Biden wouldn't give Ukraine lethal weapons."], ["@fergyjenkins6353", "Looking back this is making us normal people sick"], ["@santehod", "You even don't understand what you get )))),"], ["@StevenPlayzGames", "Two world leaders respect and like each other, and this is bad??? I wonder why that is..."], ["@jdenha7078", "7:06 what a lie 🤡"], ["@jdenha7078", "Remember 0bama on hot mic promising more flexibility after he gets re elected? And hillary giving them a reset button? Then colluding with them to create a fake dossier, Who’s the puppet here?"], ["@user-uq9dh9zf8d", "🐯🐯"], ["@peace-tx6xu", "The fact is the One.\nWe who hope peace and freedom are Won.\nThank you so so much, Leaders and all soldiers.\nJapan"], ["@aliocal6613", "YAKIŞIR YAKIŞIR YAKIŞIR, Putin Başkanıma ve Başkan'a Sayğılar,  Dünya + bütün gezegenler satranç şampiyonu"], ["@codylim1", "16:44"], ["@DahirXashi-er1mz", "Taram Ken, the money you gave to the children of that city, one of them is a goat and a job, and the other one was the money that your brother Mohammad Yusuf sent to Berlin, did you give it to me?"], ["@troyingram716", "We got a Putin/ Trump partnership to deal with."], ["@DahirXashi-er1mz", "As soon as it happened, the money for the horses and my money was stolen and in Qatar there was an increase in the number of people who were forced to work and the family lost their family property.  This is a sign that the family is being attacked and attacked. The system is still valid. As long as the government of Ethiopia is giving the Somali people the support they have agreed to increase the number of tribes and give them a way to increase the number of people.  The original good dog, get your flag when Kowal Ferris is stopped, the country of Somalia does not belong to the world, this thing can eat something clean."], ["@user-uq9dh9zf8d", "Ekonmi varili por tiftik 🙄☺️"], ["@JetLee1544", "The Russian journalist at 01:00 and later, Yevgenia Albats, is one of the last remaining true journalists in Russia. They closed down her newspaper. She has some older interviews with PBS and an own channel on YouTube."], ["@DahirXashi-er1mz", "Hafante taraslashen exc Janje"], ["@iTube22100", "What has Russia ever done against the USA to hate it so much only God knows!!\nThe fact is you want to be the only one in the world. you hate everyone and know nothing but destructive wars."], ["@user-nu5jd1oz4o", "글쎄요 우리믿는자들은 배신한사람들은 절대로 다시믿지 않습니다  푸틴 또한 더힘들게했었다고하는거보니  틀림 없습니다  푸틴 또한 믿으이 좋은거로 알고있습니다  그래서 속지않습니다 우리는 하나님께서 말씀하시는거만 믿습니다"], ["@mo0nstonegirl", "Legit love Putin and Trump, what a great team 👏 two men who aren't about farking around."], ["@juhyokang2571", "신고ㆍlove  ok"], ["@hiennguyenthiminh6256", "👌🏻❤👌🏻"], ["@Quickger", "Putin saw all whats happening now in 2014...OG 👑"], ["@michaelesq.atpcfii.9862", "flash forward to 2023. Trump indicted and soon to be jailed under the espionage act"], ["@Cjones322", "Putin owns the GOP."], ["@paulhorsager", "DW are a group of woke writers and producers aiming to alarm viewers and govt officials of so called global warming which lead to passing open border policies that destroy western cultures. What do you expect from FED run media…truth? DW is a propaganda tool. BTW Carsten Von Nahmen all your war-mongering about NKorea and Trump didn’t age well. 😊"], ["@garysuplee5092", "Satan and Lucifer 👿🐍."], ["@AK-FourtySeven", "It’s outrageous how translators aren’t translating correctly and adding words that never took place"], ["@romuluspierre5572", "Yes"], ["@arturasstatkus8613", "Idi,,,,,,,t and putin gang"], ["@danielcabrera5348", "Two white hourses.  Lickily there is pale horses in america"], ["@vietnguyen6332", "new dew messeewennonithankyou power lasffcofparaong"], ["@maryburke1351", "If it wasn't for this bosom buddies you wouldn't have a job"], ["@yadavshyam4546", "Donald trump 🇺🇸 putin"], ["@nupudhar4918", "পশুর মত প্রকাশের অধিকার নেই বললেই ঈশ্বর কণার অস্তিত্ব রক্ষার দায়িত্ব পালন করেছেন তার উপর আবার নতুন প্রজন্মের জন্য কাজ করছেন"], ["@user-di2ew1xw4n", "Grins ruhig Nicht als Präsident Warten wir die Verurteilung ab😂"], ["@bosskhan8089", "🇮🇳🕊️ peshab Na Kar maroge pure world ke Rashtrapati To Ham Apne Baap ki aulad Nahin Puri Duniya madrachod Duniya per Utar gai hai sirf Sher bache Hain Itna Yad Rakhna Russia Ko Bhi Bata De ki tere baap ne kaha hai"], ["@gavinmc5285", "biggie and tupac: who invented the remix?"], ["@eddierussel5911", "Zhirinovski says : \" Babushka Hilary can go rest now\" 😂"], ["@altayrstudio", "funny how DW portrays Putin as some kind of messiah and whenever they talk about Europe or USA they are the bad guys, NATO didn't expand to the east, the EAST wanted desperately to join NATO, I get that russian easy money is good for the business tho."], ["@JimTimber", "The most evil man that ever walked the face of the earth is failing at his evil illegal invasion of the Ukraine. Glory to the Ukrainian heroes ! 💙💙💛💛.. and the criminal trump will go to jail in 2024.. what a pair !!"], ["@bholasahani7591", "है कास जीवन मे कितने अरमान तो बहारो के लिये आये  चमन\n\nखिल जो आलम खाबो के इधर तो फिर रहा आसियाना का सफर\n\nखिलकर आया है जीवन के जहा मे तो जो रन्ग का खिला है पावन\n\n\nअर्मानो से आये कली तो चाहतो के लिये है जो हसी का फिकर\n\n\nजो मिल गये है जितने चाहत आये है खाबो मे बनकर दावन"], ["@notme1777", "Dont u love getting used by your country"], ["@ngangirae-lu6nx", "Things getting mixed up. The war or peace way. ."], ["@peterderidder9922", "part II , the only thing what didnt goos to putins plans was trump didnt was reélected ..."], ["@peterderidder9922", "The moment trump and putin where on that photo , putin alreddy had big plans .  In meetings with trump and putin , putin yoused beautifull hostesses to distract trump . and to be fair, every man would look if a nice beauty commes by."], ["@glenselenselvs", "Putin arrives with \" beauties\"\nTranslation: putin arrives with His merchandise , objects women whom are willing to fuck millionaries to win."], ["@ngangirae-lu6nx", "Seen with thanks. Truly education would be highly useful....asante."], ["@lifequotes138", "you can say what you want all shit media. Trump is the greatest ever president of USA❤"], ["@robertbolton9450", "DONALD J TRUMP GREED."], ["@tommythomas1585", "Yes we DID fake the moon landings. What are you trying to say obama?"], ["@linuxuberuser", "I often wonder if Trumps strong relationship with Putin could have saved Ukraine from being razed had he been elected for another term."], ["@TranNguyenVungLay", "WHEN THE ATOMIC BOMB DESTROYED HUMANITY AND THERE WERE ONLY TWO SURVIVORS:\n\n* TWO ATHEISTS SURVIVED : THEY LIVED TOGETHER IN PEACE.\n* TWO DEVOUT SAME RELIGION SURVIVED : THEY FOUNDED TWO DIFFERENT RELIGIONS.\n* TWO DEVOUT BELIEVERS OF DIFFERENT RELIGION SURVIVED : THEY CONTINUED TO FIGHT EACH OTHER WITH THE STICK."], ["@knowledgeanalysis7655", "Russian involvement in elections is just a myth created by media."], ["@bereal6590", "Putin is a man who keeps his people poor his oligarchs rich and complains about nato but invades ukraine and threatens world peace causing problems in Africa and the middle east. He is a tw*t just like trump"], ["@user-ig8tx3bv4k", "That's right, Putin helped him win the Presidency in 2016,he is most evil, despicable person in the world"], ["@angelocamocard4395", "Immensi complimenti ed ammirazione che vi devo per voi eccelentissimo miliardario miglior pressidente,perché ovviamente quel terrorista di obama in realtà non é stato altro che un enormissimo dramma,so solo che lei riuscira a mettere ordine in medio-oriente visto che l'ambasciata non che capitale la spostata a Jerusalemme.Tutti quegli immigrati irregolari spacciatori di droga compresi sporchi tunisini babuni ed altri banditi a causa di questo maledetto vcchiaccio,pedosatanista(biten che abusa dei minori)vanno tutti legati a tutti gli effetti e sterminati su maestosissime sedie elettriche falsi ambientalisti(neo terroristi)compresi.Quanto a voi eccelentissimo signor miliardario e il nuovo Zar di Russia siete le persone più formidabili furbe e super intelligenti poi vanno elimnati tutti gli islamisti(miscredenti),e hamas o dei degli islamisti algerini vanno tutti vaschiacciatti completamente sterminati.Poiche da sempre i finanziamenti terroristici provvengono da quel fottutissimo paese2(qatar)vanno tutti sradicati.Non mi resta altro da dirvi che a presto buon rientro e che Dio vi benedica nobil signor."], ["@paps7121", "lol so bad and colored. the old dw is dead, shame"], ["@user-vr9cv4ii7f", "変なやつらか❤"], ["@lieno1891", "Iam kran k no sk kan nic atbei ten iam so rry  ian oh thank smuch"], ["@HornFurrman", "clean , no flies"], ["@HornFurrman", "Okay I can do that"], ["@HornFurrman", "What is she saying?"], ["@HornFurrman", "I'm with FSB and we're going to stop this right now, you have your kid here"], ["@HornFurrman", "I'm telling you hide your females"], ["@HornFurrman", "it's joever anyway"], ["@HornFurrman", "yes rivella"], ["@pushpinderchhatwal7602", "Do we understand NOW? Americans will continue to stick their collective heads in the  sand."], ["@Hongstar888", "Trump and Putin 👍💪🇷🇺"], ["@DanPainter-xr6ct", "Hopefully we can repair the relationship once Donald J Trump gets re-elected for 47 th president again"], ["@user-rv9iy5ym5o", "The two most pathetic people on the planet.Oh they shall be remembered."], ["@bholasahani7591", "आये है नगमा जीवन के इधर मे तो खिलते हुवे  बहारो से हसी जो एहसास ने मीलाया \n\nसादगी की तर्ज मे आते है तरह खूबी के असर से चाहतो ने खुशी को फरमाया\n\nजो अरमा ने किये रन्ग तो कालिया से जीवन का रन्ग छाया"], ["@michellefalk5825", "2 goats!! we need a strong relationship with Russia honestly,  someone who can be strong  president, it was the quietest 4 years when trump was in.. Russia doesnt want our western influence,, respect it.. 100% they are not into globalization."], ["@mariadorosariodaraujofaria7705", "O Putin com cara de chico esperto e o Trum com cara de parvo."], ["@yeghiajr", "Two KGB agents."], ["@jollyroger8671", "Its not a rumor,  obamas brother is still in Kenya,  and is a school teacher there,  living in a slum. Their is a documentary about it."], ["@mimiperle2858", "❤❤❤❤❤❤❤❤❤longue vie aux amercains blancs"], ["@RodicaMihutArmando", "Russian propaganda really helped Donald Trump too winn the election in 2016."], ["@georgiehollander2199", "If  Trump  was  President  in  2022,   the  WAR  in   Ukraine  would  NEVER  have  happened............"], ["@davidrabtin4909", "Talk about false propaganda. This documentary is classic example of propaganda"], ["@paulguycaspermanzanares9404", "Trump and putin are brothers their agenda is to destroy America's freedom and when they ask the German people after they lost the war why did you supported Hitlers plan they said we didn't know he was going to do that 🤔 😮"], ["@AlamgirHossain-fz2kd", "I am like this you Russian Rus Putin friends all see please"], ["@user-ip4xz9md7w", "Mr.PUTIN IS OLSO NOT NAIV"], ["@user-tt2hj6oo9p", "❤한반도 이남의 만행은 중국과 동일함을 입증❤이전 매쌔지는 모두삭재를 시도하여 수차래 방금처럼 사악항 해위는\nOK = 👍 👌 🙆‍♂️ ❤ ❤ ❤ = 666 = 지옥에서 영원히 안식케 하여 련다 !❤그들은 조아 !\n\n😂트럼프때 그대는 중국같이😅도우려 했으나❤중국 시진핑은❤모든것 얼마나 방해하여❤지금과 같은 결과와 2.022년에 이집트에서 같이 하려는것 문재인의 방해로 현실에 봉착케한 죄인의 주범들❤심판 종료\n\n😂트럼프와 조바이든은😂직계 손녀라도 있는가 !😂하하 하 \n《☆》*♡,각 각1명씩 곁에서\n같이 있게 할수있나 ! \n하루 빨리 온난의 피해도 지장업이하여 만물이 피해받지 안케 하라라 ! = OK =👍 👌 🙆‍♀️ 🆗️ ! 🆒️  !"], ["@adammitchell3462", "It is absolutely insane at how obsessed Russian the people ( even common folk) are with American politics.... absolutely crazy lol"], ["@user-vr9cv4ii7f", "気持ち悪い代物どもだ❤"], ["@user-fg4fr2bz5y", "Two despots unite."], ["@changeibc9599", "Better to see this then Nukes Destroying everything."], ["@kensweetser6901", "If you want peace vote for Trump"], ["@user-hc8kx8vy8m", "Amerika je Amerika!! Tramp je Tramp!! Rusi su ulizice i izdajice!! Ko god da je predsednik u Rusiji o njima nemam lepo misljenje.. Lizu se sa Amerikancima smatraju da su sila kao Amerika a u stvari nisu to su im puste zelje!! Mrzim Ruse!! Amerika br 1!!!"], ["@MuzdhrFadila-vj1yu", "Butin beet"], ["@PawanSingh-lk8uh", "🇮🇳  Christ. 🇺🇸🫲"], ["@MuzdhrFadila-vj1yu", "rump is a thief who stole money, a Saudi country killed crazy men, Reis, Putin 2016, Mafia, Reis, Putin, it was Israel Day 2016"], ["@cheekyme3552", "idiotic googles"], ["@user-fr6xf9lr6h", "יהוה The Name of God is יהוה Amen"], ["@jesus85ize", "You mean real men"], ["@KingGoogie4LX", "🇺🇸 🤝🇷🇺"], ["@TRUMPOFFshorts", "Very good 👍👍👍❤❤❤"], ["@user-hi1ke5gp6n", "вы враги и ваш народ тоже"], ["@MuzdhrFadila-vj1yu", "Vutyn beet"], ["@edblair5253", "Can you do a documentary now on all the people that lied in the Steele dossier and how the vast majority was 100 percent fake. \nPeople went to jail for lying.\nCan you do a documentary on that so you can honestly say you unbiased?"], ["@shirleywoods991", "No two are not eye level ever. Ahh it's the 8. ❤"], ["@markussabogabriel5846", "Bullshit 08/15 Propaganda Trash"], ["@rafiqkatana", ".                                                            *Trump, ...the Poster Child for Moronic Idiocy.*"], ["@besarionioselini2089", "მიაფსით ერთმანეთს\nნაპორით"], ["@edwardkoopmans56", "Typical DW and very very  very SUBJECTIVE as ALLWAYS !"], ["@user-vt8oq6rx2e", "Felicitari asa trebuie sa fie America Presedinte Donald Trumps , iar in Rusia PUTIN ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"], ["@sinalekthe4372", "Ukraine is always super  ? Looser or winner no matter but they fought democracies ways  one step to another they continue to win their democracy war ?"], ["@sinalekthe4372", "Why Donal Trump and Putin are the gods of some countries people ? They have wives and children and they love them even they can't give satisfaction for their country people but can give for other countries . No matter good or bed leader your influence but a leader should have time to enjoy with his or her husbands and wives ?"], ["@user-lb2wi2bj9r", "This aged gold"], ["@littlefatcatx", "There was no collusion, but the men who rule the world collude with God and the Angels. They’ve been doing it for a really long time 😂"], ["@danfromgrimreapergutters2319", "The cutest couple 👨🏼‍❤️‍💋‍👨🏼"], ["@steveadams9289", "Could never stand Obama"], ["@ioanbota9397", "I like this video"], ["@BYTES305", "Lets go Russia 🇷🇺!!!!!!!! Bring america back trump"], ["@literalitera940", "Putin called a midnight meeting and decided .....😂😂😂😂😂"], ["@literalitera940", "Obama IS the origin of  terrorism in all countries usa provide \"help\". Obama, biden, hilary are key american criminals who \"care\" about the whole world. But should better focus on inner american problems the usa is overloaded with!"], ["@literalitera940", "Trump was (is) a better prospect not for Great Russia but for \"democratic\" usa"], ["@arvinderkaur8116", "Hindu People and Khalsa people not doing gentle behave like human being both are working for Charistians I'monly Persian Farasi."], ["@literalitera940", "Hillary ...the favorite...lost😅😅."], ["@Trumpforeever", "Hillary wasnt the favorite thats what the democratic run media said. They control what people hear. Have you seen the picture of her husband wearing a dress that hung at Epstein's home?"], ["@perrycomeau2627", "Death and taxes Donald and Vladimir...."], ["@user-fj3qt5bg1o", "Dumb & dumber."], ["@AlamgirHossain-fz2kd", "America first time you Russia and Ukraine war closing next my like this America"], ["@AlamgirHossain-fz2kd", "Goodbye Russia and world famous man I am not like this America"], ["@sand_d5305", "The real enemy both Trump and Putin is Globalist. \nObama birthright teory is coming from Hilary Clinton in DNC Primary"], ["@bholasahani7591", "जीवन के लिये आया सादगी का रन्ग तो आसा की किरनो मे रहा हसी आलम\n\nचमन की तरह जो सिलसिला रहा तो खाबो के लिये छाया बहारो का सरगम\n\nआसियाना की तरह जो रन्ग खिला तो चाहतो की तरह आया खुशी का सितम"], ["@Somedude54", "Ya just can’t trust the barbarians"], ["@jpk2798", "Waiting for the documentary on Biden's Ukraine and China businesses."], ["@MassMass-po4ws", "Biden pikun diktator war in Ukraine😎"], ["@user-te8hr6qo7g", "Для России  Трамп лучший президент США 🇷🇺❤️🇺🇸"], ["@3m4il", "40:40 crook"], ["@inrisekewael2361", "Goverment"], ["@JohnMoore-jz7be", "Nobody sees it European countries EU countries united against Russia as a international security arrangements interests threat  European unification military cooperation security arrangements interests guarantees I think that African continent Asian continent oriental continent is sees European countries EU powers ganging up on Russia borderlands territories disputes between Russia and Ukraine African countries support Russia Asian countries support Russia oriental continent support Russia rest of the known civilization support Russia not a unified command military cooperation security arrangements interests European countries EU powers ganging up on Russia borderlands territories disputes"], ["@JohnMoore-jz7be", "Putin's playground Bidens war"], ["@mariofurlan3355", "Uguali.😢😂😅"], ["@QuyenNguyenNha-du9xw", "Toi noi joe bi den khong duoc phep qoan he viet nam muon toi gia tay voi ong  toi lam luan tuc cho sem toi la con nguoi nhu the nao nhe"], ["@user-ib6gd4zq2t", "❤😂😂❤"], ["@user-qt7bi4cw6q", "Rubbish"], ["@danreid7411", "Syria, where Russia was attacking the people America was backing..  America is crazy"], ["@Ivan58499", "Real recognises real"], ["@nellieberkelmans1188", "What do people want with criminals"], ["@MSSLatvia", "A war criminal and a traitor = terrorists."], ["@docdee770", "Anybody notice how America's Presidents seem to age but none of the mad dictators seem to age?"], ["@purpracer", "Trump2024. If this video is trying to continue to lie about the elections, I'll be waiting on an apology. It's obvious now that your sources lied and even cheated. Trump was right, M'fer"], ["@rodney5269", "THe deep state are PH UC KED!"], ["@anandhuradhakrishnan4454", "PM PUTIN SIR.❤❤"], ["@mstrprnrgmail431", "trump is unique tho not so much as out his league."], ["@David-up7rv", "I,SA GONA BUILD US,AH A BIG BIG BIG WALL, SO,S WE,S BEE SAFEIE OKIE DOKIE!"], ["@antonychipman3088", "2016 was stolen in Florida"], ["@toddbrackett4277", "Why is DW spreading misinformation about Putin and Trump being partners?\n\nAssad used chemical weapons against civilians shortly after Trump took office.\nTrump destroyed 20% of Assad's Air Force 3 days later.\n\nPutin sent troops to attack US Forces in Syria.\nThe Russian and Syrian attackers got vaporized.\n\nTrump promoted US domestic oil production driving prices below $40/barrel starving Russia of revenues needed to build up its military.\n\nTrump called out Merkel for her energy dependancy on Russia which he called the largest threat to European security and her chronic under investment in defense.\n\nTrump threatened sanctions against companies involved in the Nordsteam pipeline project if it preceeded.\n\nPutin never attempted to execute the second phase of his invasion of Ukraine while Trump was in office.\n\nWhich part of this story suggest that Putin and Trump are friends?"], ["@VickieLentner", "Bless Putin and Trump,they are not Globalists!!"], ["@Mr.Faulkner", "what did you find? nadda.."], ["@albertvasquez5521", "Dumb and dumber"], ["@robertodeguzman6515", "A Psalm for President Trump \n\nDeliver me from my enemies, O my God;\nSet me securely on high away from those who rise up against me.\nDeliver me from those who do iniquity\nAnd save me from men of bloodshed.\nFor behold, they have set an ambush for my life;\nFierce men launch an attack against me,\nNot for my transgression nor for my sin, O Lord,\nFor no guilt of mine, they run and set themselves against me.\nArouse Yourself to help me, and see!\n— Psalm 59:1-4\n\nMy God in His lovingkindness will meet me;\nGod will let me look triumphantly upon my foes.\n— Psalm 59:10\n\nOn account of the sin of their mouth and the words of their lips,\nLet them even be caught in their pride,\nAnd on account of curses and lies which they utter.\n— Psalm 59:12\n\nBut as for me, I shall sing of Your strength;\nYes, I shall joyfully sing of Your lovingkindness in the morning,\nFor You have been my stronghold\nAnd a refuge in the day of my distress.\nO my strength, I will sing praises to You;\nFor God is my stronghold, the God who shows me lovingkindness.\n— Psalm 59:16-17"], ["@rmf9567", "We need Donald Trump back as President Joe Biden is bringing us to the brink of war"], ["@nashrinhossain9267", "Abar"], ["@feliciabosch8110", "So believe it all the President's work together for the good of themselves"], ["@brankosimonovic1558", "Well , USA and Russia friendship will be great idea . It seems you would like war all the time between them ?"], ["@hectoOut", "Yeah the famous American  draft dodger couldn't  help himself  could he?  Look at the body language Putin was an Alpha male and Donald  Trump was a beta dog😂"], ["@arthurlambert6418", "Drumpf & Putin, two autocrats who like Neal & Bobbing each other all night long."], ["@nickalg8", "The pricks guilty.  It’s simple.  He would do it again if he could.  How terrible.  Say no to biden as well."], ["@XY-rh3if", "Could you imagine if Russia and China weren't Super Powers?. They would have become another US victims since they're not aligned with Western Imperialism, White Supremacy and Western nation's use of the dollar as a weapon of economic terrorism, otherwise known as US ECONOMIC SANCTION. It's very imperative that we have many sincere and fair nations that are Super Powers, in order to check the excesses of the United State's selfish, war mongering, bullying, terrorist, rogish, totalitarian and aggressive behavior against defenceless nations worldwide. And this idea seems to be currently  working out for some of the Western Nolonized Nations in Africa, that are getting military support from Russian WAGNER Forces in against Western Imperialists"], ["@Leontiger112", "This is Real US President Trump and Russian President Putin tie up for working Peace on Earth! I hope it well Restore Again"], ["@Aussiematee", "Trump 2024 baby!!!"], ["@rakeshkapoor8380", "strategy directiv"], ["@EMINEMAFTERMATH313", "TRUMP 2024 🇺🇸"], ["@michaelmarschiert6184", "❤❤❤❤"], ["@arvidbeuchert4012", "I wonder when the two are getting married"], ["@allydlovesherdogs", "Russia Russia collusion. Turned out to be ALL LIES, how embarrassing for these so called journalists. 🤡🤡🤡"], ["@lowiemaalderink9858", "Wow lots of russian trolls here. The whole documentary misses the fact that Russia is a failed mafia state"], ["@krishnarajbastola50", "Krishna Raj bastola ❤😊 like"], ["@rizzorizzo2311", "I just wish Putin would release the pee tape. Because we know the pee tape totally does exist."], ["@keithmarshall7084", "Make America great again and the public love it everytime humans never learn"], ["@praneethkarkera", "Seriously doubt whether DW did any research. Pure hogwash of a typicaledia narrative of Russia - Trump fake news. Media didnt learn anything. This damages the reputation of DW"], ["@bengordon7635", "The war against OURSELVES !! WE WE WE ARE TO BLAME AND NO ONE ELSE FOR ALL THE MADNESS  TODAY !   .. both sides have gone crazy ,, woke ,, racist ,,,, to get votes and wealth THATS IT PEOPLE wake up the politician's are there for one reason TOO TAX US ALL EQUALLY  more and more and more to fund the war machine OF DEATH AND Evil ,, soon God will be gone  hmm! 1 out every 10 kids you ask today believe in God ,, what happens when that 1 is gone too ? HMMM  !!  we all see it coming , then all  will be  evil , if we did not need protecting why have a government  HMMMMM,???? ,, black , white , red ,,yellow , WE ALL ARE THE DOOMED ,, 😪😪😪 One day we ALL  will wake at the same time . look out and see the most beautiful red , yellow , purple sky you ever have seen , then a rolling wave of fire THE END"]]