[["@stenwurtz", "When Trump doesn't think Nato countries are buying up military hardware, which is the agreement - he is only partially right. For many years, we have not considered NATO to be particularly important since it was targeted at the USSR, which as we know no longer exists. We should perhaps have seen that Putin has slowly but surely crawled out of the fog after the collapse and represents an even worse regime if possible. Now he must be fought and the USA, which profits from military purchases, can clap their hands, but then you can also reasonably demand that they fulfill their agreement."], ["@ricklocke1187", "Chilling to see his young.  \n son there how’s he going to turn out and we’re going to live in what may well be his world if the old man’s overthrow of the constitution and the rule of law comes true \nAnd there’s more than a couple of hideous before we get to baron (baron trump )the name suits any jackbooted German general of the mid 20th century and I reckon someone around trump knew that would have taken the orange one quite some time"], ["@jimmyw7291", "Hows that your the 1s attacking a free country ie UKRAINE 🇺🇦"], ["@jimmyw7291", "Trump i dont see any reason it would be russia why would u tell on your self"], ["@jimmyw7291", "This russian with backdoor boys hair cut must for got mullar"], ["@jimmyw7291", "This russian with backdoor boys hair cut must for got mueller is a rellydumbagain 😅"], ["@xDATD9UDEx", "Well russia didn't invade ukarine till he was out of office"], ["@Michael_Onder2112", "Trump 2024"], ["@petesong7146", "Trumpers screaming USA all the while Trump is a Russian asset.  Lovely."], ["@W_Bin", "5:02 _\"when the United Nations consistently fails in it's duty to act collectively ... we are compelled to take our own action\"_ \nWas Nikki Hayley aware that  that duty was stymied by American  *_lie_* that Russia has a veto, when it has never even been a member?\nWas Hayley ignorant, or is she lying? \nWhy has she still never mentioned that lie, or that the Kremlin impostors can be removed *_within a week_* by a simple majority (51%) resolution of the UN General Assembly, as was done before to a regime which unlawfully claimed permanent membership of the UN Security Council?"], ["@crystalheart1186", "I’m here after the death of Alexei..."], ["@nordicgaming2572", "Make russia great again.. Speaking as if they were ever great to begin with"], ["@USER-jo7yz", "Two strong men manipulate the public with personal ambitions and ambiguous politics. Putin is the winner of the chess game. The American presidents were weak, inefficient, and contradicting in their policies in front of evils like Russia, Iran, and N. Korea. Today, Biden wrongly interferes with Israeli strategy against Hamas instead of hitting Hezbollah for its aggression."], ["@kevinneblett6749", "The only way to move forward is to put the real winner of the 2016 election in the white house with 8 years guarantee"], ["@kevinneblett6749", "If he can sell enough shoes he can hide away all the Obama boxes"], ["@roubikkhodabakhsh-ur4ot", "پوتین شما میگین من بایدن را تایید"], ["@annielynebron5778", "God afternoun po sa inyong lahat jan sa amireca po maraming salamat sa lahat yong pag tiwala nyopo sa akin hat yong pag soporta nyopo sa akin maraming maraming salamat salahat sa inyong lahat jan god bless po ty.."], ["@Muanafanai-vg2pl", "Trump haters says that Trump is soft on Russia n Putin played him they criticize Trump saying he is outsmart by Putin n Russia benefit more under Trump but da reality is Trump was tough on Russia more than Obama was its not just about talking n dissin Putin on interviews n on wax its all about their actions plus like Trump said getting along with Russia is better than having a bad relationship with them coz the world is more peaceful when Russia n the US gets along as they are the 2 Superpower as their actions doesn't only impact the 2 nations but the whole world... Trump2024 4 The World n im not even American.."], ["@siekieraltmlodafoka", "Trump aim is to make Ruzzia Great  🎉 Willingly or not, hard to tell in that case 🤡"], ["@peggydeforest2882", "Good Lord, she talks like  the hyena.  Says three words, then pauses, then 4 words, pause. My ears refuse to listen."], ["@user-nb7ec5wk8v", "Putin and Trumph are like Hitler's. Total materialists with hearts and minds full of lust, power and greed. \nThey have both swindled the people of their countries.\nSlava Ukraine and Democracy and freedom."], ["@user-rz4uu6ve1i", "Lets hope they are friends"], ["@gibbyteam1", "another anti trump campain  lets see how much  money joe biden got   out of these countrys"], ["@tinieblasabismos9859", "_favorire words of trump: \"wood\" and \"wooden\", lmao. obama calls it; \"breath of experience\" lol. 🎃_"], ["@Steve-cs7pq", "Hood ppeople don't: re-elect into the distant future a murdering butcher. Kidnap 10,000 children. Target civilians with shelling daily. Sure Russia needs an all weather seaport. Buy,rent, give a commission. Don't murder and distroy a society. Good folks stand up"], ["@kathleenroberts6931", "No! Combover Crapigula had his A.G. Bill Barr lied about the Mueller report. 😡"], ["@mauroger86", "The US intervened EVERY presidential election and government on earth. When a docu about that? ;)"], ["@ladeluff_", "someone says TNX DW for this oustabding work. and stil lto this day.....no1 documentary creator on this platform"], ["@davedanny9053", "😮Who is THIS\nOLD WOMAD A WITVH😅"], ["@davedanny9053", "AMERICA SATAN FOR WARS 😅😮"], ["@I.AM.JUPITER", "19:12 this, this right here, regardless, if I’m for Trump or against Trump. This was an embarrassment."], ["@billmcg1676", "Your documentaries really remind me of Frontline in the USA. Very well done."], ["@raymondaustrie7465", "The irony of ironies is that while Biden is paying the political price ,the real threat to America 's security and pros perity Donald Trump is getting  a  free pass. It's amazing how  malevolent characters have easily upended reality throughour the sordid tale of human history with terible consequencies for all of humanity!!!"], ["@coleenfottrell4102", "Typical media lies and propaganda. No one trusts you anymore."], ["@shibeshi2637", "The greatest mistake of Trump was to choose this '' trojan horse'' woman called Nikki Haley as member of his ruling body."], ["@user-zl3xs1cf8x", "Booooo to Nikki."], ["@user-pf6sh3ej1f", "Why did Biden mess up"], ["@inmyopinion6836", "KING of the POSs of the world!!!!!!!!!!!!!!!!!!!!!!!!"], ["@user-rf9vk3xq7h", "It's actually insane how arrogant and full of themselves are those top russian diplomats. A true superpower in the making, LMFAO"], ["@michaelillingworth6433", "Lovers."], ["@tangsten", "Its a good thing watching this documentary this 2024, seeing how far president Biden has taken the world. \n\nThe world was better and peaceful under Trump compared to Biden."], ["@irenekoskei4921", "😅😅😅😅😅😅😅😅😅..................,"], ["@thembastoep733", "American presidents do not have power"], ["@harrytopia282", "They just swar in the biggest lying cheating theiving fraudster in the history of America."], ["@user-jg3jo5ry9y", "It is sad the world is laughing at the U S A😊"], ["@carollever4662", "President Putin cares for all his citizens which is how countries become great and stay strong. 🎉"], ["@JohnCamery", "This is propaganda and disinformation trying to subvert and America and its Constitution m.  This is a propaganda narrative fabricated by British Intelligence."], ["@papi5377", "Naprawdę?😂😂😂😂"], ["@bossbaskaran1944", "The USA crooked country and Russian and Russian president Mr Purin is a great man.... The USA killed people all over the world....but Russia is not... Russia focuses only on their own business...."], ["@agustianingsih-hb7di", "Only block,i am give your choice a good, because too many yours have violtion with me in the earth me, still hold life licked anything from earth me"], ["@user-zg9np9uy9f", "P😊0p000pp"], ["@gloknor", "Disinformation much? It is clear this is a leftist media outlet."], ["@user-fl2xd5uf7s", "Трамп ✔️"], ["@borcemiovski", "And now we know Russia trump thing was bull said by independent commission even Jack tapper CNN apologized😅😅😅"], ["@nickmartin9247", "Truly insane number of ads (every 3-4 minutes)."], ["@enkilm", "Mueller found Russian collusion in 2016 and if it weren’t for Trump’s Attorney General pre-meting Mueller’s announcement,the world would have known about it same goes about the ☎️ with Ukraine!"], ["@HifumiShimizu", "why I cannot America be friends with Russia is that a bad thing"], ["@HifumiShimizu", "I believe that the president of the United States and Russia president could be great friends"], ["@JeffreyPullen-lp4oe", "The big bad wolf could have his sheep for a second time 😂"], ["@JeffreyPullen-lp4oe", "So many sheep 😂"], ["@pynzlyngdohnonglait6698", "I like Trump a lot.... Putin like Trump a lot"], ["@Dublinireland5", "As much as I like Donald Trump he should have lifted the sanctions against Russia, and America should have formed a new special relationship with Russia Mr putin.. America and Russia stood side by side in World War Two against Germany and that cannot be forgotten..."], ["@HuntsDown", "Peoples ability to misunderstand everything about all of this is still so infuriating to me.\n\nI will never get over how stupid the average person is."], ["@omarmaxwell6971", "amen"], ["@KA-bv7zg", "Deal on how \" the rest of the world \" will live UNDER LAW ,LAW of their Father in Heaven Jesus Christ."], ["@ronsmith1429", "Putin looks like he is hot for Trump. What do you think?"], ["@glenroyfraser104", "Pressident.   Putin.    Is.   Much   amart.    Than.    Donald    trump"], ["@user-uq9dh9zf8d", "😅😅😅😅😅😅"], ["@scubemariononovsky-tb8js", "I AYE DROPPED OUT ON BEAUTIFUL Gl Jane snatches a 10$ from inside an old lady purse her C.O.I.N. BAG"], ["@jameswilson1363", "Bromance ? Really? More like boss and underling. putin told trump to bomb the airbase. putin was and is his boss buddy, not buddy buddy, as you put it."], ["@kasingalikoro7840", "This looks like president in Russia is more powerful, while in USA, the president is controlled"], ["@allancrow134", "Russia is a vast country with vast human(cultural) and natural resources.  I don't understand Putin's lust for imperial power, Russia was already a great country,  now diminished by its violent spectacle of destruction and oppression of Ukraine, their former brethren in the crusade against fascism.  Putin's treatment of his neighbours,  Russia's citizens,  and his own military will be a stain on Russian history for millennia.  Too bad he is incapable of realizing that.  As for Trump, he's a wannabe dictator and belongs in prison.  These two men are incapable of serving humanity,"], ["@somethingtodownloadvideos156", "you need to make a new video about trumps views on russias war in ukriane"], ["@somethingtodownloadvideos156", "you need to make a new video about trumps views on russias war in ukriane"], ["@sh1nyarm0r", "There is a lot of unsubstantiated proposition."], ["@philippeleban3487", "It’s obvious this is a hot piece as was the wests decision to force the Ukraine war.  Grow a pair and do some real reporting"], ["@janeknight5070", "Trump said Russia if you can find Hillary 3,000 missing e-mails upyou will be greatly rewarded by the press. How about that 3 hrs later bingo Russia came through."], ["@janeknight5070", "Actually Bill Barr edited the report. There was 10 counts of obstruction from Trump. Mueller ask Barr to tell the truth he didn’t so  Mueller had his own press conference.He said the Russians did interfere. He had about 12 or more Russians in jail. One lady got away. Paul manafort was working with the Russians. He went to jail. Trump pardon him."], ["@user-sb9vw4ys1z", "Trump is a Russian agent"], ["@denzelwilliams8573", "Honestly when trump became president. He really thought he was going to rebuild America and do good things. But Putin told him how corrupt our government was and trump found the truth out and they impeach him"], ["@zotax1723", "Pretty one sided film, however good made"], ["@user-gd4wt6oi7y", "'Nikki' in Punjabi means 'little' when are leaderships Governments going to work,? they are busy chopping each other's balls, not let each other work that is truth of your Democracy and political lobbies funding their candidates and destroying each other, disgusting."], ["@user-gd4wt6oi7y", "look at Russian opulence in gold chambers..."], ["@hansmarheim7620", "The only real question is this: Did vlad and don engage in homosexual behavioire? What about those \"golden. Showers\"? What else could make them bond so tightly?"], ["@DahirXashi-er1mz", "My famele  athare,s"], ["@juanabosch7827", "TRUMP  Y PUTIN  DOS GRANDE LEYENDA MUNDIALES....."], ["@bholasahani7591", "जो सादगी की तरह छाया कालिया का आकार तो खिलते हुवे रहा हसी का करम \n\nजो मिलतें है अर्मानो का रन्ग तो खाबो के लिये छाया चाहतो का आलम\n\n\nकुछ रन्ग  सादगी से  मिलकर तो इरादा के फेरा मे छाया जितने अरमा से खुशी का एहम"], ["@WesleyPorter-bu6tz", "Mr trump's know,s about the notrized statement and Mr Obama too.  And these people said Thay planned it fomy 41  birth-day and I'm 42 know."], ["@WesleyPorter-bu6tz", "For the guy in blue shirt and tie. Confidential and that pony tail guy is a gange member."], ["@WesleyPorter-bu6tz", "Thay were making me walk too the casino and I stopped two sit for a min\n And then  a guy walk by and said that he left 10-12 underneath a leaf which wasn,t there, after I left the casino thay made it storm on purpose, Thay murder my dog lines Thay called it Irish mob anitiation, and Thay said thay were doing gang anitiation in Tulsa Oklahoma, this after noon Thay said we will half too make him a gang member."], ["@WesleyPorter-bu6tz", "I don,t believe in false wittiness ing and Thay are not taking too ga to pick up a rattle snake in a church. Thay even had them in the city limits, too you can here the rattling sound Daddy."], ["@bryankstutts", "I love this man ❤❤❤"], ["@rosika4911", "Unď,wieviele brutale  Kriege hat die USA gemacht?? Das hat die Frau Vergessen zum zeigen!!  Besonders die Demokraten! Trump wurde verboten mit Russland gute Kontakten zu haben! Aber diesmal klappt es vielleicht! 👎👎👎👎"], ["@nancywallace4048", "I have to wonder why the narrative is presenting the Trump-Kremlin alliance as something that developed through his nomination to President. I've read a great deal of evidence that he was groomed for decades, through kompromat, money laundering and financial entanglements. And why present a loyal professional liar from the Duma to keep weighing in as though he were a legitimate contributor to the discussion?"], ["@NazreWallace", "Who new popular Tent own north carolina"], ["@bereal6590", "Putin and Ping are dictators just like half of the world. We must always fight for and protect democracy. Putin doesn't win elections!!"], ["@pushpinderchhatwal7602", "Which do you all lovers of them prefer ? FOOTIN or DUMP?"], ["@Arcenia13", "Thanks for your report DW!  \nAs always—->impressive"], ["@terrenceperkins5282", "Blacks love trump too ."], ["@BYTES305", "Lets go russia 🇷🇺"], ["@user-tr6vg9jp1b", "Кто в лес кто по дрова."], ["@kovadokic2591", "Staaje to Putine cujem  natvit  dasitiro oda😢srbena🎉🎉trebaba kosovu dapola plati poladapobiju .hvalapuno"], ["@user-fj3qt5bg1o", "But buddies."], ["@ikwuegbubright4188", "Respect and together will never fail stay blessed and protected"], ["@Zeke316", "Russia want U.S. democracy to fail."], ["@3m4il", "Washington DC put Trump through hell. And he's still standing strong. The man is incredible."], ["@Somedude54", "2 crooks 2 dictators Putin helped trump get in now trump owes the little grub bloody disgrace"], ["@dales8234", "Open letter to President Joe Biden,\nI am writing to express my deep concerns about the current state of affairs in our country and the potential threat to our democratic values. It is disheartening to witness some Republicans openly expressing their desire for an authoritarian dictator to rule the United States.\n\nWhile I understand that political power can shift between parties, it is alarming to think that in the coming years, Republicans may regain control of the White House. The prospect of a Republican administration, regardless of whether it includes former President Trump, raises concerns about the future of our social programs, especially Social Security and Medicare. Additionally, the notion of pardoning those involved in the insurrection against our nation is troubling.\n\nThey are hurting the American people by threatening again to shut down the government in order to force the taking of American rights away from the people.\n\nIt feels overwhelming and discouraging when congressional Republicans continually obstruct voting rights and advocate for an authoritarian form of governance. It is difficult to see a way forward that ensures the preservation of our democratic values and equal participation for all citizens. In light of these challenges, I find myself questioning what steps we can take to prevent the erosion of our freedoms and avoid living under an authoritarian dictatorship.\n\nHowever, I firmly believe in the spirit of Patrick Henry's words, \"Give me liberty or give me death.\" While I understand the sentiment behind those powerful words, I argue that there are alternative paths that do not involve such extreme choices. Rather than accepting a dictatorial regime, it is crucial for us to engage in open dialogue, promote democratic principles, and actively participate in safeguarding our rights. Together, we must work towards preserving our democracy and ensuring that our government represents the will of the people.\n\nI trust that your administration is committed to upholding democratic values, protecting voting rights, and fostering an inclusive society. As a concerned citizen, I urge you to continue your efforts in championing accountability, transparency, and unity.\n\nThank you for your time and consideration. May we find the strength and determination to safeguard our democratic ideals."], ["@shekar122", "29:00 The Syrian Democratic Forces (SDF) supported by US had won is absolutely not true ...Russia supported the SDF and attacked ISIS heavily which turned the game for Assad regime... Finally Syria, Russia and Iran collectively defeated isis... America on the other hand is the creator of isis, funded civil war in syria and almost destroyed Syrian nation..."], ["@observer7418", "GOP and NRA had lots of ties with Russians. Trump has had close ties with Russian mobsters since the 80's. His two wives were from former Soviet blocks!  How does nobody notice this?!"], ["@voodoo7953", "Trump is under Putin spell, dangerous for America"], ["@user-cy3fy6pe8b", "Pence 🟥"], ["@robertvarga9843", "That's unbelievable he can repeat the words 🎉🎉🎉🎉🎉"], ["@mariolamoson8152", "Najpiękniejsza najmądrzejsza najpotężniejsza kobieto Ameryki pani doktor Gosiu Świat żono doktora Wojciecha Dyzmy opowiedz świadkom jaką mam zarazę gdzie z kim kiedy byłam  to. gdzie jest wasz spadek pieniądze i wasze dzieci bo jakoś sobie tego ograniczona naiwna brudna głupia chora Mariolcia przypomnieć nie może"], ["@PeterSzpiriev", "Usa shoukd nof say there things not there re own onterrsts, (they dont have known eledel at these therritory)"], ["@PeterSzpiriev", "RUSSIAN see quite are6 ssinukar6 Russua is much stronger."], ["@tominnis8353", "Two shrivelled peas in a sugar coated pod."], ["@russellearley4442", "Russia and Trump colluded and stole the election from Hillary. Trump the biggest threat to our democracy."], ["@russellearley4442", "Trump a traitor"], ["@russellearley4442", "Stinking disgrace!  Trump licked Putins boots. Trump good for Russia and they hope that liar wins. It's time to lock that p.o.s up. He's not fit for anything."], ["@cujoe4842", "I’m a American democrat I must say we had a great relationship with Russia"], ["@iandawe948", "Trump is just like a tesla. Wherever he goes he ends up getting charged"], ["@anandhuradhakrishnan4454", "❤️❤️❤️"], ["@juhyokang2571", "ㅡㆍ《마음/心》//  공심(空心)ㅡ공허(空虛)ㅡ허심(虛心)ㅡ혀령(虛靈)ㅡ(마음/(心) )ㅡ\n좌뇌지성(座腦之性) ㅡ우뇌지신(右腦之神)ㅡ앰(性+神)ㆍ《앰》이란ㆍ전뇌본인간(全腦本人間) 으로서  《자아완성/自我完成》ㅡ\n《자아실현/自我實現》 ㅡ《인간완성/\n人間完成》ㅡ《성인경지/聖人境持》ㅡ\n《천인합일/天人合一》ㅡ《천지동근/\n天地同根》ㅡ《만물일체/萬物一切》ㅡ\n《심신일여/心身一如》가  》일체유심\n조창조화세계/一切唯心造創造化世界》\n가 된다 ㆍ\n\nㅡ마음이란 ㆍ본질성은 고요하고 정(停)함에그 근본의  바탕질이 더러나\n오며ㆍ이것을 마음의  본질성의 바탕\n이  되너니라ㆍ인간이 활동하는 시기는  그 마음의  본질성이  고요하고 정함이  없으므로 더러나거나 바탕에서  햐나의 유기체적인  상호작용성을 견지하게 된다 ㆍ우리가 단전호흡을 통해서  고요함이 도달할때을 참선(眞善)에 해당합니다ㆍ인간은 《사단(四端)》ㅡ《우주대자연》ㅡ《만유만물/萬有萬物》ㅡ《만선지원/만善之原》ㅡ《생물지본/生物之本》ㅡ《사물지본/事物之本》ㅡ《형성지색/形成之色》ㅡ\n《사물지물/事物之物》ㅡ《사물생성/事物生成》ㅡ《사물발전/事物發展》ㅡ《사물소멸/事物消滅》의 \n 우주대이법에  의거하여 순환작용\n으로 이어진다 ㆍ\n\n즉  이를 우주이법ㅡ자연이법은  하늘의  일기순환작용으로   생성ㅡ발전ㅡ소멸의  주기적 작용성으로 이어지게 된다는 논리이다ㆍ이를 지구의  바이오 리듬 이라고 정의한다 ㆍ\n\n\n\nㅡ《도통군자올림》ㅡ\n\n."], ["@captainpedros4323", "What a soft interpretation of what happened."], ["@jlevenson1745", "Two peas in a pod, that was Trump's first mistake."], ["@feliciabosch8110", "These guys are foolish its all about power and money doing the devil's work"], ["@blaneharrison6341", "I'd rather have mr putan than mr Biden or uncle Donald 😂"], ["@dougconry8106", "At the end the guy says you shouldn’t overstate the significance of the US but yet Russia blames the US for every single thing that happens in the world and Russia blames the US for the endless failing of Russia, that’s dam funny, can’t have it both ways"], ["@EMINEMAFTERMATH313", "TRUMP 2024 🇺🇸"], ["@allydlovesherdogs", "Rusia Rusia collusion. Turned out to be ALL LIES, how embarrassing for these so called journalists. 🤡🤡🤡"], ["@jannmutube", "---- >  @ 14: 35 - 14: 56,  Russia's nuclear arsenal and its threats  are its offer of good faith intent....  duh"], ["@ernielitz1771", "Trump = danger"], ["@amandab.recondwith8006", "They're all TRAITORS! I wonder if any of them have read enough history to know the story of Nathan Hale?"], ["@mattwest5403", "How America has fallen letting someone who committed treason run again for president.... Shameful"], ["@monolith9832", "@5:54 Dam those glasses are futuristic."], ["@BurakOzisik15", "I guess you are married with children Ivanka, if wasn't you could be my sunshine 😊"], ["@vilmaimperial4807", "Watched Trump on tube channel title Ad's called Trump/Russia.  He made a strong say was is \" Politicians are all just talks \" wasn't he himself a Politician i made a comment which i think allows as a citizen of one asian country who somewhat learnt from news too not as news not about delivering good life for people who people cant do for country but people who they given on reel news has understands about the government and people who gives good offer for people and we as the world has life to exist saves by the far side people who cant left out the country on people cannot do for country.  My comment i served is more of how were been in country and the saviour the world sent is does exist in word of phylosophy perhaps i analysed it with not perfect english but quite a bit right of meaning like the  victory is not the people and democracy served and won of one best and the stand still is the good work of whole from far side of society that have built love and has souls love for countries they lives life  everydays and nights with Intergrity the world of art more than the law and rules for nations it exist in History of History."], ["@megatoxa", "putin/trump good job!"], ["@GenovevaShryock-wt4tr", "You will be the president e of the  u state"], ["@Teddy-mb4ef", "Why is it so hard for russia to live in peace and get along with the rest of the orders"], ["@twylamiller6206", "He had rigged it."], ["@olenaolenaolena", "why only russians comment events in this film?"], ["@arthernandez5092", "They both look cute."], ["@PRIME_MINISTER_OF_DN", "Honestly its a shame Russia is such a good ally to have at you're back."], ["@andrewlyew3070", "The KGB dropped the ball on this one this should have never happen it makes Russia look weak ."], ["@michellegutierrez2119", "Divide & Conquer ,Putins agenda  for full “Power and Control “ his agenda for the rest of the world 🌍 especially,now with BRICKS, and the new governments ; One world Religion ."], ["@adalbert74", "...but the russian are mohr agressiv to bulid mehr profit!! Its unbelivable that russian delivert own troops to slaughter!!"], ["@MC-dn3of", "What are those stupid orange glasses all about?"], ["@PeterHanson-nz6wu", "DW is blatantly anti Russian, this is not \"impartial journalism\", this is pure anti Russian indoctrination. Your journalists and editors are even worse than the cesspit BBC. You should be ashamed to even call yourselves journalists, it is utter ultra pro EU/NATO garbage.\r\nDid your channel report about Kiev shelling the Donbass for 8 long years, 2014 - 2021?? No you completely ignored that news, such hypocrisy."], ["@somaghosh2960", "An amazing documentary✨."], ["@lezbarker2673", "Fake news. President Trump is the greatest president ever"], ["@hangcarol5010", "A brilliant documentary!"], ["@mikeveis2395", "Trump and Putin are buddy buddies."], ["@mikeveis2395", "Trump and Putin sitting in a tree k-i-s-s-i-n-g."], ["@nicolasrose3064", "The expression on Putin's face as he listens to Trump sing his praises and stroke his ego, just says :\"You utter imbicile, I am going to pull your pants down and you are going to help me do it as you look back over your shoulder smiling at me..\""], ["@tjbtamil3040", "☺️👍🏻🥰love you all"], ["@deborahdarling1799", "I am not sure who I disrespect most, putin or trump. Both are charlatans and thugs, wanting only power & yes men around them. Putin may be guilty of extensive war crimes against humanity. Trump tried to kill my Country’s Constitution while promoting chaos & violence. \nEither shouldn’t lead a responsible nation because both have ulterior motives. \nNo, I am not sure who I disrespect most; both are monsters."], ["@tinydriege7218", "nauseous how those two continue to deny that there was no cooperation lie finger thick on one is already a big liar than the other truth always come to light sooner or later"], ["@henrikarboejensen812", "The pro.The universal bully codex is led by Trump and Putin. It resembles everyday life to perform on the job. The success they portrayed is what many want, and thus led many into becoming bullies,  to achieve the same. The con is evident.Ukraine civilians."], ["@dinosmexis7643", "He's out of the blue, dangerous, friendly with dictators and on the top of that he has no role to be leader of us.. he's just a business man.. nothing more.."], ["@BorisTheSpyder", "Trump was and is a Russian Asset !!!"], ["@24spectre", "its all about money and power."], ["@jesuscastillo3335", "Everyone that hates Trump has pointed out that the Russians helped him get elected, (  Bolony ! ). Where does it says that Putin liking Trump and vice versa is a crime? Trump is the 1st President that was condemned for not starting out his presidency at war with Putin, unlike the old man that's President now, has  given millions of dollars in armament  to Ukraine, for a war that has nothing to do with the USA, and from where did he get that money?  This old man rather helped another country, look good than his own people here in the USA. I am not sating I like Putin or condemning either for liking each other, I personally don't agree with everything trump has said and done but if you line him  with all his  predecessors , the man is almost a Saint. The reason he is hated so in Washington, is because like John Kennedy  , Reagan and Lincoln, they could not controlled him , that's why Reagan almost ran the same luck as Kennedy and Lincoln, but he survived.  This is my only fear , that history will repeat itself again with Trump. But, so far everything bad that has been said about Trump, or  done vs. Trump, has sooner or later worked in his favor , Not once, but twice the demos tried to impeached him all the ay, but failed, the deos just can't figure out a way to  stop Trump, and they never will, because this man is protected by God, amen."], ["@DivineMisterAdVentures", "Walding is a blockhead."], ["@soultaker818", "HE IS PROUD OF BEING A MACIAVELLIST , an perpetrators of convictions , arguments are senseless\nin cold war russia was the nummer 1 in blackmailing foreign politicians with underaged prostitutes , its fact"], ["@uncleTee2023", "It's a pity Trump was forced to capitulate by the deep state....the one that really runs the American government. US presidents are just lousy figureheads. Special interest groups and cartels run Congress and the White House"], ["@uncleTee2023", "The US deep state (the Swamp) is war mongering and will never allow for peace with Russia. It needs a permanent enemy"], ["@shamimhuq2134", "We want Trump We want Trump !!!"], ["@shamimhuq2134", "I am voting for Trump."], ["@shamimhuq2134", "Trump faced Covid that hurt him."], ["@shamimhuq2134", "Trump Trump Trump - I am voting for Trump !!!"], ["@shamimhuq2134", "We want Trump - Trump for the next President."], ["@shamimhuq2134", "Trump can and should be re-elected. Biden and Son are not good for US Presidency."], ["@mariaryan9298", "putin-- his boss. trump--his errand boy"], ["@robiny.4395", "This is heartbreaking as everything would have been so much better for all of our countries if the CIA, FBI and the evil Globalists would have stayed out of all our lives."], ["@mariacapobianco788", "He is not human  vote blue out Trump and Republican party"], ["@rudolfohisena1836", "Trump and Putin two special lovers."], ["@lesliefrank2266", "The day dump became president was the darkest day this country has ever seen"], ["@knightress5760", "Look at the love and admiration in Putin's eyes. Omg!"], ["@rickacevedo7050", "Trump and Maga is the worst and most embarrassing times of the century for America."], ["@dhirendrabahadurbista", "Trump is a fool ,gone in history of US presidents."], ["@kevoutjones5739", "No it's not Donald TRAMP trump you are a traitor and spy don't try to be anything else just confess you traitor and Russian spy ."], ["@raykrzwda393", "Donald J poopin Trump is no more now he just needs to stop sucking air and all will be happy.  😃"], ["@raykrzwda393", "Poopins military looks like he got them at a yard sale."], ["@carollandon3083", "Putin's bestie. And you still think this is ok?"], ["@jackobean3962", "even 'young Donald' looked as though he wanted to vomit, listening to Trump's posturing humbug'. Whenever asking abut Trump's connection to Russia and Putin Jinping and Un...\nis to massage his ego and secondly to set the stage for real property deals an a dynasty in USA. \n\nBeing  sociopaths neither Trump nor Putin have sensitive 'positive'  human emotions nor do they have consciences of their own. They dictate, as a fence around themselves, \nhow other people's consciences should have controlled them. Trup and Putin specialise intransference. The both have 'deviation' personalities. Those detour questions and actions \naway from uncovering facts and end up as accusations aganst the interviewer...it's a modification of rhetoric. Putin is light years ahead of Trump in analysis of history and strategy.\n\nBoth have long history of criminal behaviour and conspiracy. We should be seeking friendships rather even than diplomacy. Friendship however involves  honesty and consideration\nOn that basis none of the so called 'leaders' of every nation...perhaps with the present exclusion of  Albanese and Johnson...would comply. As long as narcissists, psychopaths, egomaniacs and sociopaths are put forward as 'leaders, we will live in fear....and what you fear you cannot love."], ["@raykrzwda393", "Can you imagine how things would change for the better if the hearts of Fat Donny Little Rocket man and Poopin would all stop beating at the same time and day ???"], ["@raykrzwda393", "76% because if the Russians didn't vote for Poopin they'd be killed by Poopin."], ["@DDCrp", "Self absorption all round the world... Man.. and it's incentivized"], ["@anushkasekkingstad1300", "Trump and his highly dysfunctional family are emotional cripples."], ["@roberts3423", "Where is the documentary on the current administration?"], ["@angiebear8727", "I’d love a part 3 with all that has happened since and is happening currently. Excellent job. Should be required viewing by all Americans.\n\nI see any blips in our relationship with Russia during the trump administration as a coordinated effort to put down allegations. It seems that trump has been working for(even though his narcissistic mind sees it as with) Putin since at least 2014. Scary stuff, especially when top secret documents were stolen by trump and dozens are missing from folders. It continues to boggle my mind that Trump was able to fire Comey while he was leading an investigation into him. This man can never be allowed to lead again and should be in prison with no access to social media or the press. He is a clear and present danger to us all."], ["@germancamacho3944", "Trump and Putin are evildoers, but democracy will survived  from the will of the free world, communism  had been a poison for too many country like Cuba \nNorth Korea, Maduro communist associate with Russia ,and Cuba and now trump autocrat wannabe"], ["@nowujaloofficial5897", "“I don’t see any reason why it would be” he’s saying that to imply that he isn’t the reason why they would’ve mettled in the election..it’s a Freudian slip..he’s subconsciously trying to distance himself from the fact that them meddling had impacted his chances of him..his ego is so frail that he couldn’t help himself"], ["@rickhensen3278", "Again - why did they leave out the JOURNALIST SPOKEN DIRECT QUESTION to trump - who do you believe;   U.S. intelligence or putin - the uproar was, trump believed putin - putin had a smile like the cat who swallowed the canary.  Let's make russia great again.  I enjoy DW videos,  but there are a lot of holes in this one."], ["@rickhensen3278", "what they fail to mention here at putins re-election is the stuffed ballot boxes before the doors even opened , erasable ink etc.  Lets tell the whole story (or do we have putin lovers here)  resulting in massive protests."], ["@corryjookit7818", "Perhaps the meeting was recorded?  That wouldn't have been hard to do. A concealed recording device ? Putin's instructions for Trump. ?"], ["@tiehoteele874", "There's no good guys here they are all the same, they want money and power, talking about Assad as if you want to be a hero when we know you will benefit from any war or civil unrest...."], ["@edwardtorres1117", "God will judge you before his great white throne. May be the lord be for you if not against you."], ["@edrenaking2110", "I don't know beautiful  people"], ["@edrenaking2110", "Let me watch HLD SCARY PEOPLE"], ["@edrenaking2110", "My name is Edrena  king, I was born by Annie King at Shands teaching hospital me and Eddie King jr. So what I need help"], ["@edrenaking2110", "What is my family history please, father God I see this."], ["@edrenaking2110", "I paid my cell phone metro t-mobile on archer road, I ride on RTS  russia"], ["@edrenaking2110", "The king family and kong"], ["@edrenaking2110", "We need help the kings"], ["@edrenaking2110", "And done"], ["@edrenaking2110", "My daughter's from Edriena  king"], ["@edrenaking2110", "Ebony, tequilla,  Ashley, jakayla"], ["@edrenaking2110", "Sorry for bad spelling"], ["@edrenaking2110", "Please  I tell father God too help, but they got them trap I don't care who's mad I'm mad now what"], ["@edrenaking2110", "Can I live somewhere  else and get an education  that I need right now I smell like a dog  that got fleas on him"], ["@neilstamper4375", "Allegations contain truth."], ["@rodrigosale7058", "Putin never attempted to irritate Pres Trump after he experienced a decisive action against Syria when the latter used nerve gas bomb. Putin was afraid of Trump."], ["@daynedosher3658", "Thanks Russia for helping us get the best President we ever had."], ["@denzilrobinson2666", "This is hardcore proof that USA wants war murder killings when a great wonderful president Donald trump is getting scrutinized for being friends with president Putin that is proof that America has I'll and dirty bad filthy intentions for the whole entire world"], ["@Aman0606", "I think some one is afraid 😱 alot"], ["@dannyburch4973", "Every man women an child lives under a nuclear sort of Damocles capable of being cut at any moment by miscalculation or by madness the weapons of War must be abolished before they abolish us J.F.K."], ["@darellsmith5254", "In"], ["@scottholley9939", "They call me this is what happens when you lie now we're many years later Biden's got the house place is falling apart and your lies are still coming up behind you is speaking up and you got Putin pissed off at it now because of your lies I just say this this is what happens when you lie it always has a tendency to come around and bite you write Square we don't want to bite you I hope you get what's coming to you soon I'm happy I think all of us are but I'm really happy I knew the truth a long time ago just nobody else is listening"], ["@ikwuegbubright4188", "Respect"], ["@ikwuegbubright4188", "Respect"], ["@may_laytrucker3127", "What 76 percent of winning his election,it was all prestamped vote cards by he's agents , no surprised Putin would interfere with us elections,just normal for Putin,but now road come to the end for,no way out for Putin...!!!"], ["@cordeliahoran2507", "What an embarrassment to Americans who's eyes we're wide open to crooked Trump. These people chose to ignore all the horrors & illegal activity that Trump has always been makes me sick to my stomach. He's done so much damage to the citizens of our country that will take decades to repair. These blind fool Trump supporters are just as blind 1/2 a decade later. How?"], ["@gedisteve124", "Donald the American traitor. a"], ["@karrithebestlira3085", "The Mueller report was a limited investigation , limited by the investigatee."], ["@karrithebestlira3085", "Trump is a toxic cesspool in human form."], ["@karrithebestlira3085", "One hand reaches for the nuclear button, who in the last 2 months has threatened nuclear strikes on a weekly basis. Putin"], ["@karrithebestlira3085", "Trump: we fight for the furniture and the future..........."], ["@karrithebestlira3085", "Come on,  Manafort clearly was the link between Russia And the Trump campaign"], ["@cydoman8014", "Trump was useful to Putin and Putin played him like a father plays a stupid child. But Trump could not give Putin the fracking technology he wanted.  \n\nUnlike Russia, the American President is a lot more controlled by Congress and the Constitution than Putin.\n\nStill Trump feasted on the idea of himself as the  miraculous President....Until a real problem taking real leadership and real intelligence and real experience came along. Suddenly all the showboating, all the ballyhoo, all the lying meant nothing. Covid said hello to The Donald and The Donald was stuck for an answer.\n\nOnly in America could such a man be elected.  It was the outdated and dangerous Electoral College,  Russia and racial spite that put Trump into office. All three are mistakes we should have avoided. \n\nWhat happened to America's ability to detect a charlatan? What blinding force of nincompoopery controls the thinking of voters who just don't  know the facts but persist in voting for leaders who have no regard for the suffering of citizens? What good did Trump do? Give wealthy people tax breaks? Give wealthy corporations insanely lucrative tax breaks? Come within one vote of repealing the Affordable Care Act - returning us to pre-existing conditions,  being kicked off coverage if you are sick, extraordinary profitability for private for profit insurance companies?\n\nCome on, guys. Trump is a moron. Shun him and his toadies  like the plague."], ["@cydoman8014", "All the time Trump kept saying he had no connections with Russia, he knew about the meeting in Trump Tower. He knew and he was aware that Putin knew also. What did Putin extract from Trump? Will we ever know? Mueller said he could not find evidence of conspiracy. He added he could not investigate the way he needed to in order to find the evidence. AND he added he would have exonerated Trump if he could have, but he couldn't exonerate him.  That left the matter unsettled. Add in what Trump did on January 6th and the picture looks very different, very suspicious, very troubling and Trump looks very guilty."], ["@ralphwebster8318", "Trump , Ukraine, gas, Nord pipeline, Ukraine oligarchs, Putin,"], ["@evanarroyo1384", "Absolutely spectacular documentary. Getting info from great sides of the isle. And most of all, very entertaining. Me and my dad liked it."], ["@titusliddell8400", "Much it hurts so bad\n😍😘😘😚😚😚😚😚☺️☺️"], ["@willtaylor1395", "tRumo and po-Hitler aren't enemies"], ["@silkoakranchpitchforkranch1205", "The thing that separates one man or woman from the other is simply the distance he is willing to\nGo."], ["@silkoakranchpitchforkranch1205", "This is such bullshit. Trump is a patriot Putin is a communist tyrant."], ["@lorrainedaniels2600", "We love you president trump"], ["@ronaldpokatiloff5704", "I am the only one that knows that homo sapiens made our universe because their EARTH was annihilated in a nuclear war. They did this to keep their species alive on the next Earth. Everyone has ignored my warning. I HOPE I AM WRONG!!"], ["@iuriim.....v5153", "Born Leader end of story   Haters  always will    and if  you are  the best  you will have enemies"], ["@nilesaphire8494", "WHAT.   FORMER.  AMBASSADOR.   NIKKI. . HALEY. SHOULD. . HAVE. DONE. IS. CONDEMN. SATANIC. ZIONIST. CORRUPTED  UKRAINE//NATO// ISRAEL.  FOR. ALL. THE. DRUGS/ WEAPONS/  HUMAN/  CHILD. SEX. TRAFFICKING. RINGS.  WHICH. SHE. DIDN'T.!!!     IF. ANYTHING,  DURING. THIS.   WAR  VLADIMIR. PUTIN. BROKE. THIS. SEX. TRAFFICKING RINGS. WIDE. OPEN,  AND.  ALL. THE. PEDOPHILES. FLED. UKRAINE 🇺🇦 ....  BRAVO. VLADIMIR. PUTIN!!!!    NOW,  WAS. NIKKI. HALEY,  A. SATANIC. ZIONIST. ELITE. REPTILLIAN  🦎LIZARD. GEORGE. $ORO$ (SOROS)'S. PUPPET?????  WE KNOW. JAMES.  COMEY. AND. THE.  FBI/ CIA/ NSA/  AND. HOMELAND. SECURITY.   ARE. HIS  PUPPETS !!!!!!"], ["@joshuavannorman4150", "People don’t realize something is truly off. \n  When the people finally realize that all the bad stuff happened during this man’s presidency. \n  Social distancing. Shutting down businesses. Inflation worsens. \n  Race wars. \nSo on . \n   What better way to destroy the American dream then to put a man in office who has the capability to destroy and bankrupt his own casinos . \n  🤔. \nNot saying Biden‘s any better. \n  Because he’s not."], ["@bxb590", "Look at the grin on Putin's face. He's thinking, Trump you're going to be easy to take down."], ["@sybr3602", "Trump pissed Putin by doing 2 things.  \n1.  He ended the nuclear treaty (because of Putin's hypersonic nukes).  \n2. He created Space Force (to hunt down Putin's hypersonic nukes)."], ["@KenJames9911", "United States Constitution: 14th amendment, article 3: \r\n“No person shall hold any office civil or military, under the United States, or under any state, who, having previously taken an oath to support the constitution of the United States, shall have engaged in insurrection or rebellion against the same, or giving aid or comfort to the enemies thereof.”"], ["@lawrencehamilton5959", "Trump so boild you can see he work with puden"], ["@walterpovajnuk4355", "This is 😭"], ["@ANGEL-eh6pd", "It looks like both of them are sneaky and secretive too."], ["@ANGEL-eh6pd", "The S3bet is messed up besides being a laughing stalk.  Too bad."], ["@remedy5655", "Russia this evil"], ["@forex7769", "Can't stand listening to garbage from the Russians omg talk about twist twist twist do they have competitions starting at school to see who can twist spin any piece if news into Russian propaganda it is annoying insulting and embarrassing for them yet they are oblivious in the face of it all shameless."], ["@richardseys8014", "YEARS FROM Now THE  EVIDENCE FOR A CORRUPT 2016 ELECTION  TO PLACE TRIUMP IN POWER WILL BE FOUND"], ["@richardseys8014", "TRUMP NEVER WORKED FOR RUSSIA BULL SHT"], ["@maximpopov8651", "Thank God tRump is over..."], ["@Shawn-ky2tw", "Putin is so ruthless. The innocent people (especially children) he has killed and just to sit and smile and accept that they are the casualties of war. He is a prime example of human filth and a complete embarrassment for the human race just as Dictator's before him, but he is one of the worst kind."], ["@cristianahelena9561", "El dinero no tiene enemigos, solo los estúpidos no quieren el dinero, EEUU necesita su economía estable."], ["@cristianahelena9561", "Lo importante es que Trump dejó la Economía fuerte y sin guerras."], ["@MsSambaNow", "Valdimir Yakunin: \"Putin . . .looks out for the ordinary people . . .\"  More Putin Propaganda.  Putin doesn't give a damn about his citizens- sending them to die in Ukraine, locking people up for 15 years for disagreeing with him, etc. plus killing Ukranian citizens, even though he calls them \"Russian.\""], ["@MsSambaNow", "Nikki Haley for President."], ["@MsSambaNow", "most important message here from Andrei Kolesnikov, Putin . . . \"and Trump would make a deal on how the rest of the world would live.\""], ["@One.--", "Trumps not done with this country yet. If he can make it back in the White House Putin will then just realized he is a real Genius\nWhile he knows Trump is a want to be & then 2nd to Putin a puppet American President he won without firing one shot & at best Putin could then just sit back & watch us tear ourselves apart. You know that famous saying (WHILE YOU NOT GOING TO HAVE A COUNTRY NO MORE)  that's right you heard that saying before its coming right out of Trumps mouth. MAKE AMERICA GREAT AGAIN AGAIN & AGAIN The new dictator  has arrived right before your eye keep it up folks watch out for what you wish for lessons of history won't be so kind. Putin you are a genius & coming from my mouth you are a murder & idiot along with your puppet."], ["@karlamccullough8614", "DW is one of my favorite news sources.  However, there is more history between Russia and the Trump that's not in this video.  Ask why would Trump pursue being on good terms with Putin?\nWho benefits? Why does Trump admire Putin?\nTrump is not who he claims to be.  In the 1990s Trump was $3.6 billion in debt. Trump had 6 bankruptcies and numerous failed businesses.  Reputable U.S. banks stopped loaning money to Trump back around 2000. Saw or read more than one documentary showing Trump was involved with the Russia money laundromat in New York city.  The connection was Felix Sater. Sater is a Russian-American mobster, convicted felon, real estate developer, former managing director of Bayrock Group LLC, a real estate conglomerate based out of New York City with offices in Trump tower, and a friend of Michael Cohen, Trump's lawyer, who was convicted of fraud and perjury. \nSater was an advisor to The Trump Organization. Sater worked with the Trumps on projects like Trump Soho building in NY,  Russian oligarchs purchased condominiums at inflated prices. Sater was helping Trump get approvals (needed from Putin) and funding (from oligarchs) to build a Trump tower in Moscow, effort stopped in early 2016 after Trump's campaign for president was announced. Moscow is a very rich city with wealthy people and Trump wanted to do business there. In 2014 one of Trump's sons said we don't need money from U.S. banks we get all the money we need from Russia. \n~~~~~~\nTo answer my questions:\nTrump's priorities are himself, his image,  money, power and control. Trump admires Putin because he wants to have the same power and control that Putin has. Trump wanted to do business (make money) in Russia and needed Putin's approval."], ["@livethemoment5148", "so Putin is now just another Kim Jong Un...except he is actively invading other countries...he needs to be confronted with force"], ["@muazbaharom8868", "You wrong out Trump,you Don't known anything"], ["@greatoutdoors6074", "Putin and Trump..............The evil duo"], ["@dennismayango5915", "Trump has brought the downfall of America in favor of Vladimir Putin of Russia. As Americans, we need be very carefully with Donald Trump's way of handling America. If it continues, trouble is coming for us"], ["@arkhsm", "This doco.... just give it a couple of years and Putin will be isolated even more, by covid/ego !!"], ["@exactceamzis6525", "Invasion of 2 russian gypsies jews in Europe trought NATO alliance"], ["@worldpeacepatriot9448", "No one man or woman , or group , nation , country , tribe or political agency , etc ; of any stripe has the right to threaten or hold hostage the rights of the peoples of our world to have solidarity , peace and  cooperation to the universal social safety and future  survival of humankind and all life on our world !"], ["@dannybruff", "Meanwhile Germany bankrolls Russia and the war with their gas... Sick bastards"], ["@stevenfarrington2361", "I like DW documentarys but not so much this one. The Crossfire Hurricane investigation by the Dept of Justice detailing the absolute corruption of Hillary Clinton and the fake Steele Dossier was not mentioned. This fake dossier allowed the FBI to illegally spy on the Trump Administration and release a constant stream of information direct to a hostile global media united in a ‘religion of hatred’ towards Trump. The way this undermined his presidency is unprecedented and cannot be overstated. It surely had an impact on the relationship with Russia. \nBTW, I’m not Russian or American."], ["@trivotucic1095", "WHAT WE AMERICA 🇺🇸 AND NATO MEMBERS DON'T UNDERSTAND????THIS MEN TELL US WORKING TOGETHER WITH RUSSIA AS THE BEST THING FOR WORLD. LESSEN AND LESSEN AND LEARN SOMETHING GREAT 👍."], ["@monti8415", "Putin played Trump like a fiddle.  Trump fell head or heals for Putin and wanted nothing but Putin's adoration, approval and pointers on how to become a great Dictator."], ["@radhikadevarampally8189", "Western propaganda…brain washing documentary"], ["@gloriajohnson8668", "This is the hell you get when you give one man too much power."], ["@angielovelace888", "LIARS"], ["@angielovelace888", "Proven this collusion was a hoax. You fn idiots I hope you feel good with your lies. Your children and grandchildren will have such horrible lives. You'll have t[o explain to them why you were so selfish to take away their rights and freedom ugh smfh"], ["@angielovelace888", "BS"], ["@islandgirl9562", "Excellent documentary!"], ["@haldir3120", "I do not understand this video supposedly showing people after a chemical attack. All we see are people getting washed nothing else. No blood, no coughing nothing indicating a chemical attack. DW should not use These videos if they cannot confirms what they See."], ["@ahmetgalip4319", "United States is trying to over through PM Imran Khan Pakistan. Million of dollars have been distributed to the oppositions of Pakistan. Biden dislikes PM Imran Khan is because PM stood up against United States “Obsoletely not”. Pakistan fought an unjust War for America, but it was failure.  \n\n\r\nWe have lost over 100,000 Citizens of Pakistan. No Gain established. PM Imran Khan does not want this to happen again. He stood up against Biden that Pakistan will not get involved in any War against Afghanistan or any county. Pakistan wants to be Neutral. Biden does not like the answered. \n\n\r\nThe threaten letter was sent to Pakistani PM Imran Khan that he will be executed and his government will be overthrown. The Letter is been declassified can be shown to the whole World. We don’t want America to get involved in countries who likes Live in peace other countries.  You may confirm this by going to PM Imran khan You tube channels. This is not a Fake news.\n\n\r\n Pakistan is one of that country who likes to Live in peace."], ["@patrickrumbu2902", "What I got fed out there is Trump & Putin are best of buddies..but from this docu..I found out for myself that; like every politician..they all 'go to bed' together when it best serves their interests."], ["@KodaGSD-uf3hg", "Quite a change of events finding Obama Clinton Biden Whitehouse now indicted for spying on Trump campaign and later Whitehouse"], ["@michaelpond813", "He cares more forputin than stormy Daniels. All are reprobates."], ["@cosmicthespider7974", "Why is that guy wearing minion goggles"], ["@reginalim7409", "Trump an isolationist . He admired Putin & indeed like to rule the World tyrant style. Trump was honored to have partnered with Russia from how warm he was with buddy Putin."], ["@EarlyBirdCraft", "If Trump was Putin’s puppet, why did Trump start arming Ukraine? Trump killed Iranian warlords that are friends with Putin."], ["@asonoiki", "Putin's puppet!"], ["@mirakamiryamhonigman9588", "Politics is run by ulterior motives and lies. If politicians could b transparent, honorable, and actually worked 4 The Betterment of Humanity, there would b minimal if not any problems👁👽👽"], ["@SwisstedChef2018", "Does he look after the regular people? The Russians do not seem so happy. I lived three years in Phuket , Thailand - full of Russians. Met many, they did not like him so much and rather dwelled free in Thailand one party after the other."], ["@stevengegar9709", "I wonder if you see the difference NOW -BTWEEN  Beijingbunkerbiden and Ukraine Vs. Trumps years you cemonrat warmonger son of a Bit***S"], ["@sharonneidhardt1364", "Russia has only 6 percent of their ppl that are Christian!!!"], ["@icestationzebra8636", "This is the kind of garbage Trump talks about from the leftest media. The cabal is deep and widespread and the leaders in the West are ALL in on it. Rigged elections and crackdowns on decent such as in Canada. Selective news coverage, none of these things are suppose to take place in the West. Especially America but it is. And now with the war in Ukraine they can target their political opposition and say they are just like Putin. It’s predictable and sad and the fact that a lot of people in America will believe it breaks my heart as the America I was taught to believe existed dies and is twisted and contorted into a playground for fascist and communists alike. True freedom in practice is a balancing act politically and at the moment the extremes control our politics. But because there is so much name calling against those that are not what the media says they are, it is hard for many, especially the younger generations to know what the truth really is. Confusion is the order of the day and it is serious and hurtful and authoritarian but those people in power while supporting a good people in Ukraine, they punish and demean their own people. Just ask Mr. Trudeau in Canada and his crack down on the truckers. Peaceful protests done by average peaceful living people yet not one dingier lifted the year before while churches burned and statues were toppled. A knee taken by that same man in solidarity with those who committed violence and yet he cracks down on those that would blow truck horns in protest? We have a BIG problem in the West and it has to end and the spirt of our Constitutions and the return to societal stability and co-existence must be restored or it will all end. It pains to see this as I have family that have to live this. I now have more days behind me than in front of me and it really makes me sad to see all this."], ["@abdonsantella5421", "The American people do not want Trump back in the whitehouse he is an evil person!!!!"], ["@Justin.Martyr", "*ALL Voters for Trump  ARE  Skuum!!!*"], ["@timcollins3484", "Western \"news\" sources should get their feeds from Reuters not US dominated fake new sites.The primary goal was to show NATO and the USA THEY could not push Russia around. Also to preserve their sovereign right to Black Sea ports and Crimea. This Putin has done. So sad it took so many lives. Now watch Zelenskyy claim \"victory\" sic."], ["@touyakaga5078", "Usa"], ["@frankpitchford6936", "You’re a"], ["@frankpitchford6936", "Trump is not a bully"], ["@frankpitchford6936", "Trump is not a bully but you are"], ["@vectorfox4782", "Who’s here after Putin’s execution and Trump’s incarceration? Oh wait it hasn’t happened yet."], ["@orange1809", "The title should be Trump: Putin’s lap dog - watching this after Putin’s invasion of Ukraine"], ["@sheilalopez3983", "I'm sure the Russians loved the incompetent clown."], ["@nelsonta00", "This looks like an interesting movie.  When is it coming out?"], ["@jameshorton8294", "Donald Trump, the Mistress of Moscow."], ["@jameshorton8294", "Donald Trump, the Mistress of Moscow."], ["@jameshorton8294", "Donald Trump, the Mistress of Moscow."], ["@klaudiagrobl9912", "Countries desire to isolate has led to world war 1 and 2. Trump approached his presidency as another 'business deal'. His approach was that he doesn't understand foreign policy. He would have allowed Putin to destroy Ukraine without blinking. There would have been no NATO or sanctions. Trump didn't understand that being president of US carries responsibility that there are places for example in the Eastern Europe that rely on the protection from the United States. But he preferred people like Putin as he was 'strong one' and he didn't care about weak ones."], ["@andrasbodo", "TRUMP ! ANYTHING YOU TOUCH IS DESTRUCTION YOU FREAKING CRIMINAL BROTHER IN CRIME WITH PUTIN..."], ["@janea4777", "Putin is a paid liar. That’s was his job for 2 decades."], ["@louisetaylor2131", "This shows the deceit of the left,  Clinton getting sued for crimes against Trump is music to the ears"], ["@johnduncan4725", "Maybe these two can end up in the same shower.  Guess who grabs the soap on the floor😂"], ["@laryangel4082", "5"], ["@philmichaels1162", "“Putin’s endgame is to make mad love to Donald Trump.”\n\nWe must bring this war to Russia territory (Moscow) in the form of Guerrilla warfare. This is a form of irregular warfare in which small groups of combatants, such as paramilitary personnel, armed civilians, or irregulars, use military tactics including ambushes, sabotage, raids, petty warfare, hit-and-run tactics, and mobility, to fight a larger and less-mobile traditional military. \n“The head of the snake must be removed in order to save thousands of not tens of thousands of innocent people.” \nmust be removed in order to save thousands of not tens of thousands of innocent people.” \nthousands of innocent people.” \nmust be removed in order to save thousands of not tens of thousands of innocent people.” \nU.G.W: Ukraine Guerrilla Warriors"], ["@philmichaels1162", "“Putin’s endgame is to make mad love to Donald Trump.”\n\nWe must bring this war to Russia territory (Moscow) in the form of Guerrilla warfare. This is a form of irregular warfare in which small groups of combatants, such as paramilitary personnel, armed civilians, or irregulars, use military tactics including ambushes, sabotage, raids, petty warfare, hit-and-run tactics, and mobility, to fight a larger and less-mobile traditional military. \n“The head of the snake must be removed in order to save thousands of not tens of thousands of innocent people.” \nmust be removed in order to save thousands of not tens of thousands of innocent people.” \nthousands of innocent people.” \nmust be removed in order to save thousands of not tens of thousands of innocent people.” \nU.G.W: Ukraine Guerrilla Warriors"], ["@gina_borrman", "Gave me the chance of the truth and information of the past from your channel.  I’m on board and looking forward for  more truthful updates . Very well narrated and easy to understand."], ["@chanikatz7077", "FBI, thank you for your supporting me..\nGod bless you forever and ever! ! !"], ["@simplesimon5739", "So a German news organisation. What has Germany done for the defense of Europe in the last 70 years. The Germany that is reliant on Russian coal, petroleum and gas. The Germany that has let down it's NATO allies. Trump didn't have Russia causing problems on his watch and bombed them in Syria. Trump placated North Korea the first to do so. Trump warned China of Taiwan yet here we our with a German news organisation peddling crap. Shame on you. True to your colours."], ["@danielraymadden", "This video is not accurate it tells nothing about abuse of human eights in Russia fake doc"], ["@zofiaptaszynski7580", "Z literko z"], ["@zofiaptaszynski7580", "Miko jordano nigdy. Sandwiczes ci nie podam tylko wszystkiego po trochu. ..  Pytajac na co masz ochote. W pelnym tego slowa znaczeniu. ..zapytaj prezydenta putina jak uczylam sie gotowa. A jskie bigodiki robie to i genereal wie . siergiejo z mielnika jego couzyn Korol i wszyscy hunterxy .. Co lspali dxiki niech jasko ci powie ... Od czego sie zaczelo bo nie wyvhidxily mi nalesniki a siostra i bracia bardxonie bili. .. A jak ich kompalam w misce. Bo tato prxyjdzie juz pijany Pytalam ja whay.  Bo ja poszla na skarge. Do komitetu. Patrzac na nia whay.. Kurwa to nie twoja sprawa bo ja musze dac wam zrec .... Fo ochronki was oddam ii nie bardxo wiedxialam co to jedt ta ochronka ..dlategi pokochalam i biedronka.  Tez tski sklepik jest w moich siemiatyczach.. Chyba podxial z korolowa ..na dadavh otworxyli .."], ["@danielraymadden", "Ezekiel 7 : 27 Acvording to your ways so shall be done to you...with your own judgements you will be judged...they will know Iam Jehovah...YOU REAP WHAT YOU SOW...."], ["@ishagabdulrazzak6298", "Thats all lies."], ["@ishagabdulrazzak6298", "President Trump wanted to maintain  the World a place,  more peaseful."], ["@ishagabdulrazzak6298", "Thst's how US condem other nations.  No any chemicals used.   US always lie. I wonder why the World always believes the US."], ["@ishagabdulrazzak6298", "Why maintain enimity ???   Get on well.    \nI thought President Trump was a lunatic.   Now I realise Pres. Trump was more intelligent, more diplomatic and more  friendly person wanting the World to be a peaceful place."], ["@HereIStandICanDoNoOther", "Legacy  MSM is the enemy of the people, pence and barr and most of trumps closest were deep state swamp creatures guilty of crimes against children, all that got the white envelope at bush Snrs funeral"], ["@HereIStandICanDoNoOther", "bullshit msm trash...trump will be back 2024 and hopefully this time he knows who his real enemies are and keeps them at arms length... Puty poot  would not risk Moscow being bombed which is what trump said to his face if he invaded  Ukraine"], ["@justincarroll9846", "Fake news Fake news Fake news."], ["@rosypegu", "Trump was the best President. There wouldn’t be any war if he was still our President. Putin feared Trump!!! Putin took Crimea when Obama was President and now Biden. This says a lot."], ["@meannormajean8418", "Cheat, cheat. Cheat, cheat."], ["@mauriciomerino2765", "today it is bad that peace with Russia is being sought in the last government.  But if it is good to seek rapprochement with other dictators like Nicolas Maduro, and the others from the Middle East, I don't see any logic in that."], ["@kevinclark5012", "You know why call me isn't in prison because there's a swamp and DC and he's a swamp creature that's why he can lie to the American people break all the laws he wants he's ahead of the FBI nobody can touch him how come you're not doing a report on that"], ["@hawthornehillnaturepreserv5186", "What a disgrace!  The Dumpster is a traitor in my eyes.  Like Putin, he should face his crimes.  May justice be achieved!"], ["@hawthornehillnaturepreserv5186", "Trump: “I never knowingly worked for Russia”. Eric Trump: “But a majority of our funding comes from Russia..right daddy?” Trump: “Shut up you idiot!”"], ["@jasonq7504", "33:25 the report was readacted and misrepresented by William Burr, a trump appointee acting on his orders in the justice department. The report was damning, but in a traitorous move, Barr lied about the contents in the report and what they meant."], ["@mohammeddhaish5887", "Look at his weird son 🤣"], ["@shearwatersoil1", "This is pure bunk.  Donald Trump was seeking communication with all world leaders who were capable of rational thought.  Democrats are/were brain dead and could not countenance his success.  Trump secured peace through strength, energy independence, built a secure border, secured economic strength and full employment for all people and particularly blacks who were second class citizens under democrat rule.  All democrat attempts to smear him have failed!"], ["@CindyKalbakdalen-zs9us", "Trump is a flea on the butt of 🪳!"], ["@vaalcellcity7138", "Listen to Kim Clement Prophet rewind....He was amazing with Prophecies...."], ["@vaalcellcity7138", "@ Ken H ...did you forget Trump loves America...And worked for the American people...And all the News against Trump on purpose ??? You probably listened to CNN...that was planned..."], ["@vaalcellcity7138", "D.J.T.. knows  Humans...He just understood  how to keep the peace...with Putin.."], ["@Wacth478", "Thanks for this documentary👍, it helps me to face the days, where the times are full of pollution."], ["@mockrusysdzounsas3022", "Fake news media, now its clear all this is a lie"], ["@malcolmbliss777", "Putin and Trump are one in the same. Trump siding with Putin over Ukraine is his downfall. He will never recover from this mistake: it’s a doozy."], ["@TomTom-xp2jb", "Lies, lies and more lies!!! That's all that Trump knows. He's always been a liar, just like his Dad. Rotten to the core. Ask any real estate agent in Manhattan!!! They wouldn't even take his calls. He is that toxic!!! I mean John the moustache Bolton??? War monger of the century!!! If this happened in any other country besides the states Trump would have been executed for treason!!! Incidentally Biden isn't any better. The White House, tragically, is full of criminals and always has been!!!"], ["@TomTom-xp2jb", "Trump said would and everyone heard him. This shows what an unmitigated liar Donald John Trump was and still is to this day. You can't trust a person like that, president or not!!! He should have been impeached for his deception right then and there. How embarrassing for not only Trump supporters but all Americans!!! Pathetic!!! 👎"], ["@darrellrobison1870", "Vodka all round at the Kremlin,vlads shout"], ["@tungthanhngo6109", "I am trying to get a great 👍 on your phone and the world's largest and a"], ["@marylynsepulveda2156", "IDIOTZZZ  TRUMPY REALLY FOOLED AMERICA"], ["@jeremywalters2205", "Trump and Putin for prison. 🇺🇸"], ["@saividyamandirschool5082", "I think, EU countries will always be remembered for their severe laziness and mistake of not taking the right side at right time by taking Russia with them after Cold War is over. Europe has amassed great wealth from all over the world in past from colonisation and now they should repay it back by providing a peaceful globe by not chiding America , but advising it to take a pause and rethink over supremacy addiction. After all supremacy doesn’t gurantee happiness but vice versa is true. It is high time for  Germany, France , Italy and other rich Switzerland type countries to take both USA and Russia on side of the table and if they don’t, isolate both or one of them as per their decision. In this way, EU will repay its moral debt towards poorer countries, otherwise Lord Jesus won’t spare them."], ["@borasolutions", "It's clear Trump was on the right path. It's also more clear how war is far more important to the wicked so called leaders in this world than to have peace with Russia and other nations. Because of nonstop propaganda and lies filtered through a soulless media, look at where we're at now."], ["@frankosaringer403", "Präsident Putin ist auch zu 50% beteiligt an U.S. Space Force, da Großbritannien nach Satzung Brief 81 untergegangen ist. Eine Queen Elizabeth hat nur noch ihr altes Gedankengut und eine Chipsi Angela Merkel seit 2014 ein Veto, aber wir haben die Basis und den EBV Rheinbraun Bunker euer Devil."], ["@glenmalesa8902", "Excellent doc"], ["@irenerobertson-smith5502", "Listen to Putin then Trump.  2 communists bonding oh yes. America a communist country if you vote Trump again"], ["@chosen5831", "I love this president Vadamuir Putin   great leader you .They say  you are ruthless  but  the other side of you is kind and caring"], ["@annm.7176", "Not true"], ["@mattpalumbo5249", "US is the oligarchy. 80% of voters r living paycheck to paycheck.  the elites want defense spending n that’s what theyre getting. John Bolton is a creep, on a side note"], ["@OscarRodriguez-mf2ol", "The u.s. is failing and failing fast thanks to the inside job that Donald made but then again it was going to happen anyway because all the harm that the u.s. has done to our planet"], ["@OscarRodriguez-mf2ol", "Clearly Donald Trump is a Russian agent, Donald Trump made the way for Putin to win in Syria while he made a trade war with China so he was the one who provoked  that China get closer to Russia,  is plain simple Donald Trump made Russia stronger not great but stronger"], ["@lindagodichiabois2768", "Just like Trump, Putin doesn't just look out for the elite, he also looks out for himself. Nuff said !!"], ["@Office_De_Receiver_Complaints", "Hi, 2022 again! 🦶👉👄"], ["@cainestadler9414", "Trump = Peace time"], ["@floydwillard329", "It was always obvious to me Donald Trump an idiot."], ["@justadad6677", "What we know now, is that Putin had no idea how much Fox News had radicalized America. His propaganda had a far larger impact, because of Fox News. They didn't need to \"persuade\" hundred on millions, much less the ridiculous 300 million the Russian guy said. They only needed to gain a few millions, to tip the scale and win in a bad electoral system."], ["@chadduda4981", "Look at how happy was in the picture with Donald Trump cuz he knew he put the hackers to make Trump win the election cuz he didn't want Hillary Clinton to win the election because he didn't like Hillary Clinton our Bill Clinton her husband because when Bill Clinton went to meet Latimer pool in when he became the new leader of Russia he told the ex-president will much off that this man does not have democracy in his heart and he pointed in his heart and go over top said I made a terrible mistake but it was too late already Vladimir Putin was the leader of Russia so yes Vladimir Putin is a war criminal and a gangster and corrupt politicians everybody that's under him is corrupt and he had his own Russian people journalists killed and some of them are missing even one of his girlfriends are missing he had the one journalist put in jail and tried to kill them with nerve gas you could see in the pictures how happy Vladimir Putin was and all the oligars they were popping champagne bottles that Trump had won the election because he hacked in our election and hacked and Hillary Clinton's emails that's the only reason why Trump won it's all documentary on PBS channel 11 watch it and you'll see the facts unfold in front of your eyes God bless America and to the free people and democracy let freedom Ring and love will always conquer hate and evil and peace will always conquer evil and corrupt politicians and corrupt leaders will finally come to an end in the Free world let the whole world see what their eyes what is really happening Hillary Clinton was supposed to win that election."], ["@kratoleaf7619", "i love Trump loving Putin!"], ["@frankqr", "I wonder why was so much ado with the Muller investigation including an attempt to impeachment and so little attention to the Durham report and the Hunter Biden’s laptop and the Vice President Biden collusion (blackmail) with Ukraine?"], ["@bwoutchannel6356", "The fraud that we in the USA went through in all its manifestations, the propaganda and news manipulations , orchestrations , to install Biden and almost Hillary Clinton and delegitimize Trump, the use of rogue FBI agents, toxic CIA members, politically maladroit former military officials, and other well placed bureaucrats who illegally leaked information often fabricating false information to scuttle the functioning of a legally elected presidential administration, this fraud is , was, no different or in degrees little different than the discussion Putin here is making. Yes Putin is defending his borders by retaking land in the old Soviet Unions purview and sphere of influence 20% who are not dissatisfied with remaining as a Russian \"protectorate\" it might be said. We should not push and push upon a very foreign situation very far away, very close to a people that do not require our culture or morality nor should we think that the Ukraine populace can, will or should become a functioning Democracy even as is the case in Europe with all their issues and problem much less as our governing body with our major issues, problems, debt, addictions, animosities, and very obvious faults. And to think that this day people want to get into a hot war committing Americans youth to bleed under these circumstances is shameful and the very height of foolishness ."], ["@leilanivevang9601", "I pray America's are waking up and see through the deceptive bias in this documentary. People are becoming brave and thinking for themselves again. These old techniques of double speak and brain washing aren't working any more. The lazy \"sheepal\" wanting to be lead by the nose are diminishing. We must remove those in power in America who are trying to destroy us!"], ["@blessedheavyelements8544", "TRE45ON"], ["@mipimet809", "trump will be back"], ["@teddylabis4837", "Trump is the best president ever 🙌 👏 🙄 🤣 ❤ 👍"], ["@patrickfrey4434", "Trump is the GREATEST PRESIDENT IN HISTORY.  To call Trump and Purin BOSSOM BUDDIES is a GROSS LIE.  They merely RESPECTED EACH OTHER."], ["@uniquelylily1166", "Glory to Ukraine 🇺🇦"], ["@autobahnmensch", "Provocative title, invalid comparison... Tactics that are ok for tabloid journalism, but unbecoming of a national broadcasting agency.\nWould you please do a documentary about Biden corruption as well?"], ["@bobbrock4221", "Putin and Trump sittin in a tree..."], ["@gb3346", "The place of honor for the U.S Flag AND the U.S. President us to the right. Trump as the U.S. President was sitting on the wrong side in Helsinki when he shook Putin's hand and said \"it is an honor to meet you\""], ["@unik4161", "Trump was the best American president ever. 🇺🇸 \nNow, just look around and see what is happening to our country as the days goes by.\n\nSince day one Biden made a point to undo important resolutions put in place by Trump, and now we and the world are watching our country falling apart.  \n\nDon’t be naive, don’t watch only the main stream media; make an effort do do your our research and get prepared."], ["@josephcharlemagne3918", "The world Shithole"], ["@Davudhudson", "Russia and elections, so funny."], ["@erhardt1477", "Nice to see in 2022 … 👍"], ["@janettawallace3722", "These two men should have never been elected as Presidents of no country. If things do not go their way and doing what  they say they retaliate. Trump rally to rioting and telling lies and Putin goes to wars. They are trouble to our countries.  Trump congratulated Putin but he never congratulated Binden. So sad it did not go his way. He keeps a slippery tongue with wrong words."], ["@nandovee2025", "If only we could all get along. Imagine what we would achieve as a species. Religion and politics are the two worst things we have ever created. And the people who pay the price are the average everyday people caught up in the crossfire."], ["@nelsonlourenco3781", "Totally biased report"], ["@gerrygreaves827", "Trump not only spoke to Putin he also went to see Kim Jon Hum if Trumphad been re elected Russian would not be invading Ukraine"], ["@edgarmendoza2397", "Russia affairs in politics in America 🇺🇸"], ["@xiaxiong3025", "01/06 Trump trying to over throw US gov. Now Putin trying to over throw Ukraine gov. these 2 leaders are using the same tactic, this is how communist countries way of over throw government. We do have communist party within Washington. I left SE Asia war due to communist, I do not want to see them ever again."], ["@giolinamaksimovic9922", "I love Mr Triump he knows a good man, when he sees one, Vladimir Putin. They have stayed friends."], ["@misterpsk", "Two bullies and two losers!  One bully does not show up for the insurrection  he inspired while the other bully invaded a sovereign nation with an unprepared Army and Air Force!  A fake insurrection leader and a fake super power leader, a murderer of his own troops and civilians!"], ["@rogerjohnson2562", "WTF DW; I watched both episodes 1 & 2, didn't see anything to confirm Putin & Trump were bosom anything, and although Putin was shown to be a bully, Trump wasn't."], ["@jacobyahiayan9039", "A bullshit allegations by Democrats,  lost opportunities, and cause of Russian balegerance today"], ["@michaelirvinehart96", "Neio Stalinist “‘Vlad the Bad’ Putin,” — Dictatorial Soviet—style ruler, or sham ‘President’ of Russia. Over time, hopefully Putin will stand trial as a WAR CRIMINAL.  And as a unrepentant Nuclear War Monger; I hope the array of Nations includes not just Ukraine, Finland, the Baltic States and Germany (advocating for former ‘’East’ Germany whom Putin himself —out of Dresden—overtly helped keep the  EVIL Erich Honecker in power from his powerful KGB POST in Dresden — keeping the sham Soviet Puppet-State alive (barely) whom killed many THOUSANDS of i100% innocent Eastern German civilians — and who helped spiritt-out Erich Honecker to die, OUTSIDE of PRISON , in South America, like a rusted old 💀Nazi War Criminal‼️🔍👀 Besides that, he has threatened the ENTIRE WORLD with Russian NUKES, potentially KILLING UP TO BILLIONS OF PEOPLE —WORLDWIDE‼️ (💥CCP 🇨🇳 — ARE YOU AWAKE? THIS THREAT INCLUDES ALL AS MEMBERS OF THE HUMAN RACE‼️ WANNA SLOWLY STARVE & THEN DIE FROM RADIATION ☢️?? — It WON’T just be “Putin vs.. the ‘WEST’🇨🇳‼️🙋🏻‍♂️☢️Bye.♾)"], ["@MegaTonyng", "“I have never seen a president in American history who has lied so continuously and so outrageously as Donald Trump, period \" \n\n           -  Presidential historian               Michael Beschloss"], ["@anthonychristy7131", "The comments made some of the some Russian interview contributors sound like pure Russian propaganda..... Go figure."], ["@musicg1696", "Mueller absolutely never stated \"No collusion\""], ["@DisappointingPorn", "Better to be friends than enemies. Just saying."]]