[["@TuckerCarlson", "Watch my immediate reaction to the interview here: https://bit.ly/3SxeZBY"], ["@pt78rch3", "Jeeze, Putin makes it sound like he is dealing with a coorperate infastructure."], ["@I-uf2hc", "The most effective way to destroy people is to deny and obliterate their own understanding of their history. G. Orwell\nI am from Russia. Putin is the biggest liar and this interview is pure propaganda."], ["@2serveand2protect", "PUTIN (direct quote): \"I DIDN'T KNOW HE WAS SUCH A KISS-@SS!\" ...he was talking talking to one of his state-owned \"TV-channels\" - about YOU, Tucker! 😂"], ["@chieunguyen3395", "You should keep original sound of Putin, some one could love that sound, and some one need to believe what they hearing"], ["@duothink", "u could have asked him, when he wants Alaska back, cuz it was also a part of russia!"], ["@user-uz4qn6nt7b", "What non-Russian speaking people do not understand is that while Putin is destroying Ukrainian cities, he cannot take care of Russia, a country in ruins. Just search on Youtube how cities and regions like Tyva, Norilsk, Voronej, Kalmikiya, Buryatya actually look. The poverty, the total lack of infrastructure, the human degradation."], ["@adams194", "Mr. Tucker did what a journalist should, but believe me, as Poles who have had experience with Russia/Soviets for hundreds of years, Putin is lying and will not stop in Ukraine, it's all propaganda"], ["@metabalcanico5719", "Absolutely delusional. And of course lot of fools in the west have swallowed his bs hook, line and sinker."], ["@InvestmentEEM", "Middle wage in Russia is $300 per month- DREAM life by Tucker. Yes, some products little cheeper than in your hometown- BUT are you sure that you want that quality( check middle life-term in Russia 😂)"], ["@stinger2958", "Another lies from putin"], ["@eraouambrahim", "نريده مترجم للعربية"], ["@f9658", "It's fascinating to witness and learn about Vladimir Putin’s reasoning and personal anecdotes from his discussions with other world leaders. It offers a glimpse into what unfolds behind closed doors, particularly given that these talks determine the fate of millions, if not billions, of people worldwide."], ["@user-gg2ty3wd2h", "Watching tucker's face throughout this is so unbearably cringey."], ["@POLOS7ARS", "Tucker where is the trump video wow!!! I want to knowbwhat hapenend why was it taken off. If you dont here from tucker in few days daam know why!!"], ["@az-fj4ll", "Funny that people believe this is all true and unscripted 😂😂"], ["@richarddantz4256", "Don't agree with any two countries fighting but holy shit do I feel misinformed by our lovely country. How long till they delete so we cant see that he's actually just a human. You couldn't even ask our President what he had for breakfast that day!!!"], ["@aleishajack6952", "1:43:22.....did Putin fart???"], ["@aleishajack6952", "Love him or hate him Putin is a very interesting man to listen to. He comes across as extremely intelligent and logical. @tuckercarlson, not so much...the look on his face says he has no idea what Putin is talking about. This interview would be much better presented by someone with an equal intellect to Putin, like Jordan Peterson."], ["@choc42069", "Cant we all just stop and have peace"], ["@vettiofficer7842", "Love from india❤️ 🇮🇳🫂🇷🇺"], ["@user-gu8uj5qi2g", "The translator is phenomenal"], ["@chadyoung5716", "He is a bad man he is power hungry he is about power and that’s all it is."], ["@chadyoung5716", "Tukker he is a bad man just know that !!!"], ["@IvansBikesBmws", "Very interesting to watch."], ["@Mellabellaluna", "“On Feb 22nd 2022.. “  \n(2/22/22 ) Am I a sucker for being too deep in thought at literally the first sentence ? Aja ..  way to start off strong !"], ["@j.r.mocksly5996", "Mad Vlad sounds good through his translator! Did anyone try talking to the impaler?\nEdit at halfway-through: I love Tucker, he actually asked the right questions at times. I thought he was being an a-hole for the first half, but right before the hour mark he called out Putin boldly in a way I did not expect. I don't think either one has had an interview quite like it, and they're both full of S. It was a fascinating example of a (surprisingly good) journalist in over-his-head (and genuinely risking death or ostracization) and a World Leader with no accountability in over-his-head as well. Fascinating"], ["@user-ki1rv1od6t", "Very boring"], ["@MLVAS", "I bet Biden doesn't know this much history of USA LOL"], ["@SaumyaSuman-ky5qb", "I don't know why tucker is trying to be dominating here\nPutin is being very respectful here \nI think so should tucker be"], ["@kob-dotu", "Хорошее, интервью, - жаль только, что Запад отказался от мира и вновь готовится к нападению на Россию...."], ["@DefendersAndDisciples", "Regardless of your opinions on Russia v Ukraine, can anyone name a recent US president who they believe would know American history as well as Putin knows Russian history?"], ["@user-rl4tr3ox3i", "Why does the United States use Russia as an enemy, even though Russia has been releasing goodwill. In fact, Putin also indirectly mentioned in this interview that their government is not based on the well-being of their own people, but on personal or political interests. Behind the US presidential candidate is a powerful US military community. What does reconciliation with Russia mean? The world will move towards peace, which is devastating for the US military industry. Only by constantly creating contradictions and conflicts can the United States continue its superpower, super dollar system, and perfectly harvest world wealth. Earth peace, returning to a world dominated by economic development and industry, the United States will be slowly eroded by the thriving Third and Second Worlds, which is not in the interest of the United States. So, making enemies and creating war are the full work of every American leader!"], ["@mtmjedi3046", "Well, as someone who reads up on history from all over the world regularly, don't ask me why, I am a history nut and just leave it at that.  I am also someone who fact checks everything I see on the internet, it's a hobby, unintended, because of the fact that I at this point in my life have been lied to almost everyday.  So, I am critical of everything I see or hear, but I will say this, about roughly half of the history Putin spouts off here is factually false to a point.  Kyiv was founded in 482 ce and Moscow was founded in 1147.  Also the modern day European Russian territory was at one point under the rule of the Ukrainians in the Kievan Rus where the Russian part later declared independence to later form the Principality of Moscow.  Which did not have any Ukrainian Territory.  Even Stalin considered Kyiv the birth place of the Slavs."], ["@thanhluu1127", "Ha ha ha 😂😂😂I can see in Tucker face ! What the hell Mr Plutin talking about??? Tucker gets the hard time for NOT falling to sleep 😂😂😂 Poor Tucker 😂😂"], ["@robertanderson9444", "Putin: We would have considered joining NATO. But they said it was impossible.\nAlso Putin: We all agreed we wouldn't join NATO as former USSR territories."], ["@xXlegitx46Xx", "i love how people care more about Katt Williams than Putin"], ["@thesun___", "1:03:58 Tucker put up the absolute WORSE picture of Biden that he could find. XD XD"], ["@GalinaPs", "Gosh, people 😅stop praising the translator!! The translation you hear was done After (!) the video has been recorded! Whatever was translated to Carlson/ Putin during the interview was the different one! Geez 🙄"], ["@krono32", "0:08: 🎙 Vladimir Putin discusses the war in Ukraine, its origins, and potential outcomes in a lengthy interview.\r\n10:13: 🕰 Historical events leading to territorial changes in Russia before World War I.\r\n20:11: 🗣 Putin discusses historical borders, Hungarian claims, and personal experience in Ukraine.\r\n29:39: 💬 Putin discusses violations of international law by the United States and the need for change.\r\n39:09: 🌍 Putin discusses NATO expansion, hypersonic systems, and decisions made at NATO summits.\r\n48:31: 🤔 Putin discusses the trigger for the conflict in Ukraine and the role of guarantors in a failed agreement.\r\n58:39: 🚫 Putin criticizes Ukrainian president for applauding ex-SS soldier who fought against Russians in WWII.\r\n1:08:24: 💣 Discussion on potential global war due to involvement in Ukraine and use of tactical nuclear weapons.\r\n1:18:04: 💵 The significance of the US dollar in global power dynamics and the impact of US debt and actions on international relations.\r\n1:27:58: 💬 Vladimir Putin discusses personal relationships with world leaders, the mindset of elites, and the changing global economic landscape.\r\n1:37:25: 🇺🇦 Putin's stance on Ukraine, US support, and deception towards voters\r\n1:47:56: ⚠ Emergence of AI Empire and genetic engineering threats to humanity.\r\n1:57:46: 💬 Putin discusses negotiations with the US regarding Ukraine and the challenges of publicizing dialogue.\r\nRecap by Tammy AI"], ["@Val_Cosmos", "The first words of Putin were epic-\"let me give you a brief history lesson for 30sec to one minute max\". The proceeds to give bunch of historical dates and names going back to 13th Century for 50 minutes sttaight.  😂 Tucker did a great job by forcing himself to not get in Ericcsson's trance all along."], ["@MrCheese-Trump2024", "This is Rare, you know why, Putin has never talked someone else outside of his circle ever since 2022 battle against Russia vs. Ukraine!"], ["@sanityshorror", "Putin didn't \"spill the tea\". He dumped the entire dang kettle with a sнiт eating grin 😭😭😂😂"], ["@lesabooth5243", "Biden haters this isn't about him. Your so fuckin ignorant"], ["@RITBCPodcast", "Putin just wants the US to collapse its so blatantly obvious"], ["@solo4889", "It took 10 years, but we got a real life version of the movie \"The Interview\" This is wild"], ["@TwistedFateism", "I am so glad I am balkan slavic.\n\nEDIT: Or not."], ["@ferat-yb5tt", "Браво на теб ти направи добро за всички нас добър човек си браво уважение към теб"], ["@shortcircuit3033", "Really enjoyed this interview, Vladimir is a very impressive man."], ["@myfavs253", "Putin wants to restore Russia to it's historic land holdings.  How long before he invades Alaska?"], ["@nice80275", "Now remember the interview with Austrian BBC journalist Armin Wolf where he interrupted Vladimir Putin every 30 seconds and did not allow him to say anything,Tucker Carlson A true professional,bravo."], ["@user-ts4ru4ds6k", "Well, I think that not just so always wars happen, and always so well played and planned, and explanations are always found military actions ... It's like someone is standing in the shadows and pulling all the \"clowns of the world\" with ropes. I mean politicians and medias... In general, if you think about it, in today's world, people are so much in the hands of these dark forces that they are already quietly waging wars under any pretexts and scenarios ... That is literally the button of nuclear war in their hands, which can wipe out half the world ... People of course in their own way are not quite zombies, but they are not free either. All of us are slaves, and most importantly in any country people are just slaves.... Also in Europe or America, in any part of the world there is no freedom of choice....  I myself saw how the people of Germany and America came out to the rally, a few days, but they are nobody and therefore nobody even reacts to them( It's all sad .... But I'll tell you, people have only two choices to go to die or be a slave in society) no freedom) And as for me it is already the seal of the devil (((Let's say they want to kill their loved ones, and a person can not even protect them. In general, for a long time it all works like this, and the more people will be soulless and indifferent, the more they win, because the soul in silence begins to suffer and sort of self-destruct .... This system is created in order to kill the human soul.... And because of inhuman deeds and helplessness the human soul dies, that is, it becomes powerless and the soul becomes helpless."], ["@agavictoria", "Here @1:08:02 when he said he'd only attack Poland IF Poland attacks Russia, I had chills. This is exactly how the WW2 started; Hitler said Poland had attacked him so he \"had to\" defend Germany on Sep 1, 1939."], ["@jojo9535", "What a joke. Stay in Russia comrade."], ["@michaeljames7358", "CIA is definitely in these threads ppl. Be careful 😅"], ["@michaeljames7358", "Damn I mean.. I’ve been watching all of Carlson’s videos pertaining to this interview…and damn. I always knew the government was corrupt, but this past year, I am convinced they are evil. Russia does not have drugged out cities, their food is healthier, their President can remember what he did 5 mins ago, and I am believing more and more they were not in the wrong in their war with Ukraine…\nDon’t get me wrong, I love my country, our military, our land, and our people, but the government has irreversibly damaged us. \nAs for this American, I respect Russia and its rich history and culture. I wish beyond anything my government was different, and our 2 countries could be friends and allies.\nCan we just end the fucking Cold War already? I mean actually end it this time."], ["@MHTHINK", "I like Tucker for his candidness and balls, but I didn't see any here... I'm at an hour in and it seems like Putin is essentially using the 'interview' to deliver a speech. I think it's useful to let people talk, but there are questions that I, for one, would like to see Putin reply to. Like, what is the long term goal of the war? what responses were/weren't and are/aren't anticipated, and how did the unexpected impact plans? what would end the war now, and what at minimum would be considered? what does Putin wish to bring upon the Ukranian people? Isn't that just scratching the surface??"], ["@rayalexander3170", "TUCKER CARLSON!!! SHYT WHILE YOU HOTT THAN A MF INTERVIEW KIM JUNG-UN!! DO IT FOR THE CULTURE!! that's all."], ["@JB-dv7ew", "As someone who has absolutely no education in translation and linguistics and who is also deaf and blind the translator did a superb job."], ["@delarjmtr5339", "This man is truly defending his motherland. \nI admire Putin and his calmness against all these pressures❤"], ["@delarjmtr5339", "Wish we had a leader like Putin😢"], ["@sirpineapple2262", "Yeah the kyivian rus totally wasn’t Ukrainian…"], ["@surgeonsergio6839", "You know he's a dictator when he uses Frieza's metric for \"30 seconds\""], ["@delarjmtr5339", "WOW,  My God,  This man ,  Putin,  seems so honest and lovely .\nShame to western media pretending he is a devil."], ["@a2b2c34d", "Get so much rubbish on news nice to hear from him himself"], ["@isay207", "Gestures of goodwill catfished makes more sense"], ["@jessehuff1158", "I also want to say hi to all the pro Putin bots."], ["@glenn-younger", "Just listened to the whole interview and I do thank you for sharing it without editing. A few things struck me. First, we've been fed the news that Vladimir Putin had gone more than a little crazy. I did not see craziness in this interview. Second, I think it would serve us to take a look at the longer picture that has gone on over both Democratic and Republican administrations that brought us to today. One has to wonder HOW MUCH a given President drives the agenda, how much a certain three-letter agency drives the agenda by inciting 'events', and how can we extricate ourselves from the Industrial War Complex that Eisenhower warned us about in his farewell speech? At any rate, the US has historically screwed Russia all the way back from World War II and so it is naive to think there isn't a long road in front of us towards making a lasting peace. It is a road that can be taken, but one must let go of the 'posturing' and the ideology that proclaims war-making leads to peace. Oh, and btw, those economic sanctions have hurt the US and Europe more than Russia in the long run. On this, Putin was spot on. It doesn't make sense to continue playing an old game that would've worked forty years ago, but not in today's times."], ["@jessehuff1158", "Communism is good? Let’s all give up our rights for communism? Wtf are we talking about here? 50 years ago Tucker would have been put to death for this. And rightfully so"], ["@rapca2200", "Bullsh1t"], ["@mugaberobertson", "🇷🇺🇷🇺"], ["@isay207", "Its simple Stop why dont you stop putin😂"], ["@isay207", "Positive attitude towards Russia  😮 who changed that putin"], ["@kob-dotu", "مصاحبه بعدی با پوتین کی است؟"], ["@kob-dotu", "Прошло 2 недели, а интерес всё ещё сохраняется. Это хорошо."], ["@elana_19", "Why the fuck do I lowkey love Vladimir Putin, I think it’s because of how awful and dishonest Biden is."], ["@surgeonsergio6839", "You know he's a dictator when he uses Frieza's metric for \"30 seconds\""], ["@vl9107", "18 Mio. Aufrufe und so wenig Kommentare. Er steht wirklich für sein Land und für Sicherheit des Staates."], ["@nicholassimmons9706", "From an objective perspective there are some things Putin says that are true, while there are also things that are false. What is most revealing, however, are the things that are neither. These are things about the way he feels. Putin is very sensitive to feeling threatened, but seems to not be very perceptive of the ways his actions may make others feel threatened and what reasonable responses from those parties would be. This obviously can create spiraling feedback, precisely what he claims to wish to avoid.\n\nFor example, his opinion that the US us not able to adapt to a changing world and instead relies on aggression may have some truth to it. This is of course hypocritical though, as this conversation is happening in the context of his initiation of what is arguably the biggest conflict since WWII because he could not accept Ukraine's right to self determination as a state. His example of Ukraine being a member of the EU, thereby affecting economics of Russia's trade with Ukraine is a perfect example. Rather than \"work things out and find solutions\" as he says in his own words, he resorted to military force, precisely what he accuses the US and NATO of doing.\n\nAnother, which I do find some merit in on his part is being threatened by NATO. It is understandable to think that one may feel threatened by NATO's expansion if one were not part of NATO. From a game theory perspective it would have been wiser by NATO to leave this possibility of becoming a member open ended for Russia, as closing it would obviously have an aggressive appearance thereby instigating an aggressive response from him.\n\nIf you suppose another scenario than the current one, that Ukraine had been a member of NATO for over a decade and it was instead the baltic states of Latvia or Lithuania that were not currently in NATO, what would Putin's choice have then been? He most likely would have invaded Latvia and Lithuania under the pretext of some historical cultural claim and needing to protect Russia from NATO expansion. Therefore his motives are duplicitous and opportunistic. He utilizes his armed forces to assert control in an opportunistic way, precisely justifying the need for NATO given that he would not risk attacking a NATO country.\n\nWould those have been his actions if NATO had never expanded in the first place, thereby making him feel threatened? It's hard to say. The disintegration of the Soviet Union did seem to be an opportunity to create a more pluralistic and less polarized world. It's too bad it was an opportunity lost. \n\nWhat I do find very reasonable to surmise is that a NATO country would never attack Russia. There is very little incentive to do this as it basically guarantees a large scale nuclear conflict and another world war. It is therefore perfectly reasonable to view NATO as a defensive organization. IE Finland and Sweden didn't join NATO because they want allies behind them when they execute some long standing plans to attack Russia. They joined NATO in response to Russia's invasion of Ukraine as a means of guaranteeing their own security and sovereignty. Being a NATO member is simply a guarantee that others will not attack or invade your country. \n\nWhat is hard to accept as fact is that the Euromaidan protests were somehow organized at the behest of the CIA. It is an undeniable fact that protestors were killed by security forces, which Putin does not acknowledge. It seems much more reasonable to think that it was simply an organic and dynamic occurrence spurred by popular sentiment for inclusion in the EU that was further exacerbated by police killing of protestors."], ["@georgipelisie1296", "translation is perfect, but president told a lot of bool shit, but mostly people smart not enough so they pay attention to translation."], ["@Kappa1Kappa", "Anyone who studied a history of Eastern Europe knows he's talking complete bullshut)"], ["@KS-rl8dt", "https://youtu.be/raKXSdw2t2c?si=QLv1UflEGWgnr5hF"], ["@grinte2266", "who gets benefit by poisoning Navalny - Putler\nwho capable doing it - Putler\nsimple math.\nPutin Huilo"], ["@Abotekapio", "The thing is, Kievan Rus was the predecessor of Russia AND Ukraine. Just like humans didn’t come from chimpanzees, but rather they share a common ancestor with them, so does Russia share a common “ancestor” with Ukraine. This was a logical fallacy from the start"], ["@davidisthis", "Tucker keeps trying to stop Putin from rambling off with bs and he can't do it. When he realized the \"denazification\" didn't make any sense he tried changing the subject. He knows the rest of the world will call that bs. Torches do not make you a nazi. Clearly Putin is using Israelis truck and calling anyone he doesn't like a nazi."], ["@americanpatriot412", "Thanks for the history lesson Putin"], ["@patriciacochran4670", "https://youtu.be/Buk2Q9hTJn4?si=hNuDa9Kid_eBHQtc\n\nWth is this all about or is it more fake news?"], ["@greggyfontane1487", "This quack wants to take the moral high ground with the austrian mustached painter, yet HIS country wiped out more people with the holodomer then you can imagine. Ukraine never forgot the horrors of the holodomer, and how delusioned starving mothers ate their own children. Why do you THINK they embrace N. Ideology?? To them, H. Was the antidote to the aftermath of the evil commited by the kremlin!"], ["@aaronobenour6126", "PUTIN2024"], ["@yourmommashouse", "1:24:19 WTH IS THAT!?!? Notice how he puts his foot down by pushing on his knee? I mean, it COULD be something else, but it sure looks like that’s what’s happening."], ["@NerdinessD", "trump and putin propaganda be aware!"], ["@gerrald5272", "I like his demeanor such a cool leader."], ["@kevin15533", "👍"], ["@kosheronlynobacon1542", "The man may be telling some truth but answer this how come he wont go into detail about who actually runs this country. He knows. He wont expose them. All you have to follow is the money it never lies. You cant get a complete answer from him . He wont explain anything in detail."], ["@kenankenan5848", "كانت اوكرانيا تخطط لي اغتيال كارلسون حتى تورط بوتن وبدعم امريكي انا لا افهم كيف لي امريكا ان تخطط لقتل مواطن امريكي من اجل الشحات زلنسكي كما قال ترمب أنه تاجر حرب لاغير ❤"], ["@melketsedekg2422", "BRUH"], ["@gabrielsantana7895", "joe Biden doesn't even know how the USA got texas😂"], ["@bumbuliiits", "I read comentaries and whant to womit.\nI listen to Putin shit I whant to womit.\nNow I understand how they washing heads in Russia.\nIts impossible how they believe his new history.\nEven in Latvia rus speaking history books where different of Latvian history. Thanks God there is just on language history books in Latvia."], ["@gregc8567", "Tucker you are a traitor - please move to Russia since you think its so great then you will know your children will be safe from the draft."], ["@Cristian-ej9nk", "China new slogan : divide&conquer! well done!"], ["@VascoVentura7", "Tucker is such an idiot 🤦 poor soul"], ["@newhorizzon", "Thanks bro"], ["@torenduske6022", "Putin is a 5 foot 7 stack of vodka bottles"], ["@rubenestrada7095", "@ 46:09 😮"], ["@Murkakis", "https://www.youtube.com/watch?v=iujfnx0FzxI"], ["@juliehartley3652", "300,944 Comments - who reads them?"], ["@papichris493", "I wonder how Russian citizens view our president Biden"], ["@WakaWaka2468", "14:10"], ["@MIRRA9999", "Putin said everything correctly. The truth of what is really happening."], ["@jackyan8925", "Welcome to China for interview"], ["@tyleranderson6533", "it seems that Putin is upset that an invitation to NATO wasnt waiting for Russia after the Soviet Union fell... but he contradicts this claim by then saying the growth of NATO was threatening..."], ["@user-nv4ue8kl9c", "Interesting fact. On the first day there were many comments supporting Putin with a large number of likes. After 2 weeks they disappeared. YouTube, you are worse than Stalin's NKVD."], ["@tyleranderson6533", "the pure arrogance seeping out of Vladimir is down right terrifying"], ["@ironman-ku6uo", "So quick Google search shows hat in 2014 the janukowitsh changed his mind and didn’t implement the things they agreed on and fled the country. There by making the treaty obsolete. Then Germany and Poland came together again and tried to persuade the new president to a peaceful solution but 2 weeks later thy started bombing anyway"], ["@TomasPruzina-uw9ql", "Putin does tell pretty stories like any politician/narcissist does.\nWonder if he would have an answer for pointy questions like why does he feed prisoners into the meatgrinder or how many tens of thousand men he got killed by his little escapade. Bringing his quote about his little green men in crimea after denying russian armed forces / SVD had anyone in crimea. Why certain republics contribute more youth into the meatgrinder than others, more wealthy regions. Who will pay taxes to feed pensions when working class dies in ukraine or runs away to prevent themselves from dying in ukraine. How long can he print money to pay salaries with affecting bottom line of poor people in russia by inflation."], ["@gabox01", "\"Volodya, what are you doing? Why are you supporting nacis?\"\nWhat a boss!"], ["@el_chino778", "time stamps please"], ["@atulrawat36", "The algorithm is not letting this video get reach."], ["@chillindylan9828", "Surprised to see no Ukraine comments"], ["@bradleymagana5334", "It’s absolutely insane that this video is not anywhere to be found, it’s literally delisted on YouTube. You have to go to his page to actually find it, wild times for “democracy”"], ["@nicholasjames8576", "Putin is allot smarter than our president that's why we need Trump everyone knows it before it's to late for this world."], ["@nicholasjames8576", "Tucker has balls though you must admit"], ["@nicholasjames8576", "I like Putin idc what people say 🤷"], ["@bema6741", "Cái gọi là dân chủ của các chính trị gia phương Tây thấy nó sai sai"], ["@nicholasjames8576", "Biden watching thanking that this is snl skit wow this is funny guys looks around nobody is there still thinks they are though"], ["@bema6741", "❤❤❤❤❤"], ["@carolw1624", "Interesting interview, well done Tucker Carlson for getting an audience with Vladimir Putin.  Netflix will be so jealous.  Prince Harry pitched to them he wanted to and they laughed at him (and probably rightfully so) but the idea was great and here is the proof."], ["@averyroberts1946", "ukraine was always apart of russia,thats literally what the word means,outer land"], ["@jn6bc", "ha ha 18mln views...freedom of speech"], ["@user-do6gn9jg5d", "чет мало просмотров ( им не нужна правда, правда нужна нам она для нас важна за нее мы стоим."], ["@voltsu", "damn... relatively unbiased journalism? from tucker carlson? this is unheard of!"], ["@NothosXXI", "Such an amazing interview. Thank you so much, Tucker, for bringing this to us!\nIt is common sense and now a historical fact that the loss of a USA and Russia partnership, particularly in trade, is one of the worst catastrophes in modern times. Trade brings prosperity and, with it, peace. Elections have consequences..."], ["@averyroberts1946", "im not gone lie,im a black man in ky,im a felon,im the eptiome of what ppl call me but yet i understand exactly where he is coming from,he doesnt want to hurt anyone that doesnt want to hurt him,its all a game from our govs  to keep all this shit going"], ["@al-bp1pi", "Just like guyana and venezuela"], ["@BrandonGGoodell", "Wow. No cuts in the interview that I could find. Just real conversations between two people. Respect to both of you."], ["@KremusNeo", "Now everything is clear"], ["@madeintexas3d442", "1:11:32 \"Who blew up nord stream?\" I couldn't stop laughing for 3 minutes."], ["@user-tv9si5xk1c", "But i love Ukraine ment"], ["@user-tv9si5xk1c", "My dad's Ukrainen so I don't really like him"], ["@Bogdanyegorshin-wq2fx", "Great interview and very informative, I’m happy people can receive a clearer understanding of what is happening between US and Russia"], ["@user-ee3ml6hs2x", "Колличество коментариев заморозили.🤣🤣🤣"], ["@cynthiadent2434", "Yep.  I already knew he doesn’t have any plans to invade another country and he is not going to nuke anybody.  That’s our government trying to use fear to create the situation they want to to line the pockets of the elite, in my opinion.  Not saying he is a great guy or not.  But there is no need to nuke anybody.  Nukes are now archaic and unnecessary weapons with the technology that the world has today.  Nukes are dirty."], ["@MauriceMischo", "Why is this video so hard to find in the youtube search?"], ["@user-zo3ww4fl3j", "What a confident, bold, and intelligent president, Putin is, Biden, no doubt, must feel intimidated, We need that type of strength in the oval office again, Trump in 2024"], ["@cynthiadent2434", "Can you interview Xi?  We are kept from any statements he makes or his opinion and workings with the United States, or I just don’t know where to look. 🤗"], ["@autumngrace8541", "Not without ice cream and nap breaks."], ["@averyroberts1946", "i can see how this went wrong,i think everybody in the midle was just messing everything up,the presidents are getting under cut cause theyre only in office every 4 years,thats a game show ,the ppl in cia are there til they decide their done,and they only get money if they have an enemy to defend against,you get where im going with this????"], ["@0707111161", "Putin-Hitler, one and the same."], ["@kennym3492", "Yicker.. upu still ssuck"], ["@averyroberts1946", "putin is really just like any old russian man with pride in his country,hes not some evil overlord trying to taker over the world,hes literally somebodyhs grandpa,i dont see how him and biden cant hash this shit out they so muchy a like,privileged fucks who saw they could rise above all like all the white men theyve seen and idolized their whole lives,i dontr think he wants to hurt anybody but i think a lot of sick shit is going on over there ,what does he know about that war? his soldiers think death ois better than facing the hand of their leaders,why is that?i gotta finish the view i just typed this a view minutes into it"], ["@user-ui2ut3rh9r", "Tucker Carlson - used microphone pod.\n\nТукер Карлосон - использованная подстилка для микрофона.\nМужики,  дайте ему в хлебало, за все нас, кто сейчас дотянуться не может"], ["@williamjkirwan5414", "An amazing moment in history. I realized just how low we, the USA, have become. WE as a country are being lead by idiots."], ["@manson2505", "Putin is awesome he saves everyone from USA he keeps usa in lone nothing butbrespect the great man"], ["@agavictoria", "OMG this interview shows how FAR America and Russia are in the sense of mentality. Mr. P is often being sarcastic and patronizing trying to show his superiority against his interlocutor, while Mr. Carlson is in oblivion to some of the subtleties. I feel like being American doesn't help Mr. C here. You will understand what I mean if you're Eastern European."], ["@nikolaloncar8368", "🇷🇸"], ["@PurePatriot", "Remember when Biden visited Russia and talked to Putin? Putin's response was that he couldn't believe that America had sent a houseplant to try to negotiate with him! If you ask me he was pretty kind with his remark!! I really like Putin, and as soon as Trump is back things will change very quickly"], ["@gustavorabino9353", "Putin's nazi argument is so bizarre, I mean at least say Ukraine nationalists or Fascists, Nazi's were Germans and on top of that Zelensky is jew, how can he support Nazis? Completely absurd.. What Putin really wants is to go against the Ukraine national movements who push the idea of a Ukraine Nation, this has been Putin's argument throughout the whole interview, that he denies the existence of Ukraine as an independent nation separate from Russia and that he wants to kill every political expression of Ukraine's nationalism but he can't say that so he uses the term Nazi's to refer to this movements so that he can strike fear and gain support from Russians."], ["@buddysdz", "1:34:32 La partie la plus intéressante, selon moi."], ["@gustavorabino9353", "There is a flaw in Putin's argument for starters, the original settlers of everything in this region came from Scandinavian countries, hence if we have to look back to history and look at ethnicity all the slavic countries from Sweden to Russia along with Ukraine have a common origin, also following the same argument all the territory beyond the mountains doesn't belong to Russian's but to Mongols ethnically different. Following Putin's Argument any country including Sweden could claim any other territory including Russia, in fact Sweden should have to claim Finland, Russia Poland and everything else since all of these nations Poland, Lithuania, Ukraine, Latvia, Estonia, Belarus, Finland share ethnicity. \nEven if we consider the Kievan Rus their epicenter is Kiev not Moscu and even a part of their territory reached Poland and so does Polish people have a claim to Ukraine as well?\nOver the years the Kievan Rus were divided in different kingdoms, Moscu being one of them and Kiev another. In fact, Kyiv precedes Moscu so it's not Russia that has a claim to Kiev and Ukranians it's the Ukrainians and Kiev who should have a claim to Moscu, since the epicenter of Kievan Rus was the city of Kiev, and so the Ukranians are original Kievan Rus and not the Russians. Ukraine is not a \"artificial nation\" it has way more identity than Russia itself. \nThe fact that Ukraine was part of Poland/lithuanian Commonwealth for 3 centuries after the dissolution of the Kievan Rus and the consequent mix of people and cultural assimilation separated them from Moscu as culturally different.\nThe letters sent from Ukraine to Russia in the sixteenth century and the following treaty of Pereyaslav that shifted Kyev alliance from Poland/Lithuania to Moscu also determined that the people of Kyiv were an independent kingdom as they weren't annexed by Moscu, they only formed an alliance in 1654, an alliance of 2 independent people, more importantly, this wasn't a democracy and so the people of Kyiv didn't have a say in the matter. \nHaving the same ethnicity doesn't give you a claim to a country, otherwise, Sweden/Finland should have a claim of all Kievan Rus territories.   Ukrainians had a completely different culture, they even spoke a different language as far as we know a language that was banned in the early 1800s by Russians meaning that they have always been enslaved and a hostage nation of Russia. In fact, Ukraine gained independence from Russia as a nation in 1921 after the  Ukrainian War of Independence of 1917 to 1921 produced the Makhnovshchina, Ukrainian Soviet Socialist Republic (in 1919 merged from the Ukrainian People's Republic and West Ukrainian People's Republic). The Socialist Republic of Ukraine existed since 1919 before the existence of the Soviet Union that was founded in 1922 by Russia and Ukraine as independent nations. From the very beginning of the URSS Ukraine had already been an independent republic since they had won an independence war and became unified as a nation 1 year before the URSS and this is also stated in the foundation of the URSS.\nCrimea on the other hand was part of the Ottoman Empire before Russia conquered however in 1954 URSS gave Crimea to the Ukrainian republic and so when the URSS fell Crimea belonged to the Ukranians. \nNow let's go to what really matters, the people that now live in the region are the original people of Ukraine and the majority don't want to be part of Russia and so by the principle of autodetermination Putin's arguments fall short both from a historical point of view as well as from the Ukrainian's point of viewwho voted for the president in free democratic elections to be part of European Union like other nation's of Kievan Rus origin like Poland."], ["@nasonschabell3441", "Thank you Tucker. This is important information that all Americans need to know."], ["@onknown66", "This guy doesn’t seems like the evil dictator that USA wants us to think. But what if the United States president were to be asked some of these same questions"], ["@davidisthis", "I would like to offer the idea of keeping score. America is bad. We are, I admit it. I suffer it, I'm not proud. But if we won't someone should Russia be a better choice? Let's keep count I offer. We can both do this. We can both play this game. Only we don't have to talk about what each other said but did which is a big deal in America. Words and actions are not the same."], ["@mexvader41.9", "This was really good. I've actually learned some things."], ["@vetabarbar2317", "Good interview! I am from Ukraine personally, I moved to US in 2016 and seeing what democrats have done to my country is insane.. the same goes to Ukrainian corrupt politicians, there is nothing worse than a ukrainian corrupt politician. They would sell their own mothers for the little bit of nothing. So when you put corrupt ukranian politicians and democrats in the same room that's what kind of result you get today. I can't wait for Trump to win and stop giving the money to the corrupt politicians of Ukraine, the amount of young guys that have been killed in this war is unimaginable and saying that this is only Putins fault is a very small minded opinion at least. I was still in Ukraine when the revolution has happened in 2014 and if you were pro west then you are good and if you are pro russian then you are \"Seperatist\"? Then democratic politicians coming to Ukraine to support the revolution? What kind of shitshow is that, now ukrainians are slaves begging for money it's hard to see watching my people struggling so terrible because of the lack of decent government. Look up Zelenskiy dancing before becoming a president, he was a literal clown and you want a guy like that lead the country?\nPlease stop the bullshit and get Trump elected finally."], ["@ellenmamaty8623", "Crazy how you can't find this interview in the search bar. I had to type the whole  thing out"], ["@user-dy1op2zx3r", "بوتن الرجل  الحديدي  لا يخاف من الخونة  المتملقين"], ["@davidisthis", "Listening to Putin a half hour in and I want to say I get that. But it doesn't change anything for us. We can offer you wisdom and or sentiments. But you must understand Putin represents a societal sickness to our way of life. We do not have to deal with guys like him regularly and we have no desire. I doubt he can understand what we mean and that appears to be because he is so far removed he can unlikely understand. I respect some of Russian society. The woman are beautiful in ways our society will not allow. But nothing is so simple that such things can make up for such suffering and damage. It does suck we have been over come by China. I already knew that. If it hasn't already, it will unless we make some real changes for the better. Hopefully we can. But to allow his plans to advance would be worse than allowing China's. China is a level headed nation for all of the things we fear. It has what I refer to as a sickness for my country but they have managed it pretty well. Everything is good and bad which is why good management and diligence is important. It takes a careful tool and Russia uses a hammer. They need to get out the measuring tape. Instead they're getting out the hammer. Trying to carve out land to increase greatness rather than improving efficiency. I am an efficiency guy. America needs to work on the same. Even though we are better at it doesn't mean we're well. We're not nearly well enough. It's only practical to always pursue better. I think if I could I would love to go to Russia and experience done of the beautiful woman. So I think maybe I should be nice. I'm an unlucky guy though. But I speak anyway."], ["@ItsKanye", "40:44 left off"], ["@KarKarich232", "Tucker: Why did you feel thretend?\nPutin: Would you like to talk about your cars extended warranty?"], ["@absolutezero5373", "“Short history 30 seconds to a minute”"], ["@GenFiftyTwenty", "\"Tucker Carlson Sits Down with Dr. Umar Johnson\"\n\nWho would watch it? Trying to see something."], ["@thisoneladykaty", "8:35 \n😅"], ["@Kunichay", "This question is for the Russian speakers was the translation accurate?"], ["@actualmom6839", "Using Putin's logic, Texas belongs to Mexico"], ["@IngmarKoecher", "Today: Russian History with Vlad in 2 hours"], ["@davidisthis", "That was a long thirty seconds."], ["@davidisthis", "Russia cooperated with Hitler."], ["@davidisthis", "This \"interview\" is convincing me that I do not want leaders acting like this. I don't want to be so negative about a world leader but my goodness. Can he please work on being bearable. I fell like he absolutely does not have real friends. Whose gonna go your house to talk about the the history of friendship?"], ["@ploc209", "free our americans foe nem 🇺🇸"], ["@davidisthis", "Oh my goodness, he's so predictable. The below comment I made before seeing the next part where I'm now watching an image with Putin holding the documents. He is so incredibly predictable it's making me feel like I'm good at this. Lol"], ["@davidisthis", "I like how he chose to use his words so carefully. He said \"the people who had control over the authority of the land\" instead of directly blaming the guilty party he suggests something that can not be proven beyond speculation."], ["@davidisthis", "You can tell that no one ever questioned him and that the media is telling the truth about him. He's a problem. No one could have convinced me to distrust him more than he did in this interview. This guy throws up red flags like crazy. I'm a person who is very available to this stuff but this guy scares me."], ["@davidisthis", "This is not an interview. Thus is just Putin talking. I'm not sure if this works in Russia, but with me the fact he can't do a real interview is very telling."], ["@NotenDop-wh2gb", "It's terrible a human is in prison who does not deserve to be there, but why is Tucker calling this 32 year old person \"a kid\"? Once directly, literally. Once indirectly. Strange."], ["@Proteus505", "I wanted to watch to see what the fuss is all about, but after having watched half of this, I can’t stand it anymore. Tucker is very naive and doesn’t know much about history and his questions just feed into Putin’s narrative which is very biased. People have called Tucker a useful idiot and that seems accurate to me."], ["@lastofthefinest", "I said from the jump this entire war was about the expansion of NATO. The U.S. should leave this situation alone."], ["@Habeberday", "Tofan Al Aqsa"], ["@nathancr6481", "It makes sense that he just basically gave a history lesson. Most americans don't hear the history that doesn't benefit them so they don't understand the historical pretenses which fuel the war in Ukraine. If one could just get it into the heads of the American sheeple that the areas Putin has been going after speak Russian, are ethnically Russian, and many who live there want to join Russia (not all but one could easily argue the majority of Ukrainians in the eastern regions Russia occupies are all of these). If one just looks at facts Russia is 100% justified to take action on Ukraine (the scale of said action is definitely debatable) so he's just trying to get that out there id imagine. He forgot his audience though, the American public views things through the lense of manipulatable emotions, not logic or facts. Good attempt and everyone needs to hear this though, I just wish the intended audience wasn't completely irrational."], ["@user-gj2qn8me4g", "Крутое интервью,правда рубит пропаганду"], ["@TonyBananas101", "\"I invaded a country because of shit that happened one thousand years ago\" 🙄"], ["@sppoitier1", "I would be terrified interviewing Vladimir Putin face-to-face. I'd be afraid of what he might do to me if I said the wrong thing or asked the wrong questions."], ["@legioner1747", "У нас в России просмотров намного меньше и количество лайков и дизлайков скрыты"], ["@rod7434", "Hard to watch this, you did not even ask the hard questions.  Why were you there in the first place Tucker?  Seriously weak."], ["@lars7411", "Tucker Carlson gets abducted by aliens!: https://youtu.be/AbuOmaA4ZRc"], ["@twk844", "To prosecuted in Hague soon…"], ["@sagani4860", "Путин напоминает мне мента из фильма Груз 2000, девушка - Россия, Родина. Пьянный насильник, которого пригласил мент - олигархи. Мать мента - мы, народ. С какой надеждой девушка кинулась к матери: спасите! Мать ответила - он твой муж (президент) ты его слушайся! А могла бы схватить его за шкирку: ты садюга, ты что творишь? вон из МОЕГО доме! Но нет, народ тихонько бухает на кухне."], ["@Anfield_the_place_to_be", "I guess 95% of the comment are from bots... Its not a Interview, it's a monolouge without any critical questions. \n\n\nJust as bad as you would think of from Tucker"], ["@HeatSeekingMouse", "Palestine will be free. The US will fall."], ["@Quantumfluxfield", "100 000 people dislike a interview no one else dares to do.."], ["@maras2306", "History is simple zssr and germany started  IIWW . Find the document Ribbentrop-Molotow agreement, it is a agreement for invasion on Poland in 1939."], ["@mayapram", "Are you afraid to hear the truth that you’ve been used, as many “useful idiots“ before you!"], ["@user-wb9rb5hs2w", "Pure proganda...is Tucker this stupid? Putin's version of history is insane, which we already knew, but Tucker is promoting Russia, like a fool. No American would rather live in Russia."], ["@user-rw5wc3bw6u", "https://youtu.be/pMmHBGOasck?si=WyUfrmgctfnJS2iy"], ["@andrealuna984", "kudos to the translator, amazing, and tone he speaks with, he is telling a story, I am speechless"], ["@JetFlyGaming1bd7249ff8", "They don’t want his side of the story to get out. Because we pay for the war."], ["@JetFlyGaming1bd7249ff8", "18 million views on this is not enough tbh. This vid should have 1B views"], ["@dryan456", "Too many twisted fucks with their own agendas pulling the strings in the  nato crew ."], ["@serialchiller1099", "1:51:11 shadow being at the back statue \nEdit: and they talked about spy and stuff after"], ["@Earth_Extreme", "Hey Tucker, Alternative media indicates the Russian security forces arrested a Ukrainian assassin who was hired to kill you whilst you were in Russia. If this is true or not, please make sure your personal security is reviewed ASAP."], ["@user-qq4nk8kk8q", "Почему не на русском?"], ["@user-wd7uc6fx8k", "Очень приятно читать комменты, приятно понимать,  что люди во всем мире пытаются объективно увидеть ситуацию и сделать свои выводы, сформировать  собственные точку зрения,  а не навязанную правящей элитой!"], ["@user-wr6zc4bs2u", "The couple of subtle insults he threw at tucker was great 😂"], ["@MD-xs6fx", "Russia is not loyal to opposing religious views or there would not be hundreds of Jehovah' Witnesses in your prisons for serving their God. The Orthodox stands in opposition to Jehovah therefore Russia (who is in a partnership with the Christian Orthodox) shares that sediment. Not to say that other governments fare any better but anyone waging a war against the true people of God has never won. Hitler is a recent example when he placed thousands of Jehovah's Witnesses into concentration camps. Joseph Rutherford publicly denounced Hitler' action and foretold Germany undoing. The rest is history. No nation that choose to war against Jehovah has ever won … be it Egypt, Assyria, Babylon, ancient Iran or anyone today. No one ever defeated Jehovah or his people."], ["@jesterthefurrygod3330", "Is our Tax Dollars also going to Russia or just Ukraine and is it a good thing?"], ["@lggmez", "perfect work!! society really needs this kind of journalism."], ["@daniellc5160", "Writing history, with arguments 💯 .👍"], ["@user-rf47CwB72", "I hope to see Carlson in the same dock as Putin in an international court. Blood money doesn't smell, right Carlson?"], ["@chrispauls7178", "Here Putin is saying what everyone knows. Biden is not a factor and hes not running our country. So why would Putin call him? But he doesnt highlight this bc a weak US President is good for the tyrants of the world."], ["@inzourock2753", "PUTIN is G   TOP P  🔝💪💪 from 🇩🇿🇩🇿🇩🇿"], ["@carolrocky9803", "Mr/ Putin are you still accepting American refugees?  Sounds like NATO is playing US like a fiddle (using all nato members like slave.  NATO controls Presidents, like Bill Clinton, Bill Gates, etc and is probably order every world leaders.  NATO wants to destroy the world.  Sorry Tucker, I know you understand what is actually happening and as a reporter you (hopefully) are playing dumb  to draw out his answers.   Biden is going to miss the time to come out of this mess without egg on his face,   America is dead like it's petrol dollar, and what ever replace it, or it switches to a barter system and cut off the old regime, and start a New Nation with our Construction that the old illegal Joe Biden regime.  US which IS NATO they refuse to do anything to make peace.    He offered and received a signed agreement Russia has been more than fair.  NATO is unwilling, it will be too late to come into peace talks.  NATO & US want war, Russia doesn't."], ["@kob-dotu", "Дурачьё продолжает писать про предательство... Он вас глупеньких от 3-й мировой войны спас. У Западных лидеров пелена на глазах - они уповают, что по ним не прилетит. Только они ошибаются и Путин это ясно высказал в интервью."], ["@Kill_angel", "Удивительно, как быстро после этого интервью умер от отравления Навальный. Повестка перебита. Отличная работа западных спецслужб. Ох ну разумеется, я не права. Да. Это просто совпадение."], ["@user-yn1sn1nd5v", "https://youtu.be/d6m1XrjmoMU?si=UdpunyCcACFYiok7"], ["@nonharrybulz9380", "We Americans aka westerns really needed to whiteness this interview. Our media is completely corrupt and chooses sides ."], ["@vladponomarenko9096", "Also very funny about Bandera and neonazism. Okay, but why didn't mention Vlasov and other RUSSIAN collaborationists? There are still very nany nationalists in russia, it's open information if you will dig in a little. Just THINK when listening such interviews"], ["@gabehernandez7793", "Lol the rejection of Russia is crazy , but when you see U.S. officials reject Gaza cease fires ….. just MAKES YOU GO HUH 🤔"], ["@karlhanskaelep3963", "Laugh to the face of one of the world leaders.. \nRight of the path.."], ["@oxana1029", "❤❤❤"], ["@unknownP88", "Ряяяя однополовцы и печенегры напали на Рюрика, а потом Ленин придумал Украину, пока Богдан Хмельницкий снимал копии со своих писем."], ["@basukalasuresh97", "Great leader Vladimir Putin"], ["@LunnarisLP", "People saying \"oh biden should do this and that\" implying he couldnt seem to have forgotten that he has debated trump in TV interviews for hours as well, and clearly was articulate enough for the country to vote for him instead of Trump. (Oh wait ofc the election was \"stolen\" I forgot lmao)"], ["@DeetoxsGG", "I hate how he kept cutting putin off let him speak then ask ur questions. Fuxk"], ["@irmansyahfii1228", "Big and strong"], ["@lordfabri", "it's amazing how this CRIMINAL PLATFORM is hiding already this interview within their shitty algorithms . History will pay back your arrogance, it's just a matter of time. Very soon."], ["@kinyuanjeri", "Putin's understanding of world's history,  international law, and science is overwhelming!\nCongratulations Tucker Carlson for the bravery 💪🏿"], ["@masterpopeyoda3290", "Why was he staring at him like that though"], ["@user-zr2im7pm8b", "I know Putin is a good person ❤"], ["@grumpydinosaur2347", "No hard questions asked, half of interview is pseido history with misleading information or straight up lies."], ["@flyhighseeall8271", "Tucker is not to be trusted"], ["@all.music.official", "bro this got shadow banned only 18m views?"], ["@live.to.give.", "Here is a president who loves his people and country. God bless him!"], ["@TekTrader360", "I'm nervous for Tucker because Americans can be arrogant and self-righteous."], ["@Stolencamaro", "Like if ur comment got deleted"], ["@roseb4453", "Why aren’t you packing your bags…This is the most sickening mess I’ve seen in my entire existence."], ["@killer_agent47", "Мы русские устали от европейцев   и американских людей слышать в сторону, России без причины из ваших уст говно.Россия вас не трогает, а вы воняете.Если бы Путин хотел щёлкнуть 🤌2двумя пальцами и Украины бы на карте мира бы не было как же вы потом бы свой рот открывали все но нет, Путин добряк.В 2014 году Украина кричала, что будут резать и есть русских младенцев, насиловать Русских женщин жарить пленных русских солдат.Видео поищите 2014год в Одессе в профсоюзном доме заживо сожгли людей когда те вылазили из окон стреляли по ним варвары что не наесть ещё в сторону России кричат.И с чего вы вообще взяли, что.России бы применила ядерное оружие по Украине.У нас танков самолётов больше, чем в вашем самом НАТО в целом.Мы делаем электрички, поезда, подводные лодки, ледоколы.Я уж не говорю о гиперзвуковых ракетах циркон.Или S 500 Прометей, которые могут сшибать ваши американские спутники🛰️.Без которых вы будете беспомощные, но это уже 3 мировая.Или просто глушить их радиоэлектронной борьбой.Если после войны НАТО с Россией, мы уничтожим весь ваш флот.Вы воюете НАТО вас 100 стран.Россия одна вы содной Россией справиться не можете, куда уж вам Китай.Вас один Китай🇨🇳шапками закидает.Америка скинула ядерную бомбу на Японию такой был адрисован привет конишева.А японцы смешно утверждают, что это сделал советский союз С С С Р. А когда приезжал ваш Байден старичок в 2023 году в Япониию даже не извинился за это.Особенно смешно слышать, когда барель говорит, что они живут в детском саду, а все остальные джунгли.Смешно слышать, когда европейские людишки вместе с американскими.Вы говорите что Россия куда то вторглась, вы считаете, куда вы вторгались Сирия Йемен Ирак.Со счёта, можно сбиться, сколько людей поубивали побомбили.Привыкли воевать с пастухами.Американские люди, а как вы воспринимаете свободу слова свою демократию которой нету.Сказал правду о войне твою карточку, заблокируют, живи как хочешь, занесут в чёрный список и никогда на работу не устроишься.Прокормить мы себя сами прокормим с голоду не помрём, а ваши санкции это просто щекотка.Ваши санкции как раз и является предлогом войны.А не Российская дешёвая нефть с газом.Америка всегда была спонсором фашизма, терроризма только Россию  сделали страной терроризма мы понимаем, вас же много а России одна.Конечно же, Путин во всём виноват, ураган начался, Путин виноват, колесо спустило, Путин виноват.Когда Россия говорит об Америке и Европе то вы Европейцы и Американцы перекидывайте все же наши слова в нашу сторону обратно, когда вам самим сказать нечего как у нас в России говорится, когда правда глаза колит."], ["@killer_agent47", "Мы русские устали от европейцев   и американских людей слышать в сторону, России без причины из ваших уст говно.Россия вас не трогает, а вы воняете.Если бы Путин хотел щёлкнуть 🤌2двумя пальцами и Украины бы на карте мира бы не было как же вы потом бы свой рот открывали все но нет, Путин добряк.В 2014 году Украина кричала, что будут резать и есть русских младенцев, насиловать Русских женщин жарить пленных русских солдат.Видео поищите 2014год в Одессе в профсоюзном доме заживо сожгли людей когда те вылазили из окон стреляли по ним варвары что не наесть ещё в сторону России кричат.И с чего вы вообще взяли, что.России бы применила ядерное оружие по Украине.У нас танков самолётов больше, чем в вашем самом НАТО в целом.Мы делаем электрички, поезда, подводные лодки, ледоколы.Я уж не говорю о гиперзвуковых ракетах циркон.Или S 500 Прометей, которые могут сшибать ваши американские спутники🛰️.Без которых вы будете беспомощные, но это уже 3 мировая.Или просто глушить их радиоэлектронной борьбой.Если после войны НАТО с Россией, мы уничтожим весь ваш флот.Вы воюете НАТО вас 100 стран.Россия одна вы содной Россией справиться не можете, куда уж вам Китай.Вас один Китай🇨🇳шапками закидает.Америка скинула ядерную бомбу на Японию такой был адрисован привет конишева.А японцы смешно утверждают, что это сделал советский союз С С С Р. А когда приезжал ваш Байден старичок в 2023 году в Япониию даже не извинился за это.Особенно смешно слышать, когда барель говорит, что они живут в детском саду, а все остальные джунгли.Смешно слышать, когда европейские людишки вместе с американскими.Вы говорите что Россия куда то вторглась, вы считаете, куда вы вторгались Сирия Йемен Ирак.Со счёта, можно сбиться, сколько людей поубивали побомбили.Привыкли воевать с пастухами.Американские люди, а как вы воспринимаете свободу слова свою демократию которой нету.Сказал правду о войне твою карточку, заблокируют, живи как хочешь, занесут в чёрный список и никогда на работу не устроишься.Прокормить мы себя сами прокормим с голоду не помрём, а ваши санкции это просто щекотка.Ваши санкции как раз и является предлогом войны.А не Российская дешёвая нефть с газом.Америка всегда была спонсором фашизма, терроризма только Россию  сделали страной терроризма мы понимаем, вас же много а России одна.Конечно же, Путин во всём виноват, ураган начался, Путин виноват, колесо спустило, Путин виноват.Когда Россия говорит об Америке и Европе то вы Европейцы и Американцы перекидывайте все же наши слова в нашу сторону обратно, когда вам самим сказать нечего как у нас в России говорится, когда правда глаза колит."], ["@cengizgizmen3040", "The Russian to English translator did an EXCELLENT  Job with Perfect English ."], ["@rudhoc8843", "Интервью на русском, (можно включить субтитры на английском) https://youtu.be/ncPW2pyOzJU?feature=shared"], ["@grobarSubotica", "Tuck why dont u interew Biden???"], ["@d4rd1v79", "I like Putins logic. Then we can talk about\n\nOblast Kaliningrad to poland\nOblast Murmansk to finland\nRepublic Karelia gets independent\nOblast Pskow and Oblast Leningrad (and the city) will get shared between the baltics.\nRegion Krasnodar, Oblast Rostow and Republic Krim (with Sewastopol) to Ukraine.\nRegion Primorje and the south of the Region Chabarowsk to China.\nOblast Sachalin to Japan"], ["@Upgraded4552", "Thanks Tucker. Amazing job. Now go interview Zelensky. 😜"], ["@Dragon._.88", "Это 😮😂\nвсё равно что против Ветра💪🐲 \n*Всем ..* 😁  *плевать ..* 😱🥱😫😫😴😪💨💦🤧🤧😷🙊🙊🙊🙊🙊🤣🤣🤣🤣🤣🤣"], ["@icedcoffee9937", "Someone is telling Putin what to say…he speaks English…"], ["@lawrakasarkarhai2347", "American People stand for Palestine ❤"], ["@Dragon._.88", "Прямо как пародия Юрия Великого 🤭🤭🤭🤭🤣🤣🤣🤣🤣🤣🤣😂😂😂😂"], ["@Dragon._.88", "У Карлсона такое \nлицо 🤭🤭🤭🤣🤣  👉😳😳😲😯😕😕🫤🫤😟😟😟🙁🙁🙁🙁☹️☹️😟😟😲😲😟😟😟😲"], ["@Dragon._.88", "😂😂😂 описаюсь 🚽🫣🤣"], ["@CovntFapula-uc1gl", "History time with Vlad. 📚"], ["@Immortal-xf1wf", "German guy here and I am ashamed when they Talk about our leadership we really became the Clowns for everyone and the btch for the US"], ["@vladponomarenko9096", "I really like how putin start saying \"for some unknown reasons\" were the situation going in other side than his propaganda) very funny to look at it really"], ["@aceroces", "Russia 🇷🇺 is a great nation ❤️"], ["@vladponomarenko9096", "As I remember in 1930-1945 we also had one political leader that were sure for 100% that there are no some nations and some nations are \"not the right one, as OUR nation\") i don't see any difference really, don't know how stupid you need to be to think that history can be an excuse for providing war for territory nowadays. For such logic there is NO NATION that were impartible for whole history. Though russia wasn't on the map from the creation of the people, so maybe some cave people would also their lands back, why not? Such a stupid try for excuse of starting the war, that i am still in shock how someone really believe it."], ["@cozmas2003", "bravo Sucker Castro!"], ["@momo-zm1ex", "26:56 mark down\n1:02:37"], ["@420BudNuggets", "Why does Tucker always look like that 😂"], ["@Bxbybxrkxn1", "This was amazing!!!"], ["@swekz", "This interviewer didn't do his homework. Even if i am not russian i know the history and i knew this was the reason of the war"], ["@simonlee7077", "Putin is a skilled liar, the most manipulative narcissist you will ever meet. That's why y'all are falling for his tricks. Russia is an enemy of America and has been since 1945 onwards. You're gonna forget about the gulags now? The protests being crushed in the eastern bloc, the poisonings of his opponents, invasion of Georgia and policy of targeting civilians? I ain't buying his BS only because he speaks calmly compared to US politicians. He is a kleptocratic who steals resources from his country, then lies about it. Despite Biden being a pathological liar, I support the US government is on our side and I support it 100%. End of story"], ["@ekstraktekstraktive4398", "youtube, still stealing views? shame on U!"], ["@mchonorov", "The number of views tell that majority of US population doesn't give a shit who Putin is"], ["@mchonorov", "Tucker you are a kind of a dolbaeb to intervew a killer"], ["@TykeStarr", "Interesting to hear world war 2 is known as The Great Patriotic War in Russia!!"], ["@henrywhh", "The Soviet government kept roughly 1.5 million German POWs in forced-labor camps after the end of World War II through 1956."], ["@icantthinkofaname158", "52"], ["@remo.riffert", "@1:14:27 I live in germany. Just hours after the northstream explosion, Kanzler Scholz (german Kanzler) stated: \"We don't know who blew up north stream, BUT we do know that it was not the USA.\" \"We asked them and they said it was not them.\" Scholz just claimed it with such impudence, and totaly out of context, that it was obvious that he was lying."], ["@haroldi.6450", "Putin is a master communicator. Learn alot from this interview"], ["@d-.-axx", "US PLEASE take the PEACEFUL-STAND on ARRANGEMENTS"], ["@dzonius", "Sweden Welcome to NATO."], ["@bogdatom6303", "New history is finally discovering by the Putin the Lier 🤣🤣🤣 I am surprised that inteligent men Mr. Carlson is listening to this bull shit for 2 hours"], ["@thechosenone889", "Dialogue is what matters most. Thank you Tucker!"], ["@reoire843", "The more I hear about the Russian perspective, the more sympathetic I feel toward the Russians. Here in America, so many people just go with the herd mentality which they pick up from the internet. It's an overly-simplistic concept: \"Russia = aggressor, Ukraine = victim\". Their response is to throw up a Ukrainian flag graphic on their social media profile or wherever. Why can't people learn that the world is not black & white like that? Reality is far more complex."], ["@amandamurray6238", "this is amazing piece of history in real time..  there IS hope there is a FUTURE."], ["@telmoguimaraes8885", "well Putin is well educated but if we all go to 1654, PORTUGAL ruled the world"], ["@Amanda-ul5nr", "Yes Putin hads said this from he beginning of the war- he wants to restore the ussr"], ["@namkyluctinh1856", "Mr. Tucker Carlson ! This is great that the world gets to know the truth about Russia through you. Can you let the world hear from President Biden about the outstanding issues that America is relevant to in the world today."], ["@ludmilaandr8793", "Great to see two intelligent men talking."], ["@family_inpartnership5896", "Removing his wrist watch, was the 'appetiser' for anyone watching, to get ready for a long conversation👌"], ["@len9743", "Tucker looks like such a dweeb with that stare lol. What a cornball."], ["@sakshamtyagi3452", "This clearly shows west have no sense of history . Their history is as bad as handwriting . They only remember 200 years of history"], ["@DaddyElfMan", "President Putin's answer to Tucker about ' Joe Biden's answer' and what he said to President Putin.   I feel here that President Putin sorta dodged the question.  It would have been nice to actually hear his side of what was said between them, as long as no state secrets or such was exposed."], ["@DaddyElfMan", "Tuckers question at the 1 hr mark, was a good question, very specific. I feel that President Putin's prior answer (was a very good one) and his reply to the specificity of Mr. Carlson's question, was, in my opinion, was also good."], ["@pennyserenade192", "Always have agreed with  your pov and have watched  your career closely but this... doing this was a total mistake."], ["@ignatziusturret5641", "Johnson from UK was the successor of May. Her husband works for an American investor company as \"relations manager\" holding almost 5% of Rheinmetall. It is all about money of some few. The \"money elite\", hiding it in British and US tax havens. Simple."], ["@Handskemager", "I’d say, eastern european history is not my forte, but if what Vladimir Putin states is true, I totally get his choice in reclaiming it.\n\nThat being said, there are numerous reasons for him to be less than truthful giving what’s going on. I hope he’s truthful though, for the sake of Russias future."], ["@DaddyElfMan", "been busy the last couple of days, getting back to watching more of this interview, about 1 hr in so far.   More comments to come, thanks to all for any reply."], ["@ignatziusturret5641", "Putin is certainly one of the smartest leaders on earth right now. Greetings from Germany!! Don`t take our media propaganda as sign for our opinions."], ["@sookiebyun4260", "I hope Tucker has a translator in his ear!  😂😂😂  You need botox, Tucker!  Relax!"], ["@ourcorrectopinions6824", "Is there a version without the dubbing and just subtitles? I'd rather hear the voice of the person actually speaking."], ["@lesliewood4069", "Putin is a very smart guy."], ["@constantincoratella-rotnov3678", "Good Interview ! 😉"], ["@teamspicy1", "Great interview!"], ["@prodigygod1", "Most clear thing I heard from Putin is the USA is killing itself while within and abroad with no upside. We are getting nothing."], ["@erikjonsson6594", "So for peace why doesent he pull out his troups or choose not to attack in the first place.."], ["@BRANDONALEXISR", "I love the first point, \"not is América its unite state\" that is truly amazing"], ["@calabronegigante", "💪🇷🇺♥️"], ["@lesliewood4069", "Thanks Tucker👍🙏🙏🙏"], ["@jblake3143", "This is what should happen We need to sit down down as talk that doesn’t happen all the time. This is what needs to happen As an American I need Putin’s point of view and see why this is happening."], ["@MadRusskiy65", "WOW, it's Poland's fault that Hitler invaded then It's Ukraine's fault that Putin Invades then Putin = Hitler."], ["@user-us2nc6uu1s", "Ukrainian casualties. The irretrievable losses of the Armed Forces of Ukraine since the beginning of the conflict have reached 536854 people. 214883 of them killed. Another 62,000 are disabled, prisoners and missing persons who do not take part in hostilities. Temporarily discharged due to injuries - 864,374 people. The total losses are 1 million 400 thousand people. During the year and a half of the war, the Armed Forces of Ukraine were completely replaced almost 2 times, in March 2022, after the mobilization, the Armed Forces of Ukraine just had a peak of 850 thousand people."], ["@user-us2nc6uu1s", "The bloodiest battle. in Bakhmut. RUSSIAN SIDE - 78,000 mercenaries. Of these, 49,000 are prisoners from various penal colonies in the Russian Federation. As of May 20 2023, 22,000 mercenaries had been killed and 40,000 wounded. UKRANIAN SIDE - 221 units and subdivisions of the Ukrainian Armed Forces took part in the battles for Artyomovsk. Irreversible losses, including those killed at the Armed Forces of Ukraine, as of 22.02.2022. in Artyomovsk amount to no less than 55,000 people. This represents approximately 1/5 of all UAF losses at the time the Ukrainians were defeated."], ["@user-us2nc6uu1s", "Putin is not lying about Boris Johnson. The conflict could have ended in the spring of 2022 if Ukraine had agreed to neutrality, said David Arakhamia, head of Zelensky's Servant of the People party. Answering the question why Kiev refused to agree to Russia's conditions not to join NATO, Arakhamia said that this decision was also influenced by the British Prime Minister. \"Moreover, when we returned from Istanbul, Boris Johnson came to Kyiv and said that we would not sign anything with them at all. And \"let's just fight,\" he said."], ["@yakobjalali", "1000 time more capable than sleepy joe"], ["@yakobjalali", "King Putin"], ["@user-us2nc6uu1s", "In 1959, when Bandera was assassinated, the US stepped in with operation Aerodynamic that culminated in 2014."], ["@user-us2nc6uu1s", "Again, how Britain revived the Ukrainian conflict after the war when it could have ended with the German defeat. Citation from Grzegorz Rossolinski-Liebe, Stepan Bandera: The Life and Afterlife of a Ukrainian Nationalist: Fascism, Genocide, and Cult (Stuttgart, Germany:  Ibidem,  2014), 654 pp.,"], ["@user-us2nc6uu1s", "How Britain revived the Ukrainian conflict after the war when it could have ended with the German defeat. Citation from Grzegorz Rossolinski-Liebe, Stepan Bandera: The Life and Afterlife of a Ukrainian Nationalist: Fascism, Genocide, and Cult (Stuttgart, Germany:  Ibidem,  2014), 654 pp.,"], ["@Caleb_Mandrake872", "1:17:51 - USA leaders are destroying their main strength."], ["@user-os4yp8fv8s", "Правду говорить легко и приятно! 2 часа ПРАВДЫ! Браво, Владимир Владимирович ! ❤ Вы наш национальный лидер и Государь всея Руси. И да, вам не с кем договариваться - на той стороне лгуны и предатели."], ["@pranav8937", "Why are you deleting comments??"], ["@toneloke7489", "America from the 60's to the 90's would have arrested Tucker for being a Russian spy, WTF happened to the Republican patriots??  Regan would have kicked tuckers' @ss"], ["@toneloke7489", "Little Tucker is the only American journalist that can go to Russia, and interview Putin without being arrested and tortured in a Russian jail. Why? Because Tucker's not a journalist, he's a Communist propagandist, that loves Putin and the Russian way of life, he's anti America, and against freedom and democracy, yet you so called \"patriots\" love this guy???  Check yourselves."], ["@tomaszsadowski1515", "Beautyfool , but You were not prepere."], ["@thaddeus1519", "America played dishonestly. Won the game. Rewrote history. And then tech came and they got to own and leverage that into inconceivable perpetual power.\n\nHistorically he’s right. Ukraine belongs to Russia. But we rewrote it. And according to our history he doesn’t own it. And we are the super power. So he won’t get to have it. Period."], ["@jahbombarecords", "Thank you for good job, Tucker. As a Russian, I am pleased that you brought this speech to people without distortion :) You are the real hero of America. As Putin said, reunification will come. Hopefully not only between Russians and Ukrainian. Unite! United we stand."], ["@ImNotPhaT", "As an American, I LOVE Russia thanks to Trump and Tucker."], ["@markuslc1888", "impressive, how someone can lie almost 2 hours with getting red...so much lies on a perfectly high level...KGB specialist at it's best."], ["@carlabotelho7848", "Putin is a liar . He said he wouldn't invade Ukraine and did  it  . All Europe will be in danger ,if Putin gets Ukraine , and after that China will attack Taiwan and the  USA,  cannot go to both places as it happened in the 2°world war and Europe is not ready to fight Putin yet.  Unbelievable how we are letting Putin win  . Be ready the next country invasion  will be Moldova. American people think  the war  is too far , but with Russia from the left and China from the right ,America is in the middle as we are in Europe. Some American people believe if Trump wins the election it will stop the war . As a European I'll say NOTHING WILL STOP PUTIN . He has been working in this for 20 years."], ["@kingghidorah5213", "I love how putin mocked him afterwards"], ["@Caporal_Blutch", "And finally, US President Biden rise to the high level of this geopolitical discussion and replied : \"Son of a bi... !\""], ["@tylermcclelland8641", "https://youtu.be/gNOFMXDgF44?si=gTwSbubzy9YHT3qV"], ["@asdftreeful", "\"I'm not sure if Russia should go back to 1654 borders.\" Translation: \"I can't say that I want those borders but obviously this is what I want.\" As Tucker Carlson sits there smiling like a fan boy. \r\n\r\nPutin gives his history lesson and glosses over why the borders are what they are now by saying 'unknown reasons' or 'I don't understand the reasons'. Translation: \"I give no credibility to the current borders and want 1654 borders."], ["@Lenin_75", "Здравствуйте! Невежество в истории страны от гаранта во всей красе, ключевое что даное трактование истории выгодно правящему классу буржуазии в стране! Данная трактовка истории страны дает сушествующему классу буржуазии созранить свою диктатуру и частную собственность/приумножить её и оправдать её приумножения!\nГосударство - это инструмент насилия в руках правящего класса: Поаво - это воля правящего класса возведённая в ЗАКОН — в капиталистикой системе правящий класс БУРЖУАЗИЯ, классу пролетариата (трудящимся) уготована повышенная эксплуатация труда и угнетения прав! Явление капиталистической системы с диктатурой класса буржуазии бороться нужно не с явлениями а с системой, которая направлена на извлечения прибыли в свой карман класса буржуазии! Трудящимся разных стран между собой нечего делить и незачем конкурировать - из объединяют умение трудиться и общие интересы, тогда как буржуазия их сталкивает в специальных операциях на; исторических искажениях, традиционных ценностях, глубинной народности, национальной исключительности, веры, национальности, патриотизме - все для извлечения прибыли и увеличение своей частной собственности!\nСуществует только классовая борьба между классами пролетариата и буржуазии, если ты не за один класс значит ты за другой класс!\nПРОЛЕТАРИИ ВСЕХ СТРАН СОЕДИНЯЙТЕСЬ!\nСоциализм и интернационал - прогресс, мир и свобода для всех трудящихся Земли в бесклассовом обществе и спасение планеты!"], ["@anthonyrichardsjones6261", "From someone that speaks in a succession of whistles, pops, clicks and waves 👋🏼 I thank the interpreter from the bottom of my pop click woooooo weeeeee"], ["@qua4836", "Anyone here after The Change Health Care Cyber Hack ??  Watch out for the False Flags !! America has been High jacked.. This is why they teach us Racism. To keep us divided!! A unified Country would never allow this!"], ["@Sarah-jz2lh", "When does the interview start? I watched the video up to minute 42 and so far it's basically just a monologue by Putin interrupted by very few questions of Mr. Carlson to which Putin does not really provide answers to. Does it get more interesting at the end?"], ["@edwardprofit4537", "Trump would just fall down and grovel at the feet of Putin which he basically in Helsinki while throwing US Agencies under the bus. Biden would stand up against the atrocities being done by Russia."], ["@Kaizer5E", "\"When Hitler asked Poland to give it back amicable, they refused.\"  Carlson: \"Of course.\" - That's some hard hitting journalism there Tuck. Way to agree with everything he says."], ["@hd-be7di", "I googled for this interview with the exact words \"Tucker Carlson Putin interview\" and it didn't find or show this video (on their own platform no less). Yea nothing suspicious with Google's search algorithm... Does the EULA anywhere state that Google may alter my search results for politically driven agendas or reasons? Where is the impartiality?"], ["@wookie3113", "One by one, these comments disappear😂 Truths are an act of rebellion!!! Love it."], ["@wookie3113", "Oh, I must have posted a truth that had to be removed? Guess they where all on the members list😂! YOUNGGLOBALLEADERS DOTnating ORGans? IMF same BANKSTERS who run interference when Russian Presidents have deals with Puppet Presidents?"], ["@wookie3113", "Tuckers a slow learner isn't he? I don't blame him. I see it everywhere I go! Once promising intellectuals dumbed down.  Victoria Newland and John McCain did the coup! Via the CIA. President Putin has told you that every time he has came to the, \"Free Worlds\" President? That the CIA has stepped put from shadows of running the \"Free World\" to make decisions contrary to those we have \"Elected\" via computers programed by CIA. Starting to see a theme here? I would imagine Putin has to. Now shall we talk about who the CIA Really is? Did the Nazis really loose the war? What do Iran, Iraq, Afghanistan, Lybia, Syria, North Korea and Russia all have in common? NON WORLD BANKING COUNTRIES! SYNAGOGUE OF SATAN. It's unfortunate as I see where all this is going. I just simply don't see a way for America, ran no longer by Representatives that Represent the people to not spead death and destruction around the globe without a total loss of all the SYNAGOGUE. Don't want to say anything to controversial, or really just don't want a visit. This ends only one way. That's all! They don't want peace! They want what all their profits have written about! The new golden age. As Quigley he can clue you in"], ["@show_me_your_kitties", "He really got Putin his place."], ["@scottbaxendale323", "Does Russia have media talking heads who work for Biden in the same way Tucker has been working for Putin? I have yet to see those folks."], ["@scottbaxendale323", "Here is the real Tucker Carlson: https://youtu.be/SkFF0fTwddk?si=ptOuz52lODEiCde6"], ["@como-mensajero", ". anticristo ruso trapeo'  el suelo con el entrevistador amerikekis....ni historia supo......"], ["@imin2905", "It is Russia s addiction to occupy neighboring countries (like drinking vodka for alcoholic). America and EU will cure it."], ["@TheNME", "As a job doing russian, translator did person well!"], ["@show_me_your_kitties", "He's saying what so many American citizens have been exclaiming: Why are we backing Ukraine?! Put America first, please! This fight is not ours and I understand why VP did what he did."], ["@Kirgo6774", "You didnt ask Putin why is he lying to his people in russian TV. I saw what is on their official TV -> it was full of bullshit about our country and other countries as well -> about, how it works here, what we do here. It was not true. Far from true. Very far from true, yet they say it is. This leads me to an idea, that most of the russians have no clue about world outside their borders. Their goverment have no clue what is happening in the world ? Or they lie on puropse to their own whole nation."], ["@paolocarl.8205", "what a pathetic little traitor"], ["@nikolaireinke2629", "All we see is a lackluster journalistic blunder - it is actually impressive how he manages not to ask a critical question, but instead offers Putin a stage and simply accepts his (obviously deliberately placed) long monologue. Shortly after its broadcast, this interview was already instrumentalized by the Kremlin to relativize the West's reaction to Navalny's death."], ["@d4rd1v79", "Poland started the war, UK did the holocaust, and Russia was growing tulips, helping homeless and inventing cure for cancer in the meantime. Molotov- ribbentrop pact is construct of nazijews growing nuclear platypuses in Washington. Invading Poland was just a military drill by borders. - Russian history books."], ["@hamayoonshah1990", "A 1000000 times more competent than Joe Stupid Biden"], ["@richardcurry4912", "Putin's right."], ["@SenorJoeBiden", "What a fool-hardy legacy, full of death, war, and destruction"], ["@JurassicB8245", "Zzzzzzz"], ["@50043211", "My personal highlights: Poland started WW2, the Three Days Special Operation is now in its third year, Russia will never suffer a strategic defeat - Afghanistan sends its greetings. Is that what they teach in Russia as history nowadays? 🤔Tucker is the greatest journalist alive! I could not keep up with all the questions and all of them so well thought out. One hit after another!"], ["@_ShrewdJude", "Liberty for all, together we stand divided we fall. I wont forget those words from my childhood and team sports taught me to stick together no matter what your differences are."], ["@bragg6832", "Carlson is the perfect dummy to be fooled by whoever, he looks like a child th whole interview lmao"], ["@yassinerami6484", "America is a joke. Only show you what they want you to see. Is this a really a democracy? Im glad the truth is starting to come out against America all over the world. Just look at Palestine. Let’s all thank technology for what we see today. Imagine the Native Americans having phones to record the horrific nature they went against. People are starting to wake up. Well most."], ["@Ghost-wb1js", "только начал смотреть, а мне уже стыдно"], ["@singu7arity", "As someone who didn't watch the interview I must say that translator did an amazing job!"], ["@bogeedan", "Putin: let me explain why I attacked Ukraine in 30 seconds\r\nAlso Putin 30 minutes later: ...and that's why duke Oleg the Wise was killed by snake"], ["@EvansGambitAtomicZangi", "You just gotta ignite the light\r\nAnd let it shine\r\nJust own the night\r\nLike the Fourth of July\r\n'Cause baby, you're a firework"], ["@PORTFOLIOPROS_", "@tuckercarlson / \"This is complete nonsense, we must carefully look into it,\" Vladimir Putin commented on the inclusion of Jehovah's Witnesses in the list of extremist organizations. The corresponding question was asked to him at a meeting of the Council for the Development of Civil Society and Human Rights, which was held in Moscow on December 11, 2018. \"We have to be much more liberal at some point... Treat all religions equally. [We should not] be enrolled in some kind of destructive... Jehovah's Witnesses are a Christian religion whose beliefs are based on the Bible.\n\nThe name means that believers “witness” to the people around them about God through words and deeds. Jehovah is the revealed name of God, the Creator of all things, in the Bible. Jesus Christ for Jehovah's Witnesses is the Savior, the Son of God, the Mentor and the Heavenly King. They follow his teachings in their lives.\n\nBy 2017, when the Supreme Court of the Russian Federation banned the activities of all 396 registered organizations of Jehovah's Witnesses in Russia, 175,000 people actively practiced this religion in the country, and a total of approximately 300,000 Russians attended their services at least once a year. Worldwide, the number of those who attend meetings of Jehovah's Witnesses reaches more than 21 million. The Russian authorities issued the first permission for religious activity back in 1913. After the era of Soviet repressions had ended, Jehovah's Witnesses received official registration in Russia in 1992. Thereafter, their meetings for worship were attended by up to 290,000 people. In 2017, the Supreme Court of the Russian Federation liquidated all legal entities and confiscated hundreds of religious buildings. Searches began, and hundreds of believers were sent to jail. In 2022, the ECHR exonerated Jehovah's Witnesses and ordered Russia to stop their criminal prosecution and to compensate them for all the harm caused. The court banned the activities of 396 registered and operating Jehovah's Witnesses organizations. This decision has been challenged in the European Court of Human Rights.\n\nThe statement of the Presidential Council for the Development of Civil Society and Human Rights of 20.06.18 says: \"This decision of the [Supreme] Court contains an exhaustive list of legal entities subject to liquidation. At the same time, the court's decision does not contain conclusions about the ban on the religion of Jehovah's Witnesses as such.\"\n\nIs it allowed in Russia to practice religion without forming a legal entity? Yes. Jehovah's Witnesses have lived in Russia for more than a hundred years, and for most of that time they practiced their faith without the organizations that emerged in the late 1990s under the Freedom of Conscience Law and lasted less than 20 years. The presence or absence of such organizations does not mean the prohibition of entire religions, and even more so does not give grounds for criminal prosecution of citizens for their beliefs.\n\nIs it possible to ban people, ideas, beliefs, thoughts, and feelings? This is both impossible and unacceptable. According to Article 28 of the Constitution of the Russian Federation, everyone has the right \"to freely choose, have and disseminate religious and other beliefs and to act in accordance with them.\" This right extends to believers of all views and beliefs, including Jehovah's Witnesses. No court in Russia has ever recognized the religion or beliefs of Jehovah's Witnesses as criminal. Such a decision would be discriminatory and unconstitutional."], ["@goldmane5350", "every morning Biden learns that he is president"], ["@Kalenz1234", "The weirdest thing is that Putin needs a translator and answers in Russian."], ["@pb5x5", "So Poland started world war 2, hey Tucker you sucker................ I guess they paid you well."], ["@matthewanderson5329", "Congratulations Tucker, you provided the murderous dictator a massive platform with a relatively uncontested interview. You have actively shaped the information domain in favor of an adversary, you jackass."], ["@rohitwalmiki271", "1:45:53 best about dostoyevsky"], ["@sarahb2731", "WHY DID TUCKER\nKISS UP TO PUTIN ????"], ["@neneanea", "He's full of lies. Already on the second minute of the video:\n-If u don't mind I'll take 30 seconds to give you a little historical background. \n-Please. \nAnd then he goes on a half an hour pseudo historical manipulative crap.\n  Give me a break."], ["@user-jd7jw4zv4r", "I've not been able to get completely through this yet 😕 .\n   I can't handle the intense Comedy 😂😂😂😂\n   tucker , please move to your beloved Russia. Putin needs a good propaganda minister 🙄"], ["@jasongclj6945", "30:00 \n  1:27:00 \n      2:06:00"], ["@neneanea", "Mr. CARLSSON, do you accept critical comments here, or only adulation?"], ["@jordandouvartzidis1745", "When America gets involved into any conflict you can always guarantee the other side has been provoked into defending its territory, beliefs, religion or political views. American leaders and elites are simply the devil of modern times. \nPutin is a great leader and has a genius mind."], ["@fitnesssvs6647", "Putin The King ❤️  ❤ ❤"], ["@alexeyageev6966", "- Why didn't you make this case in your first 22 years of presidency?\n- Da🗿"], ["@ivanacrnjac7883", "Putin is hero!"], ["@user-wh6qb2tc5t", "18 млн просмотров😄😄😄👍👍👍👍"], ["@53weazel", "Nothing To Do With The Outside World….The West Is Destroying Itself From Within !"], ["@dhakaldinesh4912", "🙏"], ["@No-ky3kb", "\"let me take just 30 seconds to explain the history...\" Longest 30 seconds in history commences"], ["@popindosin228", "Carlson said only things USA wanted to know.\nHe should've asked Putin why he thinks it's ok to drag on his power for more than 20 years and stealing every election.\nThis question could come to use now, after Navalny's death."], ["@davidbernhardberns", "P: How deep do you want to slide into my backdoor?\nT: Yesssss!!!\nCouldn't hope for a better propaganda puppet"], ["@gleko75", "It's a general missunderstanding between East and West, a conflict of interest, they can understand each other through translators, but they don't really understand each other by meanings."], ["@omidakbari2150", "biden wouldn't survive 5 min in this interview. would start talking about him eating ice cream"], ["@kaaro4832", "As a person that speaks Ghanaian, the translator did a fantastic job."], ["@youngstownkicks", "26:31 -- The passion in putins eyes speaking on NATO is something else"], ["@rohitwalmiki271", "1:16:03 best"], ["@dalephillips2879", "and then you've got Joe biden 😂 laughable"], ["@fangtu5318", "American is know for stag in the back"], ["@salvadorortiz9230", "minute 01 hour and 9 minutes so true what putin says"], ["@JustSayN2O", "Guess what NATO just announced.  Ukraine is joining."], ["@kob-dotu", "Навального забудьте. Навіть Буданов підтвердив, що помер він сам і ніхто його не вбивав"], ["@robertart5322", "You're such an important person, I wish everyone could just listen to you with an open mind and start asking yourself the same questions. Brilliant mind Tucker! Wish you and yours well fambam! Throw one in the cheek for me champ!"], ["@ihorian", "One World, One People. In humanity we trust.\nNo one is right and no one is wrong. We are all making choices based on that which we know.\nI am Ukrainian, and this showed me the truth I never thought I would believe to be true. Thank you Tucker 🖖"], ["@TheSpirituralWackadoo", "Great job Tucker"], ["@projectpat2262", "Greatest interview of our time"], ["@mikeblackist", "Putin Is the only leader with courage. \nHe states nothing but facts!\nNo lies detected, according to history his claims are nothing but pure fact.👍"]]